#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AniBP_bear_shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AniBP_bear_shake.AniBP_bear_shake_C
// 0x0C20 (0x0EE0 - 0x02C0)
class UAniBP_bear_shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_6DEB[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02F8(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0410(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0430(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0450(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0558(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0660(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0768(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0870(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0978(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0A80(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0B88(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0C90(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0D98(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0EA0(0x0030)()
	float                                         BlendAlpha;                                        // 0x0ED0(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PushScale;                                         // 0x0ED4(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AniBP_bear_shake(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AniBP_bear_shake_AnimGraphNode_ModifyBone_40AD135444739C28667DCAA8A716D1AC();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AniBP_bear_shake_AnimGraphNode_ModifyBone_2E670B19473096DF5C522EBBB260C012();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AniBP_bear_shake_AnimGraphNode_ModifyBone_AF43C3FC4460D68477D7BD92C30A4AA4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AniBP_bear_shake_AnimGraphNode_ModifyBone_AB0439714B91F82285758097360DDFA4();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AniBP_bear_shake_AnimGraphNode_ModifyBone_F69C4D984227CF7B8C79A1938BCED8C7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AniBP_bear_shake_AnimGraphNode_ModifyBone_A20E7ABD4C1FBAFAC24F25A468E0FFA1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AniBP_bear_shake_AnimGraphNode_ModifyBone_BAF1B41E46D4AA1A43C98EA35C652969();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AniBP_bear_shake_AnimGraphNode_ModifyBone_AB13CDA74ADAAC949B1EE4874198B023();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AniBP_bear_shake_AnimGraphNode_ModifyBone_A5B90076482F82485D763BB77BA83E3F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_AniBP_bear_shake_AnimGraphNode_ModifyBone_40A9EFCE4FFE52C430EBC181CDDDE175();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BoneShakeLayer(const struct FPoseLink& InPose, float Param_PushScale, float Param_BlendAlpha, struct FPoseLink* Param_BoneShakeLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AniBP_bear_shake_C">();
	}
	static class UAniBP_bear_shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAniBP_bear_shake_C>();
	}
};
static_assert(alignof(UAniBP_bear_shake_C) == 0x000010, "Wrong alignment on UAniBP_bear_shake_C");
static_assert(sizeof(UAniBP_bear_shake_C) == 0x000EE0, "Wrong size on UAniBP_bear_shake_C");
static_assert(offsetof(UAniBP_bear_shake_C, UberGraphFrame) == 0x0002C0, "Member 'UAniBP_bear_shake_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_Root_1) == 0x0002C8, "Member 'UAniBP_bear_shake_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_LinkedInputPose) == 0x0002F8, "Member 'UAniBP_bear_shake_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_LocalToComponentSpace) == 0x000410, "Member 'UAniBP_bear_shake_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ComponentToLocalSpace) == 0x000430, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ModifyBone_9) == 0x000450, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ModifyBone_8) == 0x000558, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ModifyBone_7) == 0x000660, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ModifyBone_6) == 0x000768, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ModifyBone_5) == 0x000870, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ModifyBone_4) == 0x000978, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ModifyBone_3) == 0x000A80, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ModifyBone_2) == 0x000B88, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ModifyBone_1) == 0x000C90, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_ModifyBone) == 0x000D98, "Member 'UAniBP_bear_shake_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, AnimGraphNode_Root) == 0x000EA0, "Member 'UAniBP_bear_shake_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, BlendAlpha) == 0x000ED0, "Member 'UAniBP_bear_shake_C::BlendAlpha' has a wrong offset!");
static_assert(offsetof(UAniBP_bear_shake_C, PushScale) == 0x000ED4, "Member 'UAniBP_bear_shake_C::PushScale' has a wrong offset!");

}

