#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsukaMaxATField

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AsukaMaxATField.AsukaMaxATField_C.HottaCalculateBaseMagnitude
// 0x0078 (0x0078 - 0x0000)
struct AsukaMaxATField_C_HottaCalculateBaseMagnitude final
{
public:
	const class AActor*                           OwnerActor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           HitActor;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InstigatorActor;                                   // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A3[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A4[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMultiPlayerGameplayClone_ReturnValue;   // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue; // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetMaxHP_ReturnValue;                     // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHP_ReturnValue_1;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A5[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_2;        // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A6[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_2;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_3;        // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56A7[0x3];                                     // 0x0055(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_3;            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0064(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x0065(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBalanceServerMode_ReturnValue;          // 0x0066(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_4;        // 0x0067(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_4;            // 0x0068(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_4;                    // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AsukaMaxATField_C_HottaCalculateBaseMagnitude) == 0x000008, "Wrong alignment on AsukaMaxATField_C_HottaCalculateBaseMagnitude");
static_assert(sizeof(AsukaMaxATField_C_HottaCalculateBaseMagnitude) == 0x000078, "Wrong size on AsukaMaxATField_C_HottaCalculateBaseMagnitude");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, OwnerActor) == 0x000000, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::OwnerActor' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, HitActor) == 0x000008, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::HitActor' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, InstigatorActor) == 0x000010, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::InstigatorActor' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, ReturnValue) == 0x000018, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult) == 0x00001C, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000020, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_AsHotta_Character) == 0x000028, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_IsMultiPlayerGameplayClone_ReturnValue) == 0x000032, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_IsMultiPlayerGameplayClone_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue) == 0x000033, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_GetMaxHP_ReturnValue) == 0x000034, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_GetMaxHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_GetMaxHP_ReturnValue_1) == 0x000038, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_GetMaxHP_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult_1) == 0x000040, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult_1' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY_1) == 0x000044, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY_1' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000048, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess_1) == 0x00004C, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult_2) == 0x00004D, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult_2' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY_2) == 0x000050, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY_2' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult_3) == 0x000054, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult_3' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY_3) == 0x000058, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY_3' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00005C, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000060, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess_2) == 0x000064, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess_3) == 0x000065, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_IsBalanceServerMode_ReturnValue) == 0x000066, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_IsBalanceServerMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult_4) == 0x000067, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult_4' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY_4) == 0x000068, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY_4' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, CallFunc_Multiply_FloatFloat_ReturnValue_4) == 0x00006C, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::CallFunc_Multiply_FloatFloat_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(AsukaMaxATField_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess_4) == 0x000070, "Member 'AsukaMaxATField_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess_4' has a wrong offset!");

}

