#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsukaRevengeEndDmg

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function AsukaRevengeEndDmg.AsukaRevengeEndDmg_C.HottaCalculateBaseMagnitude
// 0x0068 (0x0068 - 0x0000)
struct AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude final
{
public:
	const class AActor*                           OwnerActor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           HitActor;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InstigatorActor;                                   // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5706[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5707[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5708[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeaponBase*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5709[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_ItemID_ReturnValue;                       // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeaponType                                   CallFunc_GetItemWeaponType_ReturnValue;            // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_CheckItemWeaponElementType_ReturnValue;   // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckItemWeaponElementType_ReturnValue_1; // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBalanceServerMode_ReturnValue;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_1;        // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_1;            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_2;        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570A[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_2;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude) == 0x000008, "Wrong alignment on AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude");
static_assert(sizeof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude) == 0x000068, "Wrong size on AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, OwnerActor) == 0x000000, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::OwnerActor' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, HitActor) == 0x000008, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::HitActor' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, InstigatorActor) == 0x000010, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::InstigatorActor' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, ReturnValue) == 0x000018, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult) == 0x00001C, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000020, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000028, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000038, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_ItemID_ReturnValue) == 0x000044, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_ItemID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_GetItemWeaponType_ReturnValue) == 0x00004C, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_GetItemWeaponType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_CheckItemWeaponElementType_ReturnValue) == 0x00004D, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_CheckItemWeaponElementType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00004E, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_CheckItemWeaponElementType_ReturnValue_1) == 0x00004F, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_CheckItemWeaponElementType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000050, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess) == 0x000051, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_IsBalanceServerMode_ReturnValue) == 0x000052, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_IsBalanceServerMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult_1) == 0x000053, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult_1' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY_1) == 0x000054, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY_1' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult_2) == 0x000058, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult_2' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY_2) == 0x00005C, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY_2' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess_1) == 0x000060, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess_2) == 0x000061, "Member 'AsukaRevengeEndDmg_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");

}

