#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsukaAddATField

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AsukaAddATField.AsukaAddATField_C.HottaCalculateBaseMagnitude
// 0x0050 (0x0050 - 0x0000)
struct AsukaAddATField_C_HottaCalculateBaseMagnitude final
{
public:
	const class AActor*                           OwnerActor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           HitActor;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InstigatorActor;                                   // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56EE[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56EF[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56F0[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxATField_ReturnValue;                // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBalanceServerMode_ReturnValue;          // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56F1[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_1;        // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56F2[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56F3[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(AsukaAddATField_C_HottaCalculateBaseMagnitude) == 0x000008, "Wrong alignment on AsukaAddATField_C_HottaCalculateBaseMagnitude");
static_assert(sizeof(AsukaAddATField_C_HottaCalculateBaseMagnitude) == 0x000050, "Wrong size on AsukaAddATField_C_HottaCalculateBaseMagnitude");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, OwnerActor) == 0x000000, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::OwnerActor' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, HitActor) == 0x000008, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::HitActor' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, InstigatorActor) == 0x000010, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::InstigatorActor' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, ReturnValue) == 0x000018, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult) == 0x00001C, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY) == 0x000020, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_AsHotta_Character) == 0x000028, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess) == 0x000031, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, CallFunc_GetMaxATField_ReturnValue) == 0x000034, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::CallFunc_GetMaxATField_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, CallFunc_IsBalanceServerMode_ReturnValue) == 0x000038, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::CallFunc_IsBalanceServerMode_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult_1) == 0x000040, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult_1' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY_1) == 0x000044, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY_1' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess_1) == 0x000048, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(AsukaAddATField_C_HottaCalculateBaseMagnitude, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00004C, "Member 'AsukaAddATField_C_HottaCalculateBaseMagnitude::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");

}

