#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: AsukaRevengeEndDmgBreakDef

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function AsukaRevengeEndDmgBreakDef.AsukaRevengeEndDmgBreakDef_C.HottaCalculateBaseMagnitude
// 0x0050 (0x0050 - 0x0000)
struct AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude final
{
public:
	const class AActor*                           OwnerActor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           HitActor;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InstigatorActor;                                   // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570B[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570C[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeaponBase*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_ItemID_ReturnValue;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckItemWeaponElementType_ReturnValue;   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckItemWeaponElementType_ReturnValue_1; // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_1;        // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_1;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude) == 0x000008, "Wrong alignment on AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude");
static_assert(sizeof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude) == 0x000050, "Wrong size on AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, OwnerActor) == 0x000000, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::OwnerActor' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, HitActor) == 0x000008, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::HitActor' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, InstigatorActor) == 0x000010, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::InstigatorActor' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, ReturnValue) == 0x000018, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_AsHotta_Character) == 0x000020, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000029, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY) == 0x00002C, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000030, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, CallFunc_ItemID_ReturnValue) == 0x000038, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::CallFunc_ItemID_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, CallFunc_CheckItemWeaponElementType_ReturnValue) == 0x000041, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::CallFunc_CheckItemWeaponElementType_ReturnValue' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, CallFunc_CheckItemWeaponElementType_ReturnValue_1) == 0x000042, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::CallFunc_CheckItemWeaponElementType_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult_1) == 0x000043, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult_1' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY_1) == 0x000044, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY_1' has a wrong offset!");
static_assert(offsetof(AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess_1) == 0x000048, "Member 'AsukaRevengeEndDmgBreakDef_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

}

