#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BeIceDamage

#include "Basic.hpp"


namespace SDK::Params
{

// Function BeIceDamage.BeIceDamage_C.CanApplyGameplayEffectContent
// 0x0050 (0x0050 - 0x0000)
struct BeIceDamage_C_CanApplyGameplayEffectContent final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InstigatorActor;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56B4[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56B5[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character_1;            // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDamageTypeOf_ReturnValue;               // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDamageTypeOf_ReturnValue_1;             // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BeIceDamage_C_CanApplyGameplayEffectContent) == 0x000008, "Wrong alignment on BeIceDamage_C_CanApplyGameplayEffectContent");
static_assert(sizeof(BeIceDamage_C_CanApplyGameplayEffectContent) == 0x000050, "Wrong size on BeIceDamage_C_CanApplyGameplayEffectContent");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, SourceActor) == 0x000000, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::SourceActor' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, TargetActor) == 0x000008, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::TargetActor' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, InstigatorActor) == 0x000010, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::InstigatorActor' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, GameplayEffect) == 0x000018, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::GameplayEffect' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, ReturnValue) == 0x000020, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_AsHotta_Character) == 0x000030, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_AsHotta_Character_1) == 0x000040, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_AsHotta_Character_1' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_bSuccess_1) == 0x000048, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, CallFunc_IsDamageTypeOf_ReturnValue) == 0x000049, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::CallFunc_IsDamageTypeOf_ReturnValue' has a wrong offset!");
static_assert(offsetof(BeIceDamage_C_CanApplyGameplayEffectContent, CallFunc_IsDamageTypeOf_ReturnValue_1) == 0x00004A, "Member 'BeIceDamage_C_CanApplyGameplayEffectContent::CallFunc_IsDamageTypeOf_ReturnValue_1' has a wrong offset!");

}

