#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Blu

#include "Basic.hpp"


namespace SDK
{

// Enum Blu.EBluSpecialKeys
// NumValues: 0x0013
enum class EBluSpecialKeys : uint8
{
	backspacekey                             = 8,
	Tabkey                                   = 9,
	Enterkey                                 = 13,
	Pausekey                                 = 19,
	Escapekey                                = 27,
	Pageupkey                                = 33,
	Pagedownkey                              = 34,
	Endkey                                   = 35,
	Homekey                                  = 36,
	Leftarrowkey                             = 37,
	Rightarrowkey                            = 39,
	Downarrowkey                             = 40,
	Uparrowkey                               = 38,
	Insertkey                                = 45,
	Deletekey                                = 46,
	Numlockkey                               = 144,
	Scrolllockkey                            = 145,
	Unknownkey                               = 0,
	EBluSpecialKeys_MAX                      = 146,
};

// ScriptStruct Blu.BluEyeSettings
// 0x0014 (0x0014 - 0x0000)
struct FBluEyeSettings final
{
public:
	float                                         FrameRate;                                         // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIsTransparent;                                    // 0x0004(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189C[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Width;                                             // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         Height;                                            // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bEnableWebGL;                                      // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAudioMuted;                                       // 0x0011(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bAutoPlayEnabled;                                  // 0x0012(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_189D[0x1];                                     // 0x0013(0x0001)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FBluEyeSettings) == 0x000004, "Wrong alignment on FBluEyeSettings");
static_assert(sizeof(FBluEyeSettings) == 0x000014, "Wrong size on FBluEyeSettings");
static_assert(offsetof(FBluEyeSettings, FrameRate) == 0x000000, "Member 'FBluEyeSettings::FrameRate' has a wrong offset!");
static_assert(offsetof(FBluEyeSettings, bIsTransparent) == 0x000004, "Member 'FBluEyeSettings::bIsTransparent' has a wrong offset!");
static_assert(offsetof(FBluEyeSettings, Width) == 0x000008, "Member 'FBluEyeSettings::Width' has a wrong offset!");
static_assert(offsetof(FBluEyeSettings, Height) == 0x00000C, "Member 'FBluEyeSettings::Height' has a wrong offset!");
static_assert(offsetof(FBluEyeSettings, bEnableWebGL) == 0x000010, "Member 'FBluEyeSettings::bEnableWebGL' has a wrong offset!");
static_assert(offsetof(FBluEyeSettings, bAudioMuted) == 0x000011, "Member 'FBluEyeSettings::bAudioMuted' has a wrong offset!");
static_assert(offsetof(FBluEyeSettings, bAutoPlayEnabled) == 0x000012, "Member 'FBluEyeSettings::bAutoPlayEnabled' has a wrong offset!");

}

