#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BowAnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BowAnimBP.BowAnimBP_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct BowAnimBP_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(BowAnimBP_C_AnimGraph) == 0x000008, "Wrong alignment on BowAnimBP_C_AnimGraph");
static_assert(sizeof(BowAnimBP_C_AnimGraph) == 0x000010, "Wrong size on BowAnimBP_C_AnimGraph");
static_assert(offsetof(BowAnimBP_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'BowAnimBP_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function BowAnimBP.BowAnimBP_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct BowAnimBP_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BowAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on BowAnimBP_C_BlueprintUpdateAnimation");
static_assert(sizeof(BowAnimBP_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on BowAnimBP_C_BlueprintUpdateAnimation");
static_assert(offsetof(BowAnimBP_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'BowAnimBP_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function BowAnimBP.BowAnimBP_C.ExecuteUbergraph_BowAnimBP
// 0x0038 (0x0038 - 0x0000)
struct BowAnimBP_C_ExecuteUbergraph_BowAnimBP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwningActor_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeaponBase*                            K2Node_DynamicCast_AsWeapon_Base;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_588D[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAimming_ReturnValue;                    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP) == 0x000008, "Wrong alignment on BowAnimBP_C_ExecuteUbergraph_BowAnimBP");
static_assert(sizeof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP) == 0x000038, "Wrong size on BowAnimBP_C_ExecuteUbergraph_BowAnimBP");
static_assert(offsetof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP, EntryPoint) == 0x000000, "Member 'BowAnimBP_C_ExecuteUbergraph_BowAnimBP::EntryPoint' has a wrong offset!");
static_assert(offsetof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'BowAnimBP_C_ExecuteUbergraph_BowAnimBP::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP, CallFunc_GetOwningActor_ReturnValue) == 0x000008, "Member 'BowAnimBP_C_ExecuteUbergraph_BowAnimBP::CallFunc_GetOwningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP, K2Node_DynamicCast_AsWeapon_Base) == 0x000010, "Member 'BowAnimBP_C_ExecuteUbergraph_BowAnimBP::K2Node_DynamicCast_AsWeapon_Base' has a wrong offset!");
static_assert(offsetof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BowAnimBP_C_ExecuteUbergraph_BowAnimBP::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP, CallFunc_GetOwner_ReturnValue) == 0x000020, "Member 'BowAnimBP_C_ExecuteUbergraph_BowAnimBP::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000028, "Member 'BowAnimBP_C_ExecuteUbergraph_BowAnimBP::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BowAnimBP_C_ExecuteUbergraph_BowAnimBP::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP, CallFunc_IsAimming_ReturnValue) == 0x000031, "Member 'BowAnimBP_C_ExecuteUbergraph_BowAnimBP::CallFunc_IsAimming_ReturnValue' has a wrong offset!");
static_assert(offsetof(BowAnimBP_C_ExecuteUbergraph_BowAnimBP, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x000032, "Member 'BowAnimBP_C_ExecuteUbergraph_BowAnimBP::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");

}

