#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_AIMovePoint_Reward

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_AIMovePoint_Reward.BP_AIMovePoint_Reward_C.ExecuteUbergraph_BP_AIMovePoint_Reward
// 0x00B8 (0x00B8 - 0x0000)
struct BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5577[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5578[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AScanner_jellyfish_C*                   K2Node_DynamicCast_AsScanner_Jellyfish;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5579[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_557A[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_2;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AScanner_honeybee_C*                    K2Node_DynamicCast_AsScanner_Honeybee;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_557B[0x6];                                     // 0x0052(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AScanner_Base_C*                        K2Node_DynamicCast_AsScanner_Base;                 // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_557C[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaVisualSpawnManager*               K2Node_ComponentBoundEvent_InstigateSpawner;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_557D[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_1;   // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_1;               // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0093(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_557E[0x3];                                     // 0x0095(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_2;   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_2;               // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue_1;     // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00A3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_557F[0x4];                                     // 0x00A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_3;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue_2;     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward) == 0x000008, "Wrong alignment on BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward");
static_assert(sizeof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward) == 0x0000B8, "Wrong size on BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, EntryPoint) == 0x000000, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_Event_OtherActor) == 0x000008, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_SwitchNetMode_OutNetMode) == 0x000010, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_DynamicCast_AsScanner_Jellyfish) == 0x000018, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_DynamicCast_AsScanner_Jellyfish' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_SwitchEnum_CmpSuccess) == 0x000021, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_GetObjectClass_ReturnValue) == 0x000028, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_GetObjectClass_ReturnValue_1) == 0x000030, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000038, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000039, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_GetObjectClass_ReturnValue_2) == 0x000040, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_GetObjectClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_DynamicCast_AsScanner_Honeybee) == 0x000048, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_DynamicCast_AsScanner_Honeybee' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x000051, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_DynamicCast_AsScanner_Base) == 0x000058, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_DynamicCast_AsScanner_Base' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000068, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_ComponentBoundEvent_InstigateSpawner) == 0x000070, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_ComponentBoundEvent_InstigateSpawner' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_IsYahaha2SubmittedByID_ReturnValue) == 0x000078, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_IsYahaha2SubmittedByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_GetClientPlayerCharacter_ReturnValue_1) == 0x000080, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_GetClientPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000088, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_IsValid_ReturnValue) == 0x000091, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_SwitchNetMode_OutNetMode_1) == 0x000092, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_SwitchNetMode_OutNetMode_1' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_SwitchEnum_CmpSuccess_1) == 0x000093, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_IsValid_ReturnValue_1) == 0x000094, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_GetClientPlayerCharacter_ReturnValue_2) == 0x000098, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_GetClientPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_SwitchNetMode_OutNetMode_2) == 0x0000A0, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_SwitchNetMode_OutNetMode_2' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_IsYahaha2SubmittedByID_ReturnValue_1) == 0x0000A1, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_IsYahaha2SubmittedByID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, K2Node_SwitchEnum_CmpSuccess_2) == 0x0000A2, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_IsValid_ReturnValue_2) == 0x0000A3, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_GetClientPlayerCharacter_ReturnValue_3) == 0x0000A8, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_GetClientPlayerCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward, CallFunc_IsYahaha2SubmittedByID_ReturnValue_2) == 0x0000B0, "Member 'BP_AIMovePoint_Reward_C_ExecuteUbergraph_BP_AIMovePoint_Reward::CallFunc_IsYahaha2SubmittedByID_ReturnValue_2' has a wrong offset!");

// Function BP_AIMovePoint_Reward.BP_AIMovePoint_Reward_C.BndEvt__BP_AIMovePoint_Reward_RewardSpawner_0_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_AIMovePoint_Reward_C_BndEvt__BP_AIMovePoint_Reward_RewardSpawner_0_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature final
{
public:
	class AHottaVisualSpawnManager*               InstigateSpawner;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIMovePoint_Reward_C_BndEvt__BP_AIMovePoint_Reward_RewardSpawner_0_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_AIMovePoint_Reward_C_BndEvt__BP_AIMovePoint_Reward_RewardSpawner_0_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(sizeof(BP_AIMovePoint_Reward_C_BndEvt__BP_AIMovePoint_Reward_RewardSpawner_0_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong size on BP_AIMovePoint_Reward_C_BndEvt__BP_AIMovePoint_Reward_RewardSpawner_0_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(offsetof(BP_AIMovePoint_Reward_C_BndEvt__BP_AIMovePoint_Reward_RewardSpawner_0_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature, InstigateSpawner) == 0x000000, "Member 'BP_AIMovePoint_Reward_C_BndEvt__BP_AIMovePoint_Reward_RewardSpawner_0_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature::InstigateSpawner' has a wrong offset!");

// Function BP_AIMovePoint_Reward.BP_AIMovePoint_Reward_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct BP_AIMovePoint_Reward_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_AIMovePoint_Reward_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on BP_AIMovePoint_Reward_C_ReceiveActorBeginOverlap");
static_assert(sizeof(BP_AIMovePoint_Reward_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on BP_AIMovePoint_Reward_C_ReceiveActorBeginOverlap");
static_assert(offsetof(BP_AIMovePoint_Reward_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'BP_AIMovePoint_Reward_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

