#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Airwall_Vera_world_002

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_HottaActorBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Airwall_Vera_world_002.BP_Airwall_Vera_world_002_C
// 0x0018 (0x0280 - 0x0268)
class ABP_Airwall_Vera_world_002_C final : public ABP_HottaActorBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          Box;                                               // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   StaticMesh;                                        // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Airwall_Vera_world_002(int32 EntryPoint);
	void BndEvt__BP_AirwallTips_Vera_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__BP_AirwallTips_Vera_Box_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Airwall_Vera_world_002_C">();
	}
	static class ABP_Airwall_Vera_world_002_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Airwall_Vera_world_002_C>();
	}
};
static_assert(alignof(ABP_Airwall_Vera_world_002_C) == 0x000008, "Wrong alignment on ABP_Airwall_Vera_world_002_C");
static_assert(sizeof(ABP_Airwall_Vera_world_002_C) == 0x000280, "Wrong size on ABP_Airwall_Vera_world_002_C");
static_assert(offsetof(ABP_Airwall_Vera_world_002_C, UberGraphFrame) == 0x000268, "Member 'ABP_Airwall_Vera_world_002_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Airwall_Vera_world_002_C, Box) == 0x000270, "Member 'ABP_Airwall_Vera_world_002_C::Box' has a wrong offset!");
static_assert(offsetof(ABP_Airwall_Vera_world_002_C, StaticMesh) == 0x000278, "Member 'ABP_Airwall_Vera_world_002_C::StaticMesh' has a wrong offset!");

}

