#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BurnGrassActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_BurnGrassActor.BP_BurnGrassActor_C
// 0x0048 (0x02F8 - 0x02B0)
class ABP_BurnGrassActor_C final : public AHottaBurnGrassActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   Cube2;                                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   Cube;                                              // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               DrawBurnMat_Dynamic;                               // 0x02C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UParticleSystemComponent*>       FireEmmiters;                                      // 0x02D0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               DrawBurnMat_ToLocal_Dynamic;                       // 0x02E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsCut;                                             // 0x02E8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsBurn;                                            // 0x02E9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_553D[0x2];                                     // 0x02EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         FireParticleMinScale;                              // 0x02EC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FireParticleMaxScale;                              // 0x02F0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void InitMat();
	void OnRep_localRT();
	void OnLoaded_EB0458174DB6E2498F62979AA7D541EB(class UObject* Loaded);
	void OnGrassResidueEvent(const struct FVector& ResidueLocation);
	void ClearBurnEffectEvent();
	void OnBurnGrassEvent(const struct FVector& BurnLocation, bool PlayerEffect);
	void ReceiveBeginPlay();
	void OnCutGrassEvent(const struct FVector& BurnLocation, bool PlayerEffect);
	void ExecuteUbergraph_BP_BurnGrassActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_BurnGrassActor_C">();
	}
	static class ABP_BurnGrassActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_BurnGrassActor_C>();
	}
};
static_assert(alignof(ABP_BurnGrassActor_C) == 0x000008, "Wrong alignment on ABP_BurnGrassActor_C");
static_assert(sizeof(ABP_BurnGrassActor_C) == 0x0002F8, "Wrong size on ABP_BurnGrassActor_C");
static_assert(offsetof(ABP_BurnGrassActor_C, UberGraphFrame) == 0x0002B0, "Member 'ABP_BurnGrassActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_BurnGrassActor_C, Cube2) == 0x0002B8, "Member 'ABP_BurnGrassActor_C::Cube2' has a wrong offset!");
static_assert(offsetof(ABP_BurnGrassActor_C, Cube) == 0x0002C0, "Member 'ABP_BurnGrassActor_C::Cube' has a wrong offset!");
static_assert(offsetof(ABP_BurnGrassActor_C, DrawBurnMat_Dynamic) == 0x0002C8, "Member 'ABP_BurnGrassActor_C::DrawBurnMat_Dynamic' has a wrong offset!");
static_assert(offsetof(ABP_BurnGrassActor_C, FireEmmiters) == 0x0002D0, "Member 'ABP_BurnGrassActor_C::FireEmmiters' has a wrong offset!");
static_assert(offsetof(ABP_BurnGrassActor_C, DrawBurnMat_ToLocal_Dynamic) == 0x0002E0, "Member 'ABP_BurnGrassActor_C::DrawBurnMat_ToLocal_Dynamic' has a wrong offset!");
static_assert(offsetof(ABP_BurnGrassActor_C, IsCut) == 0x0002E8, "Member 'ABP_BurnGrassActor_C::IsCut' has a wrong offset!");
static_assert(offsetof(ABP_BurnGrassActor_C, IsBurn) == 0x0002E9, "Member 'ABP_BurnGrassActor_C::IsBurn' has a wrong offset!");
static_assert(offsetof(ABP_BurnGrassActor_C, FireParticleMinScale) == 0x0002EC, "Member 'ABP_BurnGrassActor_C::FireParticleMinScale' has a wrong offset!");
static_assert(offsetof(ABP_BurnGrassActor_C, FireParticleMaxScale) == 0x0002F0, "Member 'ABP_BurnGrassActor_C::FireParticleMaxScale' has a wrong offset!");

}

