#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_BackHairGhostTrail

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_BackHairGhostTrail.BP_BackHairGhostTrail_C.ExecuteUbergraph_BP_BackHairGhostTrail
// 0x0038 (0x0038 - 0x0000)
struct BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5894[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5895[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character_1;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_HasMatchingGameplayTag_ReturnValue;    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail) == 0x000008, "Wrong alignment on BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail");
static_assert(sizeof(BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail) == 0x000038, "Wrong size on BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail");
static_assert(offsetof(BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail, EntryPoint) == 0x000000, "Member 'BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000010, "Member 'BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000020, "Member 'BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail, K2Node_DynamicCast_AsHotta_Player_Character_1) == 0x000028, "Member 'BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail::K2Node_DynamicCast_AsHotta_Player_Character_1' has a wrong offset!");
static_assert(offsetof(BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail, CallFunc_K2_HasMatchingGameplayTag_ReturnValue) == 0x000031, "Member 'BP_BackHairGhostTrail_C_ExecuteUbergraph_BP_BackHairGhostTrail::CallFunc_K2_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

}

