#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_CameraManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_CameraManager.BP_CameraManager_C.BlueprintUpdateCamera
// 0x0028 (0x0028 - 0x0000)
struct BP_CameraManager_C_BlueprintUpdateCamera final
{
public:
	class AActor*                                 CameraTarget;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                NewCameraLocation;                                 // 0x0008(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               NewCameraRotation;                                 // 0x0014(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         NewCameraFOV;                                      // 0x0020(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0024(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_CameraManager_C_BlueprintUpdateCamera) == 0x000008, "Wrong alignment on BP_CameraManager_C_BlueprintUpdateCamera");
static_assert(sizeof(BP_CameraManager_C_BlueprintUpdateCamera) == 0x000028, "Wrong size on BP_CameraManager_C_BlueprintUpdateCamera");
static_assert(offsetof(BP_CameraManager_C_BlueprintUpdateCamera, CameraTarget) == 0x000000, "Member 'BP_CameraManager_C_BlueprintUpdateCamera::CameraTarget' has a wrong offset!");
static_assert(offsetof(BP_CameraManager_C_BlueprintUpdateCamera, NewCameraLocation) == 0x000008, "Member 'BP_CameraManager_C_BlueprintUpdateCamera::NewCameraLocation' has a wrong offset!");
static_assert(offsetof(BP_CameraManager_C_BlueprintUpdateCamera, NewCameraRotation) == 0x000014, "Member 'BP_CameraManager_C_BlueprintUpdateCamera::NewCameraRotation' has a wrong offset!");
static_assert(offsetof(BP_CameraManager_C_BlueprintUpdateCamera, NewCameraFOV) == 0x000020, "Member 'BP_CameraManager_C_BlueprintUpdateCamera::NewCameraFOV' has a wrong offset!");
static_assert(offsetof(BP_CameraManager_C_BlueprintUpdateCamera, ReturnValue) == 0x000024, "Member 'BP_CameraManager_C_BlueprintUpdateCamera::ReturnValue' has a wrong offset!");

// Function BP_CameraManager.BP_CameraManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_CameraManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_CameraManager_C_ReceiveTick");
static_assert(sizeof(BP_CameraManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_CameraManager_C_ReceiveTick");
static_assert(offsetof(BP_CameraManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_CameraManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_CameraManager.BP_CameraManager_C.ExecuteUbergraph_BP_CameraManager
// 0x0008 (0x0008 - 0x0000)
struct BP_CameraManager_C_ExecuteUbergraph_BP_CameraManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_CameraManager_C_ExecuteUbergraph_BP_CameraManager) == 0x000004, "Wrong alignment on BP_CameraManager_C_ExecuteUbergraph_BP_CameraManager");
static_assert(sizeof(BP_CameraManager_C_ExecuteUbergraph_BP_CameraManager) == 0x000008, "Wrong size on BP_CameraManager_C_ExecuteUbergraph_BP_CameraManager");
static_assert(offsetof(BP_CameraManager_C_ExecuteUbergraph_BP_CameraManager, EntryPoint) == 0x000000, "Member 'BP_CameraManager_C_ExecuteUbergraph_BP_CameraManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_CameraManager_C_ExecuteUbergraph_BP_CameraManager, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'BP_CameraManager_C_ExecuteUbergraph_BP_CameraManager::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

