#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_EternalWatcher

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_EternalWatcher.BP_EternalWatcher_C
// 0x01D0 (0x0770 - 0x05A0)
class ABP_EternalWatcher_C final : public AHottaVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          GuideBox;                                          // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   WatcherMesh;                                       // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UQRSLChangeMeshColorComponent*          QRSLChangeMeshColor;                               // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          WatchingBox;                                       // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       InteractSphere;                                    // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         LookAt_LookAt_488559F1448722CAF481438A8D1753F7;    // 0x05D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            LookAt__Direction_488559F1448722CAF481438A8D1753F7; // 0x05DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D9D[0x3];                                     // 0x05DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     LookAt;                                            // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FInteractEntry                         InteractEntry;                                     // 0x05E8(0x00E0)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class AHottaVisualSpawnManager*               RewardSpawner;                                     // 0x06C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TolerateTime;                                      // 0x06D0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Time;                                              // 0x06D4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationNow;                                       // 0x06D8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               RotationAfter;                                     // 0x06E4(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsFinished_;                                       // 0x06F0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOpen_;                                           // 0x06F1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsPlayingClose_;                                   // 0x06F2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D9E[0x5];                                     // 0x06F3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimMontage*                           OpenMont;                                          // 0x06F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CloseMont;                                         // 0x0700(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           CloseloopMont;                                     // 0x0708(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           OpenloopMont;                                      // 0x0710(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           FindloopMont;                                      // 0x0718(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         RedEyedParti;                                      // 0x0720(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         BlueEyedParti;                                     // 0x0748(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_EternalWatcher(int32 EntryPoint);
	void TestCollision();
	void ReceiveTick(float DeltaSeconds);
	void BndEvt__BP_EternalWatcher_WatchingBox_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPOnMainRoleLoadFinished(class AHottaPlayerCharacter* MainPlayer);
	void BndEvt__BP_EternalWatcher_RewardSpawner_K2Node_ComponentBoundEvent_2_AllVisualsHarvestedSignature__DelegateSignature(class AHottaVisualSpawnManager* InstigateSpawner);
	void BPInteractFinished(class AHottaPlayerController* ByPC, int32 InteractIndex);
	void BndEvt__BP_EternalWatcher_WatchingBox_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnLoaded_4062BFA74070FE37CF0486B94759CA39(class UObject* Loaded);
	void OnLoaded_A3F73B1D42BB935FF3706CA79E1F7CBC(class UObject* Loaded);
	void OnLoaded_2BB381CB46C56AE86A7BF58D7427FD52(class UObject* Loaded);
	void OnLoaded_A4A1E9CF46AFF0352E33B68D1D94814A(class UObject* Loaded);
	void OnCompleted_669755B24EF231E23D456C9C47F35C93(class FName NotifyName);
	void OnBlendOut_669755B24EF231E23D456C9C47F35C93(class FName NotifyName);
	void OnInterrupted_669755B24EF231E23D456C9C47F35C93(class FName NotifyName);
	void OnNotifyBegin_669755B24EF231E23D456C9C47F35C93(class FName NotifyName);
	void OnNotifyEnd_669755B24EF231E23D456C9C47F35C93(class FName NotifyName);
	void OnCompleted_D69AC1D64B40C6D852DBE89B1BD5526B(class FName NotifyName);
	void OnBlendOut_D69AC1D64B40C6D852DBE89B1BD5526B(class FName NotifyName);
	void OnInterrupted_D69AC1D64B40C6D852DBE89B1BD5526B(class FName NotifyName);
	void OnNotifyBegin_D69AC1D64B40C6D852DBE89B1BD5526B(class FName NotifyName);
	void OnNotifyEnd_D69AC1D64B40C6D852DBE89B1BD5526B(class FName NotifyName);
	void OnCompleted_C391FAF84C15E05153390BBCF4DFD287(class FName NotifyName);
	void OnBlendOut_C391FAF84C15E05153390BBCF4DFD287(class FName NotifyName);
	void OnInterrupted_C391FAF84C15E05153390BBCF4DFD287(class FName NotifyName);
	void OnNotifyBegin_C391FAF84C15E05153390BBCF4DFD287(class FName NotifyName);
	void OnNotifyEnd_C391FAF84C15E05153390BBCF4DFD287(class FName NotifyName);
	void OnCompleted_095E0262457F69D4DDB9CB9CE56D986B(class FName NotifyName);
	void OnBlendOut_095E0262457F69D4DDB9CB9CE56D986B(class FName NotifyName);
	void OnInterrupted_095E0262457F69D4DDB9CB9CE56D986B(class FName NotifyName);
	void OnNotifyBegin_095E0262457F69D4DDB9CB9CE56D986B(class FName NotifyName);
	void OnNotifyEnd_095E0262457F69D4DDB9CB9CE56D986B(class FName NotifyName);
	void OnCompleted_71D8F6D14F257215D21F979FB2643EAD(class FName NotifyName);
	void OnBlendOut_71D8F6D14F257215D21F979FB2643EAD(class FName NotifyName);
	void OnInterrupted_71D8F6D14F257215D21F979FB2643EAD(class FName NotifyName);
	void OnNotifyBegin_71D8F6D14F257215D21F979FB2643EAD(class FName NotifyName);
	void OnNotifyEnd_71D8F6D14F257215D21F979FB2643EAD(class FName NotifyName);
	void OnCompleted_171C4AC34735BB7D6B3ADFA9127E63C5(class FName NotifyName);
	void OnBlendOut_171C4AC34735BB7D6B3ADFA9127E63C5(class FName NotifyName);
	void OnInterrupted_171C4AC34735BB7D6B3ADFA9127E63C5(class FName NotifyName);
	void OnNotifyBegin_171C4AC34735BB7D6B3ADFA9127E63C5(class FName NotifyName);
	void OnNotifyEnd_171C4AC34735BB7D6B3ADFA9127E63C5(class FName NotifyName);
	void OnCompleted_51BB85B349B066F1786A1DBB5203369A(class FName NotifyName);
	void OnBlendOut_51BB85B349B066F1786A1DBB5203369A(class FName NotifyName);
	void OnInterrupted_51BB85B349B066F1786A1DBB5203369A(class FName NotifyName);
	void OnNotifyBegin_51BB85B349B066F1786A1DBB5203369A(class FName NotifyName);
	void OnNotifyEnd_51BB85B349B066F1786A1DBB5203369A(class FName NotifyName);
	void OnCompleted_86AA963041F949FBC97E04BE92ACBCD5(class FName NotifyName);
	void OnBlendOut_86AA963041F949FBC97E04BE92ACBCD5(class FName NotifyName);
	void OnInterrupted_86AA963041F949FBC97E04BE92ACBCD5(class FName NotifyName);
	void OnNotifyBegin_86AA963041F949FBC97E04BE92ACBCD5(class FName NotifyName);
	void OnNotifyEnd_86AA963041F949FBC97E04BE92ACBCD5(class FName NotifyName);
	void OnCompleted_18FF73C14BE20F86EB986BBD294DA19B(class FName NotifyName);
	void OnBlendOut_18FF73C14BE20F86EB986BBD294DA19B(class FName NotifyName);
	void OnInterrupted_18FF73C14BE20F86EB986BBD294DA19B(class FName NotifyName);
	void OnNotifyBegin_18FF73C14BE20F86EB986BBD294DA19B(class FName NotifyName);
	void OnNotifyEnd_18FF73C14BE20F86EB986BBD294DA19B(class FName NotifyName);
	void OnCompleted_F36ED7EC4DAF8EBF76E790987F2B29FD(class FName NotifyName);
	void OnBlendOut_F36ED7EC4DAF8EBF76E790987F2B29FD(class FName NotifyName);
	void OnInterrupted_F36ED7EC4DAF8EBF76E790987F2B29FD(class FName NotifyName);
	void OnNotifyBegin_F36ED7EC4DAF8EBF76E790987F2B29FD(class FName NotifyName);
	void OnNotifyEnd_F36ED7EC4DAF8EBF76E790987F2B29FD(class FName NotifyName);
	void OnCompleted_22BCBEF44DDE4F2323212E9C2DA69D38(class FName NotifyName);
	void OnBlendOut_22BCBEF44DDE4F2323212E9C2DA69D38(class FName NotifyName);
	void OnInterrupted_22BCBEF44DDE4F2323212E9C2DA69D38(class FName NotifyName);
	void OnNotifyBegin_22BCBEF44DDE4F2323212E9C2DA69D38(class FName NotifyName);
	void OnNotifyEnd_22BCBEF44DDE4F2323212E9C2DA69D38(class FName NotifyName);
	void OnCompleted_FDBE6A52443C293992C4AF86325FBAC2(class FName NotifyName);
	void OnBlendOut_FDBE6A52443C293992C4AF86325FBAC2(class FName NotifyName);
	void OnInterrupted_FDBE6A52443C293992C4AF86325FBAC2(class FName NotifyName);
	void OnNotifyBegin_FDBE6A52443C293992C4AF86325FBAC2(class FName NotifyName);
	void OnNotifyEnd_FDBE6A52443C293992C4AF86325FBAC2(class FName NotifyName);
	void OnCompleted_17A446154F9863FF178D62A951286E55(class FName NotifyName);
	void OnBlendOut_17A446154F9863FF178D62A951286E55(class FName NotifyName);
	void OnInterrupted_17A446154F9863FF178D62A951286E55(class FName NotifyName);
	void OnNotifyBegin_17A446154F9863FF178D62A951286E55(class FName NotifyName);
	void OnNotifyEnd_17A446154F9863FF178D62A951286E55(class FName NotifyName);
	void OnCompleted_BB54918A407D5140E89E6382C0CE3388(class FName NotifyName);
	void OnBlendOut_BB54918A407D5140E89E6382C0CE3388(class FName NotifyName);
	void OnInterrupted_BB54918A407D5140E89E6382C0CE3388(class FName NotifyName);
	void OnNotifyBegin_BB54918A407D5140E89E6382C0CE3388(class FName NotifyName);
	void OnNotifyEnd_BB54918A407D5140E89E6382C0CE3388(class FName NotifyName);
	void OnCompleted_16B3D308427CAEB4C85E76B9FEE7B523(class FName NotifyName);
	void OnBlendOut_16B3D308427CAEB4C85E76B9FEE7B523(class FName NotifyName);
	void OnInterrupted_16B3D308427CAEB4C85E76B9FEE7B523(class FName NotifyName);
	void OnNotifyBegin_16B3D308427CAEB4C85E76B9FEE7B523(class FName NotifyName);
	void OnNotifyEnd_16B3D308427CAEB4C85E76B9FEE7B523(class FName NotifyName);
	void OnCompleted_C7751CCF450AEB2D19CB84BFB68B9F2B(class FName NotifyName);
	void OnBlendOut_C7751CCF450AEB2D19CB84BFB68B9F2B(class FName NotifyName);
	void OnInterrupted_C7751CCF450AEB2D19CB84BFB68B9F2B(class FName NotifyName);
	void OnNotifyBegin_C7751CCF450AEB2D19CB84BFB68B9F2B(class FName NotifyName);
	void OnNotifyEnd_C7751CCF450AEB2D19CB84BFB68B9F2B(class FName NotifyName);
	void LookAt__UpdateFunc();
	void LookAt__FinishedFunc();
	void BPGetInteractEntries(class AHottaPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_EternalWatcher_C">();
	}
	static class ABP_EternalWatcher_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_EternalWatcher_C>();
	}
};
static_assert(alignof(ABP_EternalWatcher_C) == 0x000010, "Wrong alignment on ABP_EternalWatcher_C");
static_assert(sizeof(ABP_EternalWatcher_C) == 0x000770, "Wrong size on ABP_EternalWatcher_C");
static_assert(offsetof(ABP_EternalWatcher_C, UberGraphFrame) == 0x0005A0, "Member 'ABP_EternalWatcher_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, GuideBox) == 0x0005A8, "Member 'ABP_EternalWatcher_C::GuideBox' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, ParticleSystem) == 0x0005B0, "Member 'ABP_EternalWatcher_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, WatcherMesh) == 0x0005B8, "Member 'ABP_EternalWatcher_C::WatcherMesh' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, QRSLChangeMeshColor) == 0x0005C0, "Member 'ABP_EternalWatcher_C::QRSLChangeMeshColor' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, WatchingBox) == 0x0005C8, "Member 'ABP_EternalWatcher_C::WatchingBox' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, InteractSphere) == 0x0005D0, "Member 'ABP_EternalWatcher_C::InteractSphere' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, LookAt_LookAt_488559F1448722CAF481438A8D1753F7) == 0x0005D8, "Member 'ABP_EternalWatcher_C::LookAt_LookAt_488559F1448722CAF481438A8D1753F7' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, LookAt__Direction_488559F1448722CAF481438A8D1753F7) == 0x0005DC, "Member 'ABP_EternalWatcher_C::LookAt__Direction_488559F1448722CAF481438A8D1753F7' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, LookAt) == 0x0005E0, "Member 'ABP_EternalWatcher_C::LookAt' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, InteractEntry) == 0x0005E8, "Member 'ABP_EternalWatcher_C::InteractEntry' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, RewardSpawner) == 0x0006C8, "Member 'ABP_EternalWatcher_C::RewardSpawner' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, TolerateTime) == 0x0006D0, "Member 'ABP_EternalWatcher_C::TolerateTime' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, Time) == 0x0006D4, "Member 'ABP_EternalWatcher_C::Time' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, RotationNow) == 0x0006D8, "Member 'ABP_EternalWatcher_C::RotationNow' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, RotationAfter) == 0x0006E4, "Member 'ABP_EternalWatcher_C::RotationAfter' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, IsFinished_) == 0x0006F0, "Member 'ABP_EternalWatcher_C::IsFinished_' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, IsOpen_) == 0x0006F1, "Member 'ABP_EternalWatcher_C::IsOpen_' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, IsPlayingClose_) == 0x0006F2, "Member 'ABP_EternalWatcher_C::IsPlayingClose_' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, OpenMont) == 0x0006F8, "Member 'ABP_EternalWatcher_C::OpenMont' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, CloseMont) == 0x000700, "Member 'ABP_EternalWatcher_C::CloseMont' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, CloseloopMont) == 0x000708, "Member 'ABP_EternalWatcher_C::CloseloopMont' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, OpenloopMont) == 0x000710, "Member 'ABP_EternalWatcher_C::OpenloopMont' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, FindloopMont) == 0x000718, "Member 'ABP_EternalWatcher_C::FindloopMont' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, RedEyedParti) == 0x000720, "Member 'ABP_EternalWatcher_C::RedEyedParti' has a wrong offset!");
static_assert(offsetof(ABP_EternalWatcher_C, BlueEyedParti) == 0x000748, "Member 'ABP_EternalWatcher_C::BlueEyedParti' has a wrong offset!");

}

