#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Furniture_Case1

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_Furniture_Case1.BP_Furniture_Case1_C.BPStartInteract
// 0x0010 (0x0010 - 0x0000)
struct BP_Furniture_Case1_C_BPStartInteract final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Furniture_Case1_C_BPStartInteract) == 0x000008, "Wrong alignment on BP_Furniture_Case1_C_BPStartInteract");
static_assert(sizeof(BP_Furniture_Case1_C_BPStartInteract) == 0x000010, "Wrong size on BP_Furniture_Case1_C_BPStartInteract");
static_assert(offsetof(BP_Furniture_Case1_C_BPStartInteract, ByPC) == 0x000000, "Member 'BP_Furniture_Case1_C_BPStartInteract::ByPC' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_BPStartInteract, InteractIndex) == 0x000008, "Member 'BP_Furniture_Case1_C_BPStartInteract::InteractIndex' has a wrong offset!");

// Function BP_Furniture_Case1.BP_Furniture_Case1_C.BPBreakInteract
// 0x0010 (0x0010 - 0x0000)
struct BP_Furniture_Case1_C_BPBreakInteract final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Furniture_Case1_C_BPBreakInteract) == 0x000008, "Wrong alignment on BP_Furniture_Case1_C_BPBreakInteract");
static_assert(sizeof(BP_Furniture_Case1_C_BPBreakInteract) == 0x000010, "Wrong size on BP_Furniture_Case1_C_BPBreakInteract");
static_assert(offsetof(BP_Furniture_Case1_C_BPBreakInteract, ByPC) == 0x000000, "Member 'BP_Furniture_Case1_C_BPBreakInteract::ByPC' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_BPBreakInteract, InteractIndex) == 0x000008, "Member 'BP_Furniture_Case1_C_BPBreakInteract::InteractIndex' has a wrong offset!");

// Function BP_Furniture_Case1.BP_Furniture_Case1_C.BPInteractFinished
// 0x0010 (0x0010 - 0x0000)
struct BP_Furniture_Case1_C_BPInteractFinished final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Furniture_Case1_C_BPInteractFinished) == 0x000008, "Wrong alignment on BP_Furniture_Case1_C_BPInteractFinished");
static_assert(sizeof(BP_Furniture_Case1_C_BPInteractFinished) == 0x000010, "Wrong size on BP_Furniture_Case1_C_BPInteractFinished");
static_assert(offsetof(BP_Furniture_Case1_C_BPInteractFinished, ByPC) == 0x000000, "Member 'BP_Furniture_Case1_C_BPInteractFinished::ByPC' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_BPInteractFinished, InteractIndex) == 0x000008, "Member 'BP_Furniture_Case1_C_BPInteractFinished::InteractIndex' has a wrong offset!");

// Function BP_Furniture_Case1.BP_Furniture_Case1_C.ExecuteUbergraph_BP_Furniture_Case1
// 0x00C8 (0x00C8 - 0x0000)
struct BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C23[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable;                                // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_1;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_1;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_2;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_2;                            // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_3;                              // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_3;                            // 0x0078(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class AHottaPlayerController*                 K2Node_Event_ByPC_2;                               // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex_2;                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C24[0x4];                                     // 0x0094(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerController*                 K2Node_Event_ByPC_1;                               // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex_1;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x00A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C25[0x4];                                     // 0x00AC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerController*                 K2Node_Event_ByPC;                                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1) == 0x000008, "Wrong alignment on BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1");
static_assert(sizeof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1) == 0x0000C8, "Wrong size on BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, EntryPoint) == 0x000000, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, ___struct_Variable) == 0x000008, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::___struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, ___delegate_Variable) == 0x000018, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, ___struct_Variable_1) == 0x000028, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, ___delegate_Variable_1) == 0x000038, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::___delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, ___struct_Variable_2) == 0x000048, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, ___delegate_Variable_2) == 0x000058, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::___delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, ___struct_Variable_3) == 0x000068, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, ___delegate_Variable_3) == 0x000078, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::___delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, K2Node_Event_ByPC_2) == 0x000088, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::K2Node_Event_ByPC_2' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, K2Node_Event_InteractIndex_2) == 0x000090, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::K2Node_Event_InteractIndex_2' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, K2Node_Event_ByPC_1) == 0x000098, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::K2Node_Event_ByPC_1' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, K2Node_Event_InteractIndex_1) == 0x0000A0, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::K2Node_Event_InteractIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, CallFunc_PostEvent_ReturnValue) == 0x0000A4, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, CallFunc_PostEvent_ReturnValue_1) == 0x0000A8, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, K2Node_Event_ByPC) == 0x0000B0, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::K2Node_Event_ByPC' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, K2Node_Event_InteractIndex) == 0x0000B8, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::K2Node_Event_InteractIndex' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, CallFunc_PostEvent_ReturnValue_2) == 0x0000BC, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1, CallFunc_PostEvent_ReturnValue_3) == 0x0000C0, "Member 'BP_Furniture_Case1_C_ExecuteUbergraph_BP_Furniture_Case1::CallFunc_PostEvent_ReturnValue_3' has a wrong offset!");

}

