#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FunctionLibrary

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_FunctionLibrary.BP_FunctionLibrary_C.IsMultiCrossServerClone
// 0x0018 (0x0018 - 0x0000)
struct BP_FunctionLibrary_C_IsMultiCrossServerClone final
{
public:
	class UObject*                                ObjContext;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          OutRet;                                            // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSingleCrossServerClone_Ret;             // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCrossServerClone_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FunctionLibrary_C_IsMultiCrossServerClone) == 0x000008, "Wrong alignment on BP_FunctionLibrary_C_IsMultiCrossServerClone");
static_assert(sizeof(BP_FunctionLibrary_C_IsMultiCrossServerClone) == 0x000018, "Wrong size on BP_FunctionLibrary_C_IsMultiCrossServerClone");
static_assert(offsetof(BP_FunctionLibrary_C_IsMultiCrossServerClone, ObjContext) == 0x000000, "Member 'BP_FunctionLibrary_C_IsMultiCrossServerClone::ObjContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsMultiCrossServerClone, __WorldContext) == 0x000008, "Member 'BP_FunctionLibrary_C_IsMultiCrossServerClone::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsMultiCrossServerClone, OutRet) == 0x000010, "Member 'BP_FunctionLibrary_C_IsMultiCrossServerClone::OutRet' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsMultiCrossServerClone, CallFunc_IsValid_ReturnValue) == 0x000011, "Member 'BP_FunctionLibrary_C_IsMultiCrossServerClone::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsMultiCrossServerClone, CallFunc_IsSingleCrossServerClone_Ret) == 0x000012, "Member 'BP_FunctionLibrary_C_IsMultiCrossServerClone::CallFunc_IsSingleCrossServerClone_Ret' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsMultiCrossServerClone, CallFunc_Not_PreBool_ReturnValue) == 0x000013, "Member 'BP_FunctionLibrary_C_IsMultiCrossServerClone::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsMultiCrossServerClone, CallFunc_IsCrossServerClone_ReturnValue) == 0x000014, "Member 'BP_FunctionLibrary_C_IsMultiCrossServerClone::CallFunc_IsCrossServerClone_ReturnValue' has a wrong offset!");

// Function BP_FunctionLibrary.BP_FunctionLibrary_C.IsSingleCrossServerClone
// 0x0018 (0x0018 - 0x0000)
struct BP_FunctionLibrary_C_IsSingleCrossServerClone final
{
public:
	class UObject*                                ObjContext;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Ret;                                               // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	ELevelSceneType                               CallFunc_GetSceneType_ReturnValue;                 // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0012(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0013(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FunctionLibrary_C_IsSingleCrossServerClone) == 0x000008, "Wrong alignment on BP_FunctionLibrary_C_IsSingleCrossServerClone");
static_assert(sizeof(BP_FunctionLibrary_C_IsSingleCrossServerClone) == 0x000018, "Wrong size on BP_FunctionLibrary_C_IsSingleCrossServerClone");
static_assert(offsetof(BP_FunctionLibrary_C_IsSingleCrossServerClone, ObjContext) == 0x000000, "Member 'BP_FunctionLibrary_C_IsSingleCrossServerClone::ObjContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsSingleCrossServerClone, __WorldContext) == 0x000008, "Member 'BP_FunctionLibrary_C_IsSingleCrossServerClone::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsSingleCrossServerClone, Ret) == 0x000010, "Member 'BP_FunctionLibrary_C_IsSingleCrossServerClone::Ret' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsSingleCrossServerClone, CallFunc_GetSceneType_ReturnValue) == 0x000011, "Member 'BP_FunctionLibrary_C_IsSingleCrossServerClone::CallFunc_GetSceneType_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsSingleCrossServerClone, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000012, "Member 'BP_FunctionLibrary_C_IsSingleCrossServerClone::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsSingleCrossServerClone, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000013, "Member 'BP_FunctionLibrary_C_IsSingleCrossServerClone::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsSingleCrossServerClone, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000014, "Member 'BP_FunctionLibrary_C_IsSingleCrossServerClone::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsSingleCrossServerClone, CallFunc_BooleanOR_ReturnValue) == 0x000015, "Member 'BP_FunctionLibrary_C_IsSingleCrossServerClone::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_IsSingleCrossServerClone, CallFunc_BooleanOR_ReturnValue_1) == 0x000016, "Member 'BP_FunctionLibrary_C_IsSingleCrossServerClone::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

// Function BP_FunctionLibrary.BP_FunctionLibrary_C.TrackPlayFunctions
// 0x0068 (0x0068 - 0x0000)
struct BP_FunctionLibrary_C_TrackPlayFunctions final
{
public:
	class FString                                 PlayFunction;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	TMap<class FString, class FString>            FunctionParams;                                    // 0x0010(0x0050)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                                __WorldContext;                                    // 0x0060(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FunctionLibrary_C_TrackPlayFunctions) == 0x000008, "Wrong alignment on BP_FunctionLibrary_C_TrackPlayFunctions");
static_assert(sizeof(BP_FunctionLibrary_C_TrackPlayFunctions) == 0x000068, "Wrong size on BP_FunctionLibrary_C_TrackPlayFunctions");
static_assert(offsetof(BP_FunctionLibrary_C_TrackPlayFunctions, PlayFunction) == 0x000000, "Member 'BP_FunctionLibrary_C_TrackPlayFunctions::PlayFunction' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_TrackPlayFunctions, FunctionParams) == 0x000010, "Member 'BP_FunctionLibrary_C_TrackPlayFunctions::FunctionParams' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_TrackPlayFunctions, __WorldContext) == 0x000060, "Member 'BP_FunctionLibrary_C_TrackPlayFunctions::__WorldContext' has a wrong offset!");

// Function BP_FunctionLibrary.BP_FunctionLibrary_C.GetPlayerCharacterInUI
// 0x0040 (0x0040 - 0x0000)
struct BP_FunctionLibrary_C_GetPlayerCharacterInUI final
{
public:
	class UUserWidget*                            UI;                                                // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                __WorldContext;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   PlayerCharacter;                                   // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_GetOwningPlayerPawn_ReturnValue;          // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLMountCharacter*                    K2Node_DynamicCast_AsQRSLMount_Character;          // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C4F[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FunctionLibrary_C_GetPlayerCharacterInUI) == 0x000008, "Wrong alignment on BP_FunctionLibrary_C_GetPlayerCharacterInUI");
static_assert(sizeof(BP_FunctionLibrary_C_GetPlayerCharacterInUI) == 0x000040, "Wrong size on BP_FunctionLibrary_C_GetPlayerCharacterInUI");
static_assert(offsetof(BP_FunctionLibrary_C_GetPlayerCharacterInUI, UI) == 0x000000, "Member 'BP_FunctionLibrary_C_GetPlayerCharacterInUI::UI' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_GetPlayerCharacterInUI, __WorldContext) == 0x000008, "Member 'BP_FunctionLibrary_C_GetPlayerCharacterInUI::__WorldContext' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_GetPlayerCharacterInUI, PlayerCharacter) == 0x000010, "Member 'BP_FunctionLibrary_C_GetPlayerCharacterInUI::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_GetPlayerCharacterInUI, CallFunc_GetOwningPlayerPawn_ReturnValue) == 0x000018, "Member 'BP_FunctionLibrary_C_GetPlayerCharacterInUI::CallFunc_GetOwningPlayerPawn_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_GetPlayerCharacterInUI, K2Node_DynamicCast_AsQRSLMount_Character) == 0x000020, "Member 'BP_FunctionLibrary_C_GetPlayerCharacterInUI::K2Node_DynamicCast_AsQRSLMount_Character' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_GetPlayerCharacterInUI, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'BP_FunctionLibrary_C_GetPlayerCharacterInUI::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_GetPlayerCharacterInUI, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000030, "Member 'BP_FunctionLibrary_C_GetPlayerCharacterInUI::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_GetPlayerCharacterInUI, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_FunctionLibrary_C_GetPlayerCharacterInUI::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FunctionLibrary_C_GetPlayerCharacterInUI, CallFunc_IsValid_ReturnValue) == 0x000039, "Member 'BP_FunctionLibrary_C_GetPlayerCharacterInUI::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

