#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FishActorBase

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_FishActorBase.BP_FishActorBase_C.BPSetJumpCamera
// 0x0001 (0x0001 - 0x0000)
struct BP_FishActorBase_C_BPSetJumpCamera final
{
public:
	bool                                          JumpCamera;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_FishActorBase_C_BPSetJumpCamera) == 0x000001, "Wrong alignment on BP_FishActorBase_C_BPSetJumpCamera");
static_assert(sizeof(BP_FishActorBase_C_BPSetJumpCamera) == 0x000001, "Wrong size on BP_FishActorBase_C_BPSetJumpCamera");
static_assert(offsetof(BP_FishActorBase_C_BPSetJumpCamera, JumpCamera) == 0x000000, "Member 'BP_FishActorBase_C_BPSetJumpCamera::JumpCamera' has a wrong offset!");

// Function BP_FishActorBase.BP_FishActorBase_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FishActorBase_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FishActorBase_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_FishActorBase_C_ReceiveTick");
static_assert(sizeof(BP_FishActorBase_C_ReceiveTick) == 0x000004, "Wrong size on BP_FishActorBase_C_ReceiveTick");
static_assert(offsetof(BP_FishActorBase_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_FishActorBase_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_FishActorBase.BP_FishActorBase_C.BPEventTick
// 0x0004 (0x0004 - 0x0000)
struct BP_FishActorBase_C_BPEventTick final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FishActorBase_C_BPEventTick) == 0x000004, "Wrong alignment on BP_FishActorBase_C_BPEventTick");
static_assert(sizeof(BP_FishActorBase_C_BPEventTick) == 0x000004, "Wrong size on BP_FishActorBase_C_BPEventTick");
static_assert(offsetof(BP_FishActorBase_C_BPEventTick, DeltaTime) == 0x000000, "Member 'BP_FishActorBase_C_BPEventTick::DeltaTime' has a wrong offset!");

// Function BP_FishActorBase.BP_FishActorBase_C.ExecuteUbergraph_BP_FishActorBase
// 0x0150 (0x0150 - 0x0000)
struct BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_JumpCamera;                           // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55FC[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55FD[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue;                  // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55FE[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_MakeRotator_ReturnValue_1;                // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult;    // 0x0038(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	struct FHitResult                             CallFunc_K2_SetRelativeRotation_SweepHitResult_1;  // 0x00C4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase) == 0x000004, "Wrong alignment on BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase");
static_assert(sizeof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase) == 0x000150, "Wrong size on BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, EntryPoint) == 0x000000, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, K2Node_Event_DeltaTime) == 0x000004, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, K2Node_Event_JumpCamera) == 0x000008, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::K2Node_Event_JumpCamera' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, K2Node_Event_DeltaSeconds) == 0x00000C, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, CallFunc_Not_PreBool_ReturnValue) == 0x000010, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, CallFunc_MakeRotator_ReturnValue) == 0x000014, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::CallFunc_MakeRotator_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, CallFunc_Add_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000024, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000029, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, CallFunc_MakeRotator_ReturnValue_1) == 0x00002C, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::CallFunc_MakeRotator_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, CallFunc_K2_SetRelativeRotation_SweepHitResult) == 0x000038, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::CallFunc_K2_SetRelativeRotation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase, CallFunc_K2_SetRelativeRotation_SweepHitResult_1) == 0x0000C4, "Member 'BP_FishActorBase_C_ExecuteUbergraph_BP_FishActorBase::CallFunc_K2_SetRelativeRotation_SweepHitResult_1' has a wrong offset!");

}

