#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_FollowerNest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_FollowerNest.BP_FollowerNest_C.ExecuteUbergraph_BP_FollowerNest
// 0x03B0 (0x03B0 - 0x0000)
struct BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_4;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NotifyName_3;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_2;            // 0x0040(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_2;                   // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_3;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName_1;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_4;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NotifyName;                     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NotifyName)>       K2Node_CreateDelegate_OutputDelegate_5;            // 0x0088(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable;                                // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x00B0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ___object_Variable;                                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           K2Node_DynamicCast_As_____;                        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57C7[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue;       // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57C8[0x7];                                     // 0x00E9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57C9[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57CA[0x3];                                     // 0x0109(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x010C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_VLerp_ReturnValue;                        // 0x0118(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57CB[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPlayMontageCallbackProxy*              CallFunc_CreateProxyObjectForPlayMontage_ReturnValue; // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0130(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57CC[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_VLerp_ReturnValue_1;                      // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult_1;     // 0x01CC(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_1;   // 0x0258(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue_1;     // 0x0260(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57CD[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_2;   // 0x0268(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0270(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0278(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57CE[0x7];                                     // 0x0279(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPOI                                   K2Node_MakeStruct_POI;                             // 0x0280(0x0060)()
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x02E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57CF[0x6];                                     // 0x02E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x02E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x02F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x02F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0304(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D0[0x3];                                     // 0x0305(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0308(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_57D1[0x4];                                     // 0x0394(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaVisualSpawnManager*               K2Node_ComponentBoundEvent_InstigateSpawner;       // 0x0398(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_NestFollower_C*                     K2Node_DynamicCast_AsBP_Nest_Follower;             // 0x03A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x03A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D2[0x3];                                     // 0x03A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x03AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest) == 0x000008, "Wrong alignment on BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest");
static_assert(sizeof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest) == 0x0003B0, "Wrong size on BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, EntryPoint) == 0x000000, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_Add_VectorVector_ReturnValue) == 0x000014, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CreateDelegate_OutputDelegate_1) == 0x000020, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CustomEvent_NotifyName_4) == 0x000030, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CustomEvent_NotifyName_4' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CustomEvent_NotifyName_3) == 0x000038, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CustomEvent_NotifyName_3' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CreateDelegate_OutputDelegate_2) == 0x000040, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CustomEvent_NotifyName_2) == 0x000050, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CustomEvent_NotifyName_2' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CreateDelegate_OutputDelegate_3) == 0x000058, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CustomEvent_NotifyName_1) == 0x000068, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CustomEvent_NotifyName_1' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CreateDelegate_OutputDelegate_4) == 0x000070, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CustomEvent_NotifyName) == 0x000080, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CustomEvent_NotifyName' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CreateDelegate_OutputDelegate_5) == 0x000088, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, ___name_Variable) == 0x000098, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::___name_Variable' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, ___struct_Variable) == 0x0000A0, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::___struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, ___delegate_Variable) == 0x0000B0, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_CustomEvent_Loaded) == 0x0000C0, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, ___object_Variable) == 0x0000C8, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::___object_Variable' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_DynamicCast_As_____) == 0x0000D0, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_DynamicCast_As_____' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_DynamicCast_bSuccess) == 0x0000D8, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x0000E0, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_IsYahaha2SubmittedByID_ReturnValue) == 0x0000E8, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_IsYahaha2SubmittedByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_Event_MainPlayer) == 0x0000F0, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_IsActivated_ReturnValue) == 0x0000F8, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_IsActivated_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000100, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_DynamicCast_bSuccess_1) == 0x000108, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00010C, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_VLerp_ReturnValue) == 0x000118, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_VLerp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_CreateProxyObjectForPlayMontage_ReturnValue) == 0x000128, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_CreateProxyObjectForPlayMontage_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000130, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_IsValid_ReturnValue) == 0x0001BC, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_VLerp_ReturnValue_1) == 0x0001C0, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_VLerp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_K2_SetWorldLocation_SweepHitResult_1) == 0x0001CC, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_K2_SetWorldLocation_SweepHitResult_1' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_GetClientPlayerCharacter_ReturnValue_1) == 0x000258, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_GetClientPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_IsYahaha2SubmittedByID_ReturnValue_1) == 0x000260, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_IsYahaha2SubmittedByID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_GetClientPlayerCharacter_ReturnValue_2) == 0x000268, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_GetClientPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000270, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_DynamicCast_bSuccess_2) == 0x000278, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_MakeStruct_POI) == 0x000280, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_MakeStruct_POI' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_SwitchNetMode_OutNetMode) == 0x0002E0, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_SwitchEnum_CmpSuccess) == 0x0002E1, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0002E8, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_ComponentBoundEvent_OtherActor) == 0x0002F0, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_ComponentBoundEvent_OtherComp) == 0x0002F8, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000300, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_ComponentBoundEvent_bFromSweep) == 0x000304, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_ComponentBoundEvent_SweepResult) == 0x000308, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_ComponentBoundEvent_InstigateSpawner) == 0x000398, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_ComponentBoundEvent_InstigateSpawner' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_DynamicCast_AsBP_Nest_Follower) == 0x0003A0, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_DynamicCast_AsBP_Nest_Follower' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, K2Node_DynamicCast_bSuccess_3) == 0x0003A8, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest, CallFunc_PostEvent_ReturnValue) == 0x0003AC, "Member 'BP_FollowerNest_C_ExecuteUbergraph_BP_FollowerNest::CallFunc_PostEvent_ReturnValue' has a wrong offset!");

// Function BP_FollowerNest.BP_FollowerNest_C.BndEvt__BP_FollowerNest_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_FollowerNest_C_BndEvt__BP_FollowerNest_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature final
{
public:
	class AHottaVisualSpawnManager*               InstigateSpawner;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_FollowerNest_C_BndEvt__BP_FollowerNest_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(sizeof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong size on BP_FollowerNest_C_BndEvt__BP_FollowerNest_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(offsetof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature, InstigateSpawner) == 0x000000, "Member 'BP_FollowerNest_C_BndEvt__BP_FollowerNest_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature::InstigateSpawner' has a wrong offset!");

// Function BP_FollowerNest.BP_FollowerNest_C.BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D3[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_FollowerNest_C_BndEvt__BP_FollowerNest_Sphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_FollowerNest.BP_FollowerNest_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_FollowerNest_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowerNest_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on BP_FollowerNest_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(BP_FollowerNest_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on BP_FollowerNest_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(BP_FollowerNest_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'BP_FollowerNest_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

// Function BP_FollowerNest.BP_FollowerNest_C.OnLoaded_CC823168455642E654DAD1A95DE87E45
// 0x0008 (0x0008 - 0x0000)
struct BP_FollowerNest_C_OnLoaded_CC823168455642E654DAD1A95DE87E45 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowerNest_C_OnLoaded_CC823168455642E654DAD1A95DE87E45) == 0x000008, "Wrong alignment on BP_FollowerNest_C_OnLoaded_CC823168455642E654DAD1A95DE87E45");
static_assert(sizeof(BP_FollowerNest_C_OnLoaded_CC823168455642E654DAD1A95DE87E45) == 0x000008, "Wrong size on BP_FollowerNest_C_OnLoaded_CC823168455642E654DAD1A95DE87E45");
static_assert(offsetof(BP_FollowerNest_C_OnLoaded_CC823168455642E654DAD1A95DE87E45, Loaded) == 0x000000, "Member 'BP_FollowerNest_C_OnLoaded_CC823168455642E654DAD1A95DE87E45::Loaded' has a wrong offset!");

// Function BP_FollowerNest.BP_FollowerNest_C.OnCompleted_12BA23F342F51FC313F9E981BD719227
// 0x0008 (0x0008 - 0x0000)
struct BP_FollowerNest_C_OnCompleted_12BA23F342F51FC313F9E981BD719227 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowerNest_C_OnCompleted_12BA23F342F51FC313F9E981BD719227) == 0x000004, "Wrong alignment on BP_FollowerNest_C_OnCompleted_12BA23F342F51FC313F9E981BD719227");
static_assert(sizeof(BP_FollowerNest_C_OnCompleted_12BA23F342F51FC313F9E981BD719227) == 0x000008, "Wrong size on BP_FollowerNest_C_OnCompleted_12BA23F342F51FC313F9E981BD719227");
static_assert(offsetof(BP_FollowerNest_C_OnCompleted_12BA23F342F51FC313F9E981BD719227, NotifyName) == 0x000000, "Member 'BP_FollowerNest_C_OnCompleted_12BA23F342F51FC313F9E981BD719227::NotifyName' has a wrong offset!");

// Function BP_FollowerNest.BP_FollowerNest_C.OnBlendOut_12BA23F342F51FC313F9E981BD719227
// 0x0008 (0x0008 - 0x0000)
struct BP_FollowerNest_C_OnBlendOut_12BA23F342F51FC313F9E981BD719227 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowerNest_C_OnBlendOut_12BA23F342F51FC313F9E981BD719227) == 0x000004, "Wrong alignment on BP_FollowerNest_C_OnBlendOut_12BA23F342F51FC313F9E981BD719227");
static_assert(sizeof(BP_FollowerNest_C_OnBlendOut_12BA23F342F51FC313F9E981BD719227) == 0x000008, "Wrong size on BP_FollowerNest_C_OnBlendOut_12BA23F342F51FC313F9E981BD719227");
static_assert(offsetof(BP_FollowerNest_C_OnBlendOut_12BA23F342F51FC313F9E981BD719227, NotifyName) == 0x000000, "Member 'BP_FollowerNest_C_OnBlendOut_12BA23F342F51FC313F9E981BD719227::NotifyName' has a wrong offset!");

// Function BP_FollowerNest.BP_FollowerNest_C.OnInterrupted_12BA23F342F51FC313F9E981BD719227
// 0x0008 (0x0008 - 0x0000)
struct BP_FollowerNest_C_OnInterrupted_12BA23F342F51FC313F9E981BD719227 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowerNest_C_OnInterrupted_12BA23F342F51FC313F9E981BD719227) == 0x000004, "Wrong alignment on BP_FollowerNest_C_OnInterrupted_12BA23F342F51FC313F9E981BD719227");
static_assert(sizeof(BP_FollowerNest_C_OnInterrupted_12BA23F342F51FC313F9E981BD719227) == 0x000008, "Wrong size on BP_FollowerNest_C_OnInterrupted_12BA23F342F51FC313F9E981BD719227");
static_assert(offsetof(BP_FollowerNest_C_OnInterrupted_12BA23F342F51FC313F9E981BD719227, NotifyName) == 0x000000, "Member 'BP_FollowerNest_C_OnInterrupted_12BA23F342F51FC313F9E981BD719227::NotifyName' has a wrong offset!");

// Function BP_FollowerNest.BP_FollowerNest_C.OnNotifyBegin_12BA23F342F51FC313F9E981BD719227
// 0x0008 (0x0008 - 0x0000)
struct BP_FollowerNest_C_OnNotifyBegin_12BA23F342F51FC313F9E981BD719227 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowerNest_C_OnNotifyBegin_12BA23F342F51FC313F9E981BD719227) == 0x000004, "Wrong alignment on BP_FollowerNest_C_OnNotifyBegin_12BA23F342F51FC313F9E981BD719227");
static_assert(sizeof(BP_FollowerNest_C_OnNotifyBegin_12BA23F342F51FC313F9E981BD719227) == 0x000008, "Wrong size on BP_FollowerNest_C_OnNotifyBegin_12BA23F342F51FC313F9E981BD719227");
static_assert(offsetof(BP_FollowerNest_C_OnNotifyBegin_12BA23F342F51FC313F9E981BD719227, NotifyName) == 0x000000, "Member 'BP_FollowerNest_C_OnNotifyBegin_12BA23F342F51FC313F9E981BD719227::NotifyName' has a wrong offset!");

// Function BP_FollowerNest.BP_FollowerNest_C.OnNotifyEnd_12BA23F342F51FC313F9E981BD719227
// 0x0008 (0x0008 - 0x0000)
struct BP_FollowerNest_C_OnNotifyEnd_12BA23F342F51FC313F9E981BD719227 final
{
public:
	class FName                                   NotifyName;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_FollowerNest_C_OnNotifyEnd_12BA23F342F51FC313F9E981BD719227) == 0x000004, "Wrong alignment on BP_FollowerNest_C_OnNotifyEnd_12BA23F342F51FC313F9E981BD719227");
static_assert(sizeof(BP_FollowerNest_C_OnNotifyEnd_12BA23F342F51FC313F9E981BD719227) == 0x000008, "Wrong size on BP_FollowerNest_C_OnNotifyEnd_12BA23F342F51FC313F9E981BD719227");
static_assert(offsetof(BP_FollowerNest_C_OnNotifyEnd_12BA23F342F51FC313F9E981BD719227, NotifyName) == 0x000000, "Member 'BP_FollowerNest_C_OnNotifyEnd_12BA23F342F51FC313F9E981BD719227::NotifyName' has a wrong offset!");

}

