#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GunBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GunBase.BP_GunBase_C
// 0x0020 (0x14C0 - 0x14A0)
class ABP_GunBase_C : public AGunBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x14A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_NewTrack_0_854161DA4F8B3DD9B3D1EDA81409B818; // 0x14A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_854161DA4F8B3DD9B3D1EDA81409B818; // 0x14AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5195[0x3];                                     // 0x14AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x14B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x14B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_GunBase(int32 EntryPoint);
	void K2_TriggerHiddenEffect(bool bOnHand);
	void K2_TriggerDissolveShowEffect(bool bStarted);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();
	void CreatPointLight(const struct FLinearColor& Color, float ColorIntensity);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GunBase_C">();
	}
	static class ABP_GunBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GunBase_C>();
	}
};
static_assert(alignof(ABP_GunBase_C) == 0x000010, "Wrong alignment on ABP_GunBase_C");
static_assert(sizeof(ABP_GunBase_C) == 0x0014C0, "Wrong size on ABP_GunBase_C");
static_assert(offsetof(ABP_GunBase_C, UberGraphFrame) == 0x0014A0, "Member 'ABP_GunBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GunBase_C, Timeline_0_NewTrack_0_854161DA4F8B3DD9B3D1EDA81409B818) == 0x0014A8, "Member 'ABP_GunBase_C::Timeline_0_NewTrack_0_854161DA4F8B3DD9B3D1EDA81409B818' has a wrong offset!");
static_assert(offsetof(ABP_GunBase_C, Timeline_0__Direction_854161DA4F8B3DD9B3D1EDA81409B818) == 0x0014AC, "Member 'ABP_GunBase_C::Timeline_0__Direction_854161DA4F8B3DD9B3D1EDA81409B818' has a wrong offset!");
static_assert(offsetof(ABP_GunBase_C, Timeline_0) == 0x0014B0, "Member 'ABP_GunBase_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_GunBase_C, PointLight) == 0x0014B8, "Member 'ABP_GunBase_C::PointLight' has a wrong offset!");

}

