#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GameStateBase

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_GameStateBase.BP_GameStateBase_C.ExecuteUbergraph_BP_GameStateBase
// 0x0050 (0x0050 - 0x0000)
struct BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C20[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FName>                           K2Node_MakeArray_Array;                            // 0x0008(0x0010)(ReferenceParm)
	int32                                         ___int_Array_Index_Variable;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C21[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AHottaFishFlockVolume*>          CallFunc_GetAllActorsOfClass_OutActors;            // 0x0028(0x0010)(ReferenceParm)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C22[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaFishFlockVolume*                  CallFunc_Array_Get_Item;                           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase) == 0x000008, "Wrong alignment on BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase");
static_assert(sizeof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase) == 0x000050, "Wrong size on BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase");
static_assert(offsetof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase, EntryPoint) == 0x000000, "Member 'BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase, K2Node_MakeArray_Array) == 0x000008, "Member 'BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase, ___int_Array_Index_Variable) == 0x000018, "Member 'BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase, ___int_Loop_Counter_Variable) == 0x00001C, "Member 'BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase, CallFunc_Add_IntInt_ReturnValue) == 0x000020, "Member 'BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase, CallFunc_GetAllActorsOfClass_OutActors) == 0x000028, "Member 'BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase, CallFunc_Array_Length_ReturnValue) == 0x000038, "Member 'BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase, CallFunc_Array_Get_Item) == 0x000040, "Member 'BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase, CallFunc_Less_IntInt_ReturnValue) == 0x000048, "Member 'BP_GameStateBase_C_ExecuteUbergraph_BP_GameStateBase::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");

}

