#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_GhostTrail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_GhostTrail.BP_GhostTrail_C
// 0x0038 (0x0288 - 0x0250)
class ABP_GhostTrail_C final : public AGhostTrailActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPoseableMeshComponent*                 ClothMesh;                                         // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPoseableMeshComponent*                 CharacterMesh;                                     // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Opcity_08A7884842D6390EB3EAED9871CA49E1; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_08A7884842D6390EB3EAED9871CA49E1; // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C50[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Opcity_FADE608A481D84DD00BB1AB99F61C20E; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_FADE608A481D84DD00BB1AB99F61C20E; // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C51[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void ReceiveBeginPlay();
	void DoCopyPose();
	void ExecuteUbergraph_BP_GhostTrail(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_GhostTrail_C">();
	}
	static class ABP_GhostTrail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_GhostTrail_C>();
	}
};
static_assert(alignof(ABP_GhostTrail_C) == 0x000008, "Wrong alignment on ABP_GhostTrail_C");
static_assert(sizeof(ABP_GhostTrail_C) == 0x000288, "Wrong size on ABP_GhostTrail_C");
static_assert(offsetof(ABP_GhostTrail_C, UberGraphFrame) == 0x000250, "Member 'ABP_GhostTrail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_GhostTrail_C, ClothMesh) == 0x000258, "Member 'ABP_GhostTrail_C::ClothMesh' has a wrong offset!");
static_assert(offsetof(ABP_GhostTrail_C, CharacterMesh) == 0x000260, "Member 'ABP_GhostTrail_C::CharacterMesh' has a wrong offset!");
static_assert(offsetof(ABP_GhostTrail_C, Timeline_1_Opcity_08A7884842D6390EB3EAED9871CA49E1) == 0x000268, "Member 'ABP_GhostTrail_C::Timeline_1_Opcity_08A7884842D6390EB3EAED9871CA49E1' has a wrong offset!");
static_assert(offsetof(ABP_GhostTrail_C, Timeline_1__Direction_08A7884842D6390EB3EAED9871CA49E1) == 0x00026C, "Member 'ABP_GhostTrail_C::Timeline_1__Direction_08A7884842D6390EB3EAED9871CA49E1' has a wrong offset!");
static_assert(offsetof(ABP_GhostTrail_C, Timeline_1) == 0x000270, "Member 'ABP_GhostTrail_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_GhostTrail_C, Timeline_0_Opcity_FADE608A481D84DD00BB1AB99F61C20E) == 0x000278, "Member 'ABP_GhostTrail_C::Timeline_0_Opcity_FADE608A481D84DD00BB1AB99F61C20E' has a wrong offset!");
static_assert(offsetof(ABP_GhostTrail_C, Timeline_0__Direction_FADE608A481D84DD00BB1AB99F61C20E) == 0x00027C, "Member 'ABP_GhostTrail_C::Timeline_0__Direction_FADE608A481D84DD00BB1AB99F61C20E' has a wrong offset!");
static_assert(offsetof(ABP_GhostTrail_C, Timeline_0) == 0x000280, "Member 'ABP_GhostTrail_C::Timeline_0' has a wrong offset!");

}

