#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HairGhostTrail

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HairGhostTrail.BP_HairGhostTrail_C
// 0x0030 (0x0280 - 0x0250)
class ABP_HairGhostTrail_C final : public AGhostTrailActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0250(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UPoseableMeshComponent*                 PoseableMesh;                                      // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_Opcity_2AF6ABB74DB8769E22682D8AD2BBDDE4; // 0x0260(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_2AF6ABB74DB8769E22682D8AD2BBDDE4; // 0x0264(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C54[0x3];                                     // 0x0265(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Opcity_7D1715C449F4632AAEC71482AA8B22A2; // 0x0270(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_7D1715C449F4632AAEC71482AA8B22A2; // 0x0274(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C55[0x3];                                     // 0x0275(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void DoCopyPose();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_HairGhostTrail(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HairGhostTrail_C">();
	}
	static class ABP_HairGhostTrail_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HairGhostTrail_C>();
	}
};
static_assert(alignof(ABP_HairGhostTrail_C) == 0x000008, "Wrong alignment on ABP_HairGhostTrail_C");
static_assert(sizeof(ABP_HairGhostTrail_C) == 0x000280, "Wrong size on ABP_HairGhostTrail_C");
static_assert(offsetof(ABP_HairGhostTrail_C, UberGraphFrame) == 0x000250, "Member 'ABP_HairGhostTrail_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HairGhostTrail_C, PoseableMesh) == 0x000258, "Member 'ABP_HairGhostTrail_C::PoseableMesh' has a wrong offset!");
static_assert(offsetof(ABP_HairGhostTrail_C, Timeline_1_Opcity_2AF6ABB74DB8769E22682D8AD2BBDDE4) == 0x000260, "Member 'ABP_HairGhostTrail_C::Timeline_1_Opcity_2AF6ABB74DB8769E22682D8AD2BBDDE4' has a wrong offset!");
static_assert(offsetof(ABP_HairGhostTrail_C, Timeline_1__Direction_2AF6ABB74DB8769E22682D8AD2BBDDE4) == 0x000264, "Member 'ABP_HairGhostTrail_C::Timeline_1__Direction_2AF6ABB74DB8769E22682D8AD2BBDDE4' has a wrong offset!");
static_assert(offsetof(ABP_HairGhostTrail_C, Timeline_1) == 0x000268, "Member 'ABP_HairGhostTrail_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_HairGhostTrail_C, Timeline_0_Opcity_7D1715C449F4632AAEC71482AA8B22A2) == 0x000270, "Member 'ABP_HairGhostTrail_C::Timeline_0_Opcity_7D1715C449F4632AAEC71482AA8B22A2' has a wrong offset!");
static_assert(offsetof(ABP_HairGhostTrail_C, Timeline_0__Direction_7D1715C449F4632AAEC71482AA8B22A2) == 0x000274, "Member 'ABP_HairGhostTrail_C::Timeline_0__Direction_7D1715C449F4632AAEC71482AA8B22A2' has a wrong offset!");
static_assert(offsetof(ABP_HairGhostTrail_C, Timeline_0) == 0x000278, "Member 'ABP_HairGhostTrail_C::Timeline_0' has a wrong offset!");

}

