#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HairGhostTrail

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HairGhostTrail.BP_HairGhostTrail_C.ExecuteUbergraph_BP_HairGhostTrail
// 0x0038 (0x0038 - 0x0000)
struct BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C56[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C57[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character_1;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_HasMatchingGameplayTag_ReturnValue;    // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail) == 0x000008, "Wrong alignment on BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail");
static_assert(sizeof(BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail) == 0x000038, "Wrong size on BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail");
static_assert(offsetof(BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail, EntryPoint) == 0x000000, "Member 'BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000008, "Member 'BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000010, "Member 'BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000020, "Member 'BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail, K2Node_DynamicCast_AsHotta_Player_Character_1) == 0x000028, "Member 'BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail::K2Node_DynamicCast_AsHotta_Player_Character_1' has a wrong offset!");
static_assert(offsetof(BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail, K2Node_DynamicCast_bSuccess_1) == 0x000030, "Member 'BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail, CallFunc_K2_HasMatchingGameplayTag_ReturnValue) == 0x000031, "Member 'BP_HairGhostTrail_C_ExecuteUbergraph_BP_HairGhostTrail::CallFunc_K2_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");

}

