#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HottapWeatherEffctActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HottapWeatherEffctActor.BP_HottapWeatherEffctActor_C
// 0x0048 (0x02B0 - 0x0268)
class ABP_HottapWeatherEffctActor_C final : public AWeatherEffectActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_Sand_SandFog_213EB0AE4DC1B2FE2072A3BA8F0352B5; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_Sand__Direction_213EB0AE4DC1B2FE2072A3BA8F0352B5; // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D9[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_Sand;                                     // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_1_WindDensity_3A9B166D457CA07BB976A5A806D201E3; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_1__Direction_3A9B166D457CA07BB976A5A806D201E3; // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DA[0x3];                                     // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_1;                                        // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_RainDensity_B40F46F547057304149FB197E6BB6B61; // 0x0298(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_B40F46F547057304149FB197E6BB6B61; // 0x029C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DB[0x3];                                     // 0x029D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02A0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RainDensity;                                       // 0x02A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeatherState                                 CurrentWeather;                                    // 0x02AC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_1__FinishedFunc();
	void Timeline_1__UpdateFunc();
	void Timeline_Sand__FinishedFunc();
	void Timeline_Sand__UpdateFunc();
	void ReceiveBeginPlay();
	void UpdateWeather(EWeatherState NewWeatherState);
	void CustomEvent_ChangePosetEffect();
	void ExecuteUbergraph_BP_HottapWeatherEffctActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HottapWeatherEffctActor_C">();
	}
	static class ABP_HottapWeatherEffctActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HottapWeatherEffctActor_C>();
	}
};
static_assert(alignof(ABP_HottapWeatherEffctActor_C) == 0x000008, "Wrong alignment on ABP_HottapWeatherEffctActor_C");
static_assert(sizeof(ABP_HottapWeatherEffctActor_C) == 0x0002B0, "Wrong size on ABP_HottapWeatherEffctActor_C");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, UberGraphFrame) == 0x000268, "Member 'ABP_HottapWeatherEffctActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, DefaultSceneRoot) == 0x000270, "Member 'ABP_HottapWeatherEffctActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, Timeline_Sand_SandFog_213EB0AE4DC1B2FE2072A3BA8F0352B5) == 0x000278, "Member 'ABP_HottapWeatherEffctActor_C::Timeline_Sand_SandFog_213EB0AE4DC1B2FE2072A3BA8F0352B5' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, Timeline_Sand__Direction_213EB0AE4DC1B2FE2072A3BA8F0352B5) == 0x00027C, "Member 'ABP_HottapWeatherEffctActor_C::Timeline_Sand__Direction_213EB0AE4DC1B2FE2072A3BA8F0352B5' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, Timeline_Sand) == 0x000280, "Member 'ABP_HottapWeatherEffctActor_C::Timeline_Sand' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, Timeline_1_WindDensity_3A9B166D457CA07BB976A5A806D201E3) == 0x000288, "Member 'ABP_HottapWeatherEffctActor_C::Timeline_1_WindDensity_3A9B166D457CA07BB976A5A806D201E3' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, Timeline_1__Direction_3A9B166D457CA07BB976A5A806D201E3) == 0x00028C, "Member 'ABP_HottapWeatherEffctActor_C::Timeline_1__Direction_3A9B166D457CA07BB976A5A806D201E3' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, Timeline_1) == 0x000290, "Member 'ABP_HottapWeatherEffctActor_C::Timeline_1' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, Timeline_0_RainDensity_B40F46F547057304149FB197E6BB6B61) == 0x000298, "Member 'ABP_HottapWeatherEffctActor_C::Timeline_0_RainDensity_B40F46F547057304149FB197E6BB6B61' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, Timeline_0__Direction_B40F46F547057304149FB197E6BB6B61) == 0x00029C, "Member 'ABP_HottapWeatherEffctActor_C::Timeline_0__Direction_B40F46F547057304149FB197E6BB6B61' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, Timeline_0) == 0x0002A0, "Member 'ABP_HottapWeatherEffctActor_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, RainDensity) == 0x0002A8, "Member 'ABP_HottapWeatherEffctActor_C::RainDensity' has a wrong offset!");
static_assert(offsetof(ABP_HottapWeatherEffctActor_C, CurrentWeather) == 0x0002AC, "Member 'ABP_HottapWeatherEffctActor_C::CurrentWeather' has a wrong offset!");

}

