#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HairShadow_Actor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_HairShadow_Actor.BP_HairShadow_Actor_C.TrickNpc
// 0x0004 (0x0004 - 0x0000)
struct BP_HairShadow_Actor_C_TrickNpc final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HairShadow_Actor_C_TrickNpc) == 0x000004, "Wrong alignment on BP_HairShadow_Actor_C_TrickNpc");
static_assert(sizeof(BP_HairShadow_Actor_C_TrickNpc) == 0x000004, "Wrong size on BP_HairShadow_Actor_C_TrickNpc");
static_assert(offsetof(BP_HairShadow_Actor_C_TrickNpc, DeltaTime) == 0x000000, "Member 'BP_HairShadow_Actor_C_TrickNpc::DeltaTime' has a wrong offset!");

// Function BP_HairShadow_Actor.BP_HairShadow_Actor_C.ExecuteUbergraph_BP_HairShadow_Actor
// 0x0068 (0x0068 - 0x0000)
struct BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTime;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C1[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_GetHairShaodwNpc_ReturnValue;             // 0x0018(0x0010)(ReferenceParm)
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C2[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaSequencerCharacterActor*          K2Node_DynamicCast_AsHotta_Sequencer_Character_Actor; // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56C3[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_SequenceDialogueNpcBase_C*          K2Node_DynamicCast_AsBP_Sequence_Dialogue_Npc_Base; // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56C4[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_DialogueNpcBase_C*                  K2Node_DynamicCast_AsBP_Dialogue_Npc_Base;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor) == 0x000008, "Wrong alignment on BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor");
static_assert(sizeof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor) == 0x000068, "Wrong size on BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, EntryPoint) == 0x000000, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, ___int_Array_Index_Variable) == 0x000004, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, ___int_Loop_Counter_Variable) == 0x000008, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, CallFunc_Add_IntInt_ReturnValue) == 0x00000C, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, K2Node_Event_DeltaTime) == 0x000010, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::K2Node_Event_DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, CallFunc_GetHairShaodwNpc_ReturnValue) == 0x000018, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::CallFunc_GetHairShaodwNpc_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, CallFunc_Array_Get_Item) == 0x000028, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, K2Node_DynamicCast_AsHotta_Sequencer_Character_Actor) == 0x000038, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::K2Node_DynamicCast_AsHotta_Sequencer_Character_Actor' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, CallFunc_Less_IntInt_ReturnValue) == 0x000041, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, K2Node_DynamicCast_AsBP_Sequence_Dialogue_Npc_Base) == 0x000048, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::K2Node_DynamicCast_AsBP_Sequence_Dialogue_Npc_Base' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, K2Node_DynamicCast_AsBP_Dialogue_Npc_Base) == 0x000058, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::K2Node_DynamicCast_AsBP_Dialogue_Npc_Base' has a wrong offset!");
static_assert(offsetof(BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'BP_HairShadow_Actor_C_ExecuteUbergraph_BP_HairShadow_Actor::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

