#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Harvest_Gem_Cactus_A1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Harvest_Gem_Cactus_A1.BP_Harvest_Gem_Cactus_A1_C.ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1
// 0x0028 (0x0028 - 0x0000)
struct BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1) == 0x000008, "Wrong alignment on BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1");
static_assert(sizeof(BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1) == 0x000028, "Wrong size on BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1");
static_assert(offsetof(BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1, EntryPoint) == 0x000000, "Member 'BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000010, "Member 'BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000018, "Member 'BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1, CallFunc_PostEventAtLocation_ReturnValue) == 0x000024, "Member 'BP_Harvest_Gem_Cactus_A1_C_ExecuteUbergraph_BP_Harvest_Gem_Cactus_A1::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

}

