#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Harvest_Gem_002_water_Vera

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_Harvest_Gem_002_water_Vera.BP_Harvest_Gem_002_water_Vera_C.ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera
// 0x00A8 (0x00A8 - 0x0000)
struct BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue;       // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPOI                                   K2Node_MakeStruct_POI;                             // 0x0020(0x0060)()
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1E[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocation_ReturnValue_1;     // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera) == 0x000008, "Wrong alignment on BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera");
static_assert(sizeof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera) == 0x0000A8, "Wrong size on BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera");
static_assert(offsetof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera, EntryPoint) == 0x000000, "Member 'BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera, CallFunc_SpawnEmitterAtLocation_ReturnValue) == 0x000010, "Member 'BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera::CallFunc_SpawnEmitterAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000018, "Member 'BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera, K2Node_MakeStruct_POI) == 0x000020, "Member 'BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera::K2Node_MakeStruct_POI' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000080, "Member 'BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x00008C, "Member 'BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera, CallFunc_SpawnEmitterAtLocation_ReturnValue_1) == 0x000098, "Member 'BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera::CallFunc_SpawnEmitterAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera, CallFunc_PostEventAtLocation_ReturnValue) == 0x0000A0, "Member 'BP_Harvest_Gem_002_water_Vera_C_ExecuteUbergraph_BP_Harvest_Gem_002_water_Vera::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

}

