#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HVSpawnManager_WaterGem_Vera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HVSpawnManager_WaterGem_Vera.BP_HVSpawnManager_WaterGem_Vera_C
// 0x0018 (0x03B8 - 0x03A0)
class ABP_HVSpawnManager_WaterGem_Vera_C final : public AHottaVisualSpawnManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   PickYahahaGameID;                                  // 0x03A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OpenHour;                                          // 0x03B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera(int32 EntryPoint);
	void BPOnMainRoleLoadFinished(class AHottaPlayerCharacter* MainPlayer);
	void ReceiveBeginPlay();
	void CustomEvent_0(class AHottaVisualSpawnManager* InstigateSpawner);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HVSpawnManager_WaterGem_Vera_C">();
	}
	static class ABP_HVSpawnManager_WaterGem_Vera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HVSpawnManager_WaterGem_Vera_C>();
	}
};
static_assert(alignof(ABP_HVSpawnManager_WaterGem_Vera_C) == 0x000008, "Wrong alignment on ABP_HVSpawnManager_WaterGem_Vera_C");
static_assert(sizeof(ABP_HVSpawnManager_WaterGem_Vera_C) == 0x0003B8, "Wrong size on ABP_HVSpawnManager_WaterGem_Vera_C");
static_assert(offsetof(ABP_HVSpawnManager_WaterGem_Vera_C, UberGraphFrame) == 0x0003A0, "Member 'ABP_HVSpawnManager_WaterGem_Vera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HVSpawnManager_WaterGem_Vera_C, PickYahahaGameID) == 0x0003A8, "Member 'ABP_HVSpawnManager_WaterGem_Vera_C::PickYahahaGameID' has a wrong offset!");
static_assert(offsetof(ABP_HVSpawnManager_WaterGem_Vera_C, OpenHour) == 0x0003B0, "Member 'ABP_HVSpawnManager_WaterGem_Vera_C::OpenHour' has a wrong offset!");

}

