#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HarvestBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_HarvestBase.BP_HarvestBase_C
// 0x0020 (0x0980 - 0x0960)
class ABP_HarvestBase_C : public AHarvestActor
{
public:
	uint8                                         Pad_559B[0x8];                                     // 0x0958(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0960(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         PhysicsTime;                                       // 0x0968(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleX;                                            // 0x096C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleY;                                            // 0x0970(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ScaleZ;                                            // 0x0974(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             BrokenSound;                                       // 0x0978(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_HarvestBase(int32 EntryPoint);
	void BndEvt__SphereComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_HarvestBase_C">();
	}
	static class ABP_HarvestBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_HarvestBase_C>();
	}
};
static_assert(alignof(ABP_HarvestBase_C) == 0x000010, "Wrong alignment on ABP_HarvestBase_C");
static_assert(sizeof(ABP_HarvestBase_C) == 0x000980, "Wrong size on ABP_HarvestBase_C");
static_assert(offsetof(ABP_HarvestBase_C, UberGraphFrame) == 0x000960, "Member 'ABP_HarvestBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_HarvestBase_C, PhysicsTime) == 0x000968, "Member 'ABP_HarvestBase_C::PhysicsTime' has a wrong offset!");
static_assert(offsetof(ABP_HarvestBase_C, ScaleX) == 0x00096C, "Member 'ABP_HarvestBase_C::ScaleX' has a wrong offset!");
static_assert(offsetof(ABP_HarvestBase_C, ScaleY) == 0x000970, "Member 'ABP_HarvestBase_C::ScaleY' has a wrong offset!");
static_assert(offsetof(ABP_HarvestBase_C, ScaleZ) == 0x000974, "Member 'ABP_HarvestBase_C::ScaleZ' has a wrong offset!");
static_assert(offsetof(ABP_HarvestBase_C, BrokenSound) == 0x000978, "Member 'ABP_HarvestBase_C::BrokenSound' has a wrong offset!");

}

