#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HottaSkySphere

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_HottaSkySphere.BP_HottaSkySphere_C.lightControlUpdate
// 0x0003 (0x0003 - 0x0000)
struct BP_HottaSkySphere_C_LightControlUpdate final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUnderWater_ReturnValue;                 // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HottaSkySphere_C_LightControlUpdate) == 0x000001, "Wrong alignment on BP_HottaSkySphere_C_LightControlUpdate");
static_assert(sizeof(BP_HottaSkySphere_C_LightControlUpdate) == 0x000003, "Wrong size on BP_HottaSkySphere_C_LightControlUpdate");
static_assert(offsetof(BP_HottaSkySphere_C_LightControlUpdate, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'BP_HottaSkySphere_C_LightControlUpdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_LightControlUpdate, CallFunc_IsValid_ReturnValue_1) == 0x000001, "Member 'BP_HottaSkySphere_C_LightControlUpdate::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_LightControlUpdate, CallFunc_IsUnderWater_ReturnValue) == 0x000002, "Member 'BP_HottaSkySphere_C_LightControlUpdate::CallFunc_IsUnderWater_ReturnValue' has a wrong offset!");

// Function BP_HottaSkySphere.BP_HottaSkySphere_C.InitlightInfo
// 0x0030 (0x0030 - 0x0000)
struct BP_HottaSkySphere_C_InitlightInfo final
{
public:
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue;      // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                 CallFunc_Conv_LinearColorToColor_ReturnValue_1;    // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5961[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue;                // 0x000C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetLightColor_ReturnValue_1;              // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HottaSkySphere_C_InitlightInfo) == 0x000004, "Wrong alignment on BP_HottaSkySphere_C_InitlightInfo");
static_assert(sizeof(BP_HottaSkySphere_C_InitlightInfo) == 0x000030, "Wrong size on BP_HottaSkySphere_C_InitlightInfo");
static_assert(offsetof(BP_HottaSkySphere_C_InitlightInfo, CallFunc_Conv_LinearColorToColor_ReturnValue) == 0x000000, "Member 'BP_HottaSkySphere_C_InitlightInfo::CallFunc_Conv_LinearColorToColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_InitlightInfo, CallFunc_Conv_LinearColorToColor_ReturnValue_1) == 0x000004, "Member 'BP_HottaSkySphere_C_InitlightInfo::CallFunc_Conv_LinearColorToColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_InitlightInfo, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_HottaSkySphere_C_InitlightInfo::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_InitlightInfo, CallFunc_GetLightColor_ReturnValue) == 0x00000C, "Member 'BP_HottaSkySphere_C_InitlightInfo::CallFunc_GetLightColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_InitlightInfo, CallFunc_GetLightColor_ReturnValue_1) == 0x00001C, "Member 'BP_HottaSkySphere_C_InitlightInfo::CallFunc_GetLightColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_InitlightInfo, CallFunc_IsValid_ReturnValue_1) == 0x00002C, "Member 'BP_HottaSkySphere_C_InitlightInfo::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

// Function BP_HottaSkySphere.BP_HottaSkySphere_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_HottaSkySphere_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HottaSkySphere_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_HottaSkySphere_C_ReceiveTick");
static_assert(sizeof(BP_HottaSkySphere_C_ReceiveTick) == 0x000004, "Wrong size on BP_HottaSkySphere_C_ReceiveTick");
static_assert(offsetof(BP_HottaSkySphere_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_HottaSkySphere_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_HottaSkySphere.BP_HottaSkySphere_C.ExecuteUbergraph_BP_HottaSkySphere
// 0x0080 (0x0080 - 0x0000)
struct BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeatherState                                 ___byte_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EWeatherState                                 ___byte_Variable_1;                                // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5962[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5963[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AGameStateBase*                         CallFunc_GetGameState_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLGameState_BreakFate*               K2Node_DynamicCast_AsQRSLGame_State_Break_Fate;    // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5964[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaSceneTimeManager*                 CallFunc_K2_GetSceneTimeManager_ReturnValue;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5965[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFogReplacementData                    K2Node_MakeStruct_FogReplacementData;              // 0x0034(0x001C)(NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5966[0x2];                                     // 0x0052(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeatherControllActor*                  CallFunc_K2_GetWeatherControllActor_ReturnValue;   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5967[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInClientGroupById_ReturnValue;          // 0x0072(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5968[0x1];                                     // 0x0073(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Variable;                                   // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeatherState                                 K2Node_Select_Default;                             // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere) == 0x000008, "Wrong alignment on BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere");
static_assert(sizeof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere) == 0x000080, "Wrong size on BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, EntryPoint) == 0x000000, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, ___byte_Variable) == 0x000004, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::___byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, ___byte_Variable_1) == 0x000005, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_GetGameState_ReturnValue) == 0x000010, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_GetGameState_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, K2Node_DynamicCast_AsQRSLGame_State_Break_Fate) == 0x000018, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::K2Node_DynamicCast_AsQRSLGame_State_Break_Fate' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_K2_GetSceneTimeManager_ReturnValue) == 0x000028, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_K2_GetSceneTimeManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000031, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, K2Node_MakeStruct_FogReplacementData) == 0x000034, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::K2Node_MakeStruct_FogReplacementData' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000050, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000051, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000054, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_K2_GetWeatherControllActor_ReturnValue) == 0x000058, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_K2_GetWeatherControllActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_IsValid_ReturnValue_1) == 0x000060, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_SwitchNetMode_OutNetMode) == 0x000061, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000068, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, K2Node_SwitchEnum_CmpSuccess) == 0x000070, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_IsValid_ReturnValue_2) == 0x000071, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_IsInClientGroupById_ReturnValue) == 0x000072, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_IsInClientGroupById_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, ___int_Variable) == 0x000074, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::___int_Variable' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, CallFunc_IsValid_ReturnValue_3) == 0x000078, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere, K2Node_Select_Default) == 0x000079, "Member 'BP_HottaSkySphere_C_ExecuteUbergraph_BP_HottaSkySphere::K2Node_Select_Default' has a wrong offset!");

}

