#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Harvest_Gold_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Harvest_Gold_Base.BP_Harvest_Gold_Base_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_Harvest_Gold_Base_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Harvest_Gold_Base_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on BP_Harvest_Gold_Base_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(BP_Harvest_Gold_Base_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on BP_Harvest_Gold_Base_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(BP_Harvest_Gold_Base_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'BP_Harvest_Gold_Base_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

// Function BP_Harvest_Gold_Base.BP_Harvest_Gold_Base_C.ExecuteUbergraph_BP_Harvest_Gold_Base
// 0x0020 (0x0020 - 0x0000)
struct BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E10[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base) == 0x000008, "Wrong alignment on BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base");
static_assert(sizeof(BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base) == 0x000020, "Wrong size on BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base");
static_assert(offsetof(BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base, EntryPoint) == 0x000000, "Member 'BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base, CallFunc_PostEventAtLocation_ReturnValue) == 0x000010, "Member 'BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base, K2Node_Event_MainPlayer) == 0x000018, "Member 'BP_Harvest_Gold_Base_C_ExecuteUbergraph_BP_Harvest_Gold_Base::K2Node_Event_MainPlayer' has a wrong offset!");

}

