#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HottapWeatherEffctActor

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_HottapWeatherEffctActor.BP_HottapWeatherEffctActor_C.UpdateWeather
// 0x0001 (0x0001 - 0x0000)
struct BP_HottapWeatherEffctActor_C_UpdateWeather final
{
public:
	EWeatherState                                 NewWeatherState;                                   // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HottapWeatherEffctActor_C_UpdateWeather) == 0x000001, "Wrong alignment on BP_HottapWeatherEffctActor_C_UpdateWeather");
static_assert(sizeof(BP_HottapWeatherEffctActor_C_UpdateWeather) == 0x000001, "Wrong size on BP_HottapWeatherEffctActor_C_UpdateWeather");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_UpdateWeather, NewWeatherState) == 0x000000, "Member 'BP_HottapWeatherEffctActor_C_UpdateWeather::NewWeatherState' has a wrong offset!");

// Function BP_HottapWeatherEffctActor.BP_HottapWeatherEffctActor_C.ExecuteUbergraph_BP_HottapWeatherEffctActor
// 0x0088 (0x0088 - 0x0000)
struct BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeatherState                                 K2Node_Event_NewWeatherState;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0016(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x0017(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Conv_BoolToFloat_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRainWeather_ReturnValue;                // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59DC[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_GetVectorParameterValue_ReturnValue;      // 0x0024(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_R;                             // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_G;                             // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_B;                             // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakColor_A;                             // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x0044(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59DD[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue;          // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59DE[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue; // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59DF[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameUserSettings*                      CallFunc_GetGameUserSettings_ReturnValue_1;        // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59E0[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDesktopRender_ReturnValue;              // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDesktopRender_ReturnValue_1;            // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor) == 0x000008, "Wrong alignment on BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor");
static_assert(sizeof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor) == 0x000088, "Wrong size on BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, EntryPoint) == 0x000000, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000014, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, K2Node_Event_NewWeatherState) == 0x000015, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::K2Node_Event_NewWeatherState' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000016, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x000017, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_Conv_BoolToFloat_ReturnValue) == 0x000018, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_Conv_BoolToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_IsRainWeather_ReturnValue) == 0x00001C, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_IsRainWeather_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000020, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_GetVectorParameterValue_ReturnValue) == 0x000024, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_GetVectorParameterValue_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_BreakColor_R) == 0x000034, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_BreakColor_R' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_BreakColor_G) == 0x000038, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_BreakColor_G' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_BreakColor_B) == 0x00003C, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_BreakColor_B' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_BreakColor_A) == 0x000040, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_BreakColor_A' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_MakeColor_ReturnValue) == 0x000044, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_GetGameUserSettings_ReturnValue) == 0x000058, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_GetGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_IsValid_ReturnValue) == 0x000060, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue) == 0x000064, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000068, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_GetGameUserSettings_ReturnValue_1) == 0x000070, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_GetGameUserSettings_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_IsValid_ReturnValue_1) == 0x000078, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1) == 0x00007C, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_NotEqual_IntInt_ReturnValue_1) == 0x000080, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_NotEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x000081, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_IsDesktopRender_ReturnValue) == 0x000082, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_IsDesktopRender_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor, CallFunc_IsDesktopRender_ReturnValue_1) == 0x000083, "Member 'BP_HottapWeatherEffctActor_C_ExecuteUbergraph_BP_HottapWeatherEffctActor::CallFunc_IsDesktopRender_ReturnValue_1' has a wrong offset!");

}

