#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_HVSpawnManager_WaterGem_Vera

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_HVSpawnManager_WaterGem_Vera.BP_HVSpawnManager_WaterGem_Vera_C.ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera
// 0x00C8 (0x00C8 - 0x0000)
struct BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57EB[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPOI                                   K2Node_MakeStruct_POI;                             // 0x0008(0x0060)()
	class AHottaVisualSpawnManager*               K2Node_CustomEvent_InstigateSpawner;               // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57EC[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57ED[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class AHottaVisualSpawnManager* InstigateSpawner)> K2Node_CreateDelegate_OutputDelegate;              // 0x008C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_57EE[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue;       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57EF[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimespan                              CallFunc_GetRoleHasCreateTime_ReturnValue;         // 0x00B8(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetTotalHours_ReturnValue;                // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x00C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera) == 0x000008, "Wrong alignment on BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera");
static_assert(sizeof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera) == 0x0000C8, "Wrong size on BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, EntryPoint) == 0x000000, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, K2Node_MakeStruct_POI) == 0x000008, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::K2Node_MakeStruct_POI' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, K2Node_CustomEvent_InstigateSpawner) == 0x000068, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::K2Node_CustomEvent_InstigateSpawner' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, CallFunc_SwitchNetMode_OutNetMode) == 0x000070, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, K2Node_SwitchEnum_CmpSuccess) == 0x000071, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000078, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000080, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, K2Node_CreateDelegate_OutputDelegate) == 0x00008C, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, K2Node_Event_MainPlayer) == 0x0000A0, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x0000A8, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, K2Node_DynamicCast_bSuccess_1) == 0x0000B0, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, CallFunc_IsYahaha2SubmittedByID_ReturnValue) == 0x0000B1, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::CallFunc_IsYahaha2SubmittedByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, CallFunc_GetRoleHasCreateTime_ReturnValue) == 0x0000B8, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::CallFunc_GetRoleHasCreateTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, CallFunc_GetTotalHours_ReturnValue) == 0x0000C0, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::CallFunc_GetTotalHours_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0000C4, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_ExecuteUbergraph_BP_HVSpawnManager_WaterGem_Vera::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");

// Function BP_HVSpawnManager_WaterGem_Vera.BP_HVSpawnManager_WaterGem_Vera_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_HVSpawnManager_WaterGem_Vera_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HVSpawnManager_WaterGem_Vera_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on BP_HVSpawnManager_WaterGem_Vera_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(BP_HVSpawnManager_WaterGem_Vera_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on BP_HVSpawnManager_WaterGem_Vera_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

// Function BP_HVSpawnManager_WaterGem_Vera.BP_HVSpawnManager_WaterGem_Vera_C.CustomEvent_0
// 0x0008 (0x0008 - 0x0000)
struct BP_HVSpawnManager_WaterGem_Vera_C_CustomEvent_0 final
{
public:
	class AHottaVisualSpawnManager*               InstigateSpawner;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_HVSpawnManager_WaterGem_Vera_C_CustomEvent_0) == 0x000008, "Wrong alignment on BP_HVSpawnManager_WaterGem_Vera_C_CustomEvent_0");
static_assert(sizeof(BP_HVSpawnManager_WaterGem_Vera_C_CustomEvent_0) == 0x000008, "Wrong size on BP_HVSpawnManager_WaterGem_Vera_C_CustomEvent_0");
static_assert(offsetof(BP_HVSpawnManager_WaterGem_Vera_C_CustomEvent_0, InstigateSpawner) == 0x000000, "Member 'BP_HVSpawnManager_WaterGem_Vera_C_CustomEvent_0::InstigateSpawner' has a wrong offset!");

}

