#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Harvest_Gem_BornWithGravity_A1

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_Harvest_Gem_BornWithGravity_A1.BP_Harvest_Gem_BornWithGravity_A1_C.ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1
// 0x0040 (0x0040 - 0x0000)
struct BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                CallFunc_LoadAsset_Blocking_ReturnValue;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_As____;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CD9[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocationEx_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1) == 0x000008, "Wrong alignment on BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1");
static_assert(sizeof(BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1) == 0x000040, "Wrong size on BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1");
static_assert(offsetof(BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1, EntryPoint) == 0x000000, "Member 'BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000010, "Member 'BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1, CallFunc_PostEventAtLocation_ReturnValue) == 0x00001C, "Member 'BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1, CallFunc_LoadAsset_Blocking_ReturnValue) == 0x000020, "Member 'BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1::CallFunc_LoadAsset_Blocking_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1, K2Node_DynamicCast_As____) == 0x000028, "Member 'BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1, CallFunc_SpawnEmitterAtLocationEx_ReturnValue) == 0x000038, "Member 'BP_Harvest_Gem_BornWithGravity_A1_C_ExecuteUbergraph_BP_Harvest_Gem_BornWithGravity_A1::CallFunc_SpawnEmitterAtLocationEx_ReturnValue' has a wrong offset!");

}

