#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MiniGame_FireLink_Vera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MiniGame_FireLink_Vera.BP_MiniGame_FireLink_Vera_C
// 0x0060 (0x0CE0 - 0x0C80)
class ABP_MiniGame_FireLink_Vera_C final : public AHottaFireRelatedActor
{
public:
	uint8                                         Pad_6D88[0x8];                                     // 0x0C78(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UQRSLChangeMeshColorComponent*          ChangeMeshColor;                                   // 0x0C88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          GuideTriggerBox;                                   // 0x0C90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDialogueComponent*                     FireLinkOpenDialogue;                              // 0x0C98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_WorldMinigame_Guide_001;                         // 0x0CA0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AHottaVisualSpawnManager*               RewardSpawnManager;                                // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         AutoQuenchTime;                                    // 0x0CB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D89[0x4];                                     // 0x0CB4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          CloseLoop;                                         // 0x0CB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          OpenLoop;                                          // 0x0CC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Open;                                              // 0x0CC8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Open_Montage;                                      // 0x0CD0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MiniGame_FireLink_Vera(int32 EntryPoint);
	void BP_OnPlayHasOpened();
	void BPOnMainRoleLoadFinished(class AHottaPlayerCharacter* MainPlayer);
	void PlayOpenAnimation();
	void FireActorBurned(class AActor* OtherActor);
	void BndEvt__RewardSpawnManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature(class AHottaVisualSpawnManager* InstigateSpawner);
	bool BPCanTakeDamage(float DamageAmount, const struct FDamageEvent& DamageEvent, class AController* EventInstigator, class AActor* DamageCauser);

	class FText GetParticipantDisplayName(class FName ActiveSpeaker) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MiniGame_FireLink_Vera_C">();
	}
	static class ABP_MiniGame_FireLink_Vera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MiniGame_FireLink_Vera_C>();
	}
};
static_assert(alignof(ABP_MiniGame_FireLink_Vera_C) == 0x000010, "Wrong alignment on ABP_MiniGame_FireLink_Vera_C");
static_assert(sizeof(ABP_MiniGame_FireLink_Vera_C) == 0x000CE0, "Wrong size on ABP_MiniGame_FireLink_Vera_C");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, UberGraphFrame) == 0x000C80, "Member 'ABP_MiniGame_FireLink_Vera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, ChangeMeshColor) == 0x000C88, "Member 'ABP_MiniGame_FireLink_Vera_C::ChangeMeshColor' has a wrong offset!");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, GuideTriggerBox) == 0x000C90, "Member 'ABP_MiniGame_FireLink_Vera_C::GuideTriggerBox' has a wrong offset!");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, FireLinkOpenDialogue) == 0x000C98, "Member 'ABP_MiniGame_FireLink_Vera_C::FireLinkOpenDialogue' has a wrong offset!");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, P_WorldMinigame_Guide_001) == 0x000CA0, "Member 'ABP_MiniGame_FireLink_Vera_C::P_WorldMinigame_Guide_001' has a wrong offset!");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, RewardSpawnManager) == 0x000CA8, "Member 'ABP_MiniGame_FireLink_Vera_C::RewardSpawnManager' has a wrong offset!");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, AutoQuenchTime) == 0x000CB0, "Member 'ABP_MiniGame_FireLink_Vera_C::AutoQuenchTime' has a wrong offset!");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, CloseLoop) == 0x000CB8, "Member 'ABP_MiniGame_FireLink_Vera_C::CloseLoop' has a wrong offset!");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, OpenLoop) == 0x000CC0, "Member 'ABP_MiniGame_FireLink_Vera_C::OpenLoop' has a wrong offset!");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, Open) == 0x000CC8, "Member 'ABP_MiniGame_FireLink_Vera_C::Open' has a wrong offset!");
static_assert(offsetof(ABP_MiniGame_FireLink_Vera_C, Open_Montage) == 0x000CD0, "Member 'ABP_MiniGame_FireLink_Vera_C::Open_Montage' has a wrong offset!");

}

