#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MeridiansActorComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MeridiansActorComponent.BP_MeridiansActorComponent_C
// 0x0030 (0x0460 - 0x0430)
class UBP_MeridiansActorComponent_C final : public UMeridiansActorComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0430(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	TArray<struct FVector>                        Test;                                              // 0x0438(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                                Position;                                          // 0x0448(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MeridiansActorComponent(int32 EntryPoint);
	void ReceiveBeginPlay();
	void Gen();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MeridiansActorComponent_C">();
	}
	static class UBP_MeridiansActorComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_MeridiansActorComponent_C>();
	}
};
static_assert(alignof(UBP_MeridiansActorComponent_C) == 0x000010, "Wrong alignment on UBP_MeridiansActorComponent_C");
static_assert(sizeof(UBP_MeridiansActorComponent_C) == 0x000460, "Wrong size on UBP_MeridiansActorComponent_C");
static_assert(offsetof(UBP_MeridiansActorComponent_C, UberGraphFrame) == 0x000430, "Member 'UBP_MeridiansActorComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_MeridiansActorComponent_C, Test) == 0x000438, "Member 'UBP_MeridiansActorComponent_C::Test' has a wrong offset!");
static_assert(offsetof(UBP_MeridiansActorComponent_C, Position) == 0x000448, "Member 'UBP_MeridiansActorComponent_C::Position' has a wrong offset!");

}

