#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MapTransferPoint_Vera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_MapTransferPoint_Vera.BP_MapTransferPoint_Vera_C
// 0x0080 (0x0630 - 0x05B0)
class ABP_MapTransferPoint_Vera_C final : public AHottaMapPointActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UAkComponent*                           AK;                                                // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ActiveParticleSysOpen;                             // 0x05C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UQRSLChangeMeshColorComponent*          QRSLChangeMeshColor;                               // 0x05C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x05D0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ActiveParticleSysComp;                             // 0x05D8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x05E0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ActivedParticleSys;                                // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QuestID;                                           // 0x05F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QuestObjID;                                        // 0x05F8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LastTipsTime;                                      // 0x0600(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TipsInterval;                                      // 0x0604(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsInitial;                                        // 0x0608(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EMapPointState                                ActiveState;                                       // 0x0609(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56D7[0x6];                                     // 0x060A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInteractEntry>                 InteractEntry;                                     // 0x0610(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	float                                         LastUpdateTime;                                    // 0x0620(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_MapTransferPoint_Vera(int32 EntryPoint);
	void BPOnMainRoleLoadFinished(class AHottaPlayerCharacter* MainPlayer);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void BPInteractFinished(class AHottaPlayerController* ByPC, int32 InteractIndex);
	void BPPlayStateAnimation(EMapPointState MapPointState);
	void BPInitStateAnimation();
	void BPGetInteractEntries(class AHottaPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void RefreshPointStatus();
	void OnTimerShowTips();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_MapTransferPoint_Vera_C">();
	}
	static class ABP_MapTransferPoint_Vera_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_MapTransferPoint_Vera_C>();
	}
};
static_assert(alignof(ABP_MapTransferPoint_Vera_C) == 0x000010, "Wrong alignment on ABP_MapTransferPoint_Vera_C");
static_assert(sizeof(ABP_MapTransferPoint_Vera_C) == 0x000630, "Wrong size on ABP_MapTransferPoint_Vera_C");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, UberGraphFrame) == 0x0005B0, "Member 'ABP_MapTransferPoint_Vera_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, AK) == 0x0005B8, "Member 'ABP_MapTransferPoint_Vera_C::AK' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, ActiveParticleSysOpen) == 0x0005C0, "Member 'ABP_MapTransferPoint_Vera_C::ActiveParticleSysOpen' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, QRSLChangeMeshColor) == 0x0005C8, "Member 'ABP_MapTransferPoint_Vera_C::QRSLChangeMeshColor' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, ParticleSystem) == 0x0005D0, "Member 'ABP_MapTransferPoint_Vera_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, ActiveParticleSysComp) == 0x0005D8, "Member 'ABP_MapTransferPoint_Vera_C::ActiveParticleSysComp' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, Sphere) == 0x0005E0, "Member 'ABP_MapTransferPoint_Vera_C::Sphere' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, ActivedParticleSys) == 0x0005E8, "Member 'ABP_MapTransferPoint_Vera_C::ActivedParticleSys' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, QuestID) == 0x0005F0, "Member 'ABP_MapTransferPoint_Vera_C::QuestID' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, QuestObjID) == 0x0005F8, "Member 'ABP_MapTransferPoint_Vera_C::QuestObjID' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, LastTipsTime) == 0x000600, "Member 'ABP_MapTransferPoint_Vera_C::LastTipsTime' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, TipsInterval) == 0x000604, "Member 'ABP_MapTransferPoint_Vera_C::TipsInterval' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, bIsInitial) == 0x000608, "Member 'ABP_MapTransferPoint_Vera_C::bIsInitial' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, ActiveState) == 0x000609, "Member 'ABP_MapTransferPoint_Vera_C::ActiveState' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, InteractEntry) == 0x000610, "Member 'ABP_MapTransferPoint_Vera_C::InteractEntry' has a wrong offset!");
static_assert(offsetof(ABP_MapTransferPoint_Vera_C, LastUpdateTime) == 0x000620, "Member 'ABP_MapTransferPoint_Vera_C::LastUpdateTime' has a wrong offset!");

}

