#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_MiniGame_FireLink_Vera

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_MiniGame_FireLink_Vera.BP_MiniGame_FireLink_Vera_C.ExecuteUbergraph_BP_MiniGame_FireLink_Vera
// 0x00E0 (0x00E0 - 0x0000)
struct BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D8A[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPOI                                   K2Node_MakeStruct_POI;                             // 0x0008(0x0060)()
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue;       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D8B[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D8C[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayOpened_ReturnValue;                 // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D8D[0x5];                                     // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaVisualSpawnManager*               K2Node_ComponentBoundEvent_InstigateSpawner;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_2;       // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D8E[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMon_ele_008_C*                         K2Node_DynamicCast_AsMon_Ele_008;                  // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue_1;     // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue;            // 0x00CA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D8F[0x5];                                     // 0x00CB(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_3;       // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue_2;     // 0x00D9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue_1;          // 0x00DA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera) == 0x000008, "Wrong alignment on BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera");
static_assert(sizeof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera) == 0x0000E0, "Wrong size on BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, EntryPoint) == 0x000000, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_MakeStruct_POI) == 0x000008, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_MakeStruct_POI' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_Event_MainPlayer) == 0x000068, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000070, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, CallFunc_IsYahaha2SubmittedByID_ReturnValue) == 0x000078, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::CallFunc_IsYahaha2SubmittedByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000080, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_DynamicCast_bSuccess) == 0x000088, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000090, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_DynamicCast_bSuccess_1) == 0x000098, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, CallFunc_IsPlayOpened_ReturnValue) == 0x000099, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::CallFunc_IsPlayOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, CallFunc_IsValid_ReturnValue) == 0x00009A, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_ComponentBoundEvent_InstigateSpawner) == 0x0000A0, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_ComponentBoundEvent_InstigateSpawner' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_Event_OtherActor) == 0x0000A8, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_DynamicCast_AsQRSLPlayer_Character_2) == 0x0000B0, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_DynamicCast_AsQRSLPlayer_Character_2' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_DynamicCast_bSuccess_2) == 0x0000B8, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_DynamicCast_AsMon_Ele_008) == 0x0000C0, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_DynamicCast_AsMon_Ele_008' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_DynamicCast_bSuccess_3) == 0x0000C8, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, CallFunc_IsYahaha2SubmittedByID_ReturnValue_1) == 0x0000C9, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::CallFunc_IsYahaha2SubmittedByID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, CallFunc_IsLocalClientRole_ReturnValue) == 0x0000CA, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::CallFunc_IsLocalClientRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_DynamicCast_AsQRSLPlayer_Character_3) == 0x0000D0, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_DynamicCast_AsQRSLPlayer_Character_3' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, K2Node_DynamicCast_bSuccess_4) == 0x0000D8, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, CallFunc_IsYahaha2SubmittedByID_ReturnValue_2) == 0x0000D9, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::CallFunc_IsYahaha2SubmittedByID_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera, CallFunc_IsLocalClientRole_ReturnValue_1) == 0x0000DA, "Member 'BP_MiniGame_FireLink_Vera_C_ExecuteUbergraph_BP_MiniGame_FireLink_Vera::CallFunc_IsLocalClientRole_ReturnValue_1' has a wrong offset!");

// Function BP_MiniGame_FireLink_Vera.BP_MiniGame_FireLink_Vera_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_MiniGame_FireLink_Vera_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MiniGame_FireLink_Vera_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on BP_MiniGame_FireLink_Vera_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(BP_MiniGame_FireLink_Vera_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on BP_MiniGame_FireLink_Vera_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'BP_MiniGame_FireLink_Vera_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

// Function BP_MiniGame_FireLink_Vera.BP_MiniGame_FireLink_Vera_C.FireActorBurned
// 0x0008 (0x0008 - 0x0000)
struct BP_MiniGame_FireLink_Vera_C_FireActorBurned final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MiniGame_FireLink_Vera_C_FireActorBurned) == 0x000008, "Wrong alignment on BP_MiniGame_FireLink_Vera_C_FireActorBurned");
static_assert(sizeof(BP_MiniGame_FireLink_Vera_C_FireActorBurned) == 0x000008, "Wrong size on BP_MiniGame_FireLink_Vera_C_FireActorBurned");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_FireActorBurned, OtherActor) == 0x000000, "Member 'BP_MiniGame_FireLink_Vera_C_FireActorBurned::OtherActor' has a wrong offset!");

// Function BP_MiniGame_FireLink_Vera.BP_MiniGame_FireLink_Vera_C.BndEvt__RewardSpawnManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_MiniGame_FireLink_Vera_C_BndEvt__RewardSpawnManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature final
{
public:
	class AHottaVisualSpawnManager*               InstigateSpawner;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_MiniGame_FireLink_Vera_C_BndEvt__RewardSpawnManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_MiniGame_FireLink_Vera_C_BndEvt__RewardSpawnManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(sizeof(BP_MiniGame_FireLink_Vera_C_BndEvt__RewardSpawnManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong size on BP_MiniGame_FireLink_Vera_C_BndEvt__RewardSpawnManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BndEvt__RewardSpawnManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature, InstigateSpawner) == 0x000000, "Member 'BP_MiniGame_FireLink_Vera_C_BndEvt__RewardSpawnManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature::InstigateSpawner' has a wrong offset!");

// Function BP_MiniGame_FireLink_Vera.BP_MiniGame_FireLink_Vera_C.BPCanTakeDamage
// 0x0090 (0x0090 - 0x0000)
struct BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage final
{
public:
	float                                         DamageAmount;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D90[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDamageEvent                           DamageEvent;                                       // 0x0008(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class AController*                            EventInstigator;                                   // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 DamageCauser;                                      // 0x0020(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0028(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D91[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D92[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D93[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMon_ele_008_C*                         K2Node_DynamicCast_AsMon_Ele_008;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayOpened_ReturnValue;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D94[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D95[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_2;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue;       // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayOpened_ReturnValue_1;               // 0x0082(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0083(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPlayOpened_ReturnValue_2;               // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue_1;     // 0x0085(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0086(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue_2;     // 0x0087(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage) == 0x000008, "Wrong alignment on BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage");
static_assert(sizeof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage) == 0x000090, "Wrong size on BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, DamageAmount) == 0x000000, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::DamageAmount' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, DamageEvent) == 0x000008, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::DamageEvent' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, EventInstigator) == 0x000018, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::EventInstigator' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, DamageCauser) == 0x000020, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, ReturnValue) == 0x000028, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_GetOwner_ReturnValue) == 0x000030, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_GetOwner_ReturnValue_1) == 0x000038, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_IsValid_ReturnValue_1) == 0x000041, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000048, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, K2Node_DynamicCast_AsMon_Ele_008) == 0x000058, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::K2Node_DynamicCast_AsMon_Ele_008' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_IsPlayOpened_ReturnValue) == 0x000061, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_IsPlayOpened_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000068, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, K2Node_DynamicCast_AsQRSLPlayer_Character_2) == 0x000078, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::K2Node_DynamicCast_AsQRSLPlayer_Character_2' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, K2Node_DynamicCast_bSuccess_3) == 0x000080, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_IsYahaha2SubmittedByID_ReturnValue) == 0x000081, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_IsYahaha2SubmittedByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_IsPlayOpened_ReturnValue_1) == 0x000082, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_IsPlayOpened_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_Not_PreBool_ReturnValue) == 0x000083, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_IsPlayOpened_ReturnValue_2) == 0x000084, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_IsPlayOpened_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_IsYahaha2SubmittedByID_ReturnValue_1) == 0x000085, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_IsYahaha2SubmittedByID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_Not_PreBool_ReturnValue_1) == 0x000086, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_IsYahaha2SubmittedByID_ReturnValue_2) == 0x000087, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_IsYahaha2SubmittedByID_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage, CallFunc_Not_PreBool_ReturnValue_2) == 0x000088, "Member 'BP_MiniGame_FireLink_Vera_C_BPCanTakeDamage::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");

// Function BP_MiniGame_FireLink_Vera.BP_MiniGame_FireLink_Vera_C.GetParticipantDisplayName
// 0x0020 (0x0020 - 0x0000)
struct BP_MiniGame_FireLink_Vera_C_GetParticipantDisplayName final
{
public:
	class FName                                   ActiveSpeaker;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   ReturnValue;                                       // 0x0008(0x0018)(Parm, OutParm, ReturnParm)
};
static_assert(alignof(BP_MiniGame_FireLink_Vera_C_GetParticipantDisplayName) == 0x000008, "Wrong alignment on BP_MiniGame_FireLink_Vera_C_GetParticipantDisplayName");
static_assert(sizeof(BP_MiniGame_FireLink_Vera_C_GetParticipantDisplayName) == 0x000020, "Wrong size on BP_MiniGame_FireLink_Vera_C_GetParticipantDisplayName");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_GetParticipantDisplayName, ActiveSpeaker) == 0x000000, "Member 'BP_MiniGame_FireLink_Vera_C_GetParticipantDisplayName::ActiveSpeaker' has a wrong offset!");
static_assert(offsetof(BP_MiniGame_FireLink_Vera_C_GetParticipantDisplayName, ReturnValue) == 0x000008, "Member 'BP_MiniGame_FireLink_Vera_C_GetParticipantDisplayName::ReturnValue' has a wrong offset!");

}

