#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Minigame_PerspectivePuzzle_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_Minigame_PerspectivePuzzle_Base.BP_Minigame_PerspectivePuzzle_Base_C.ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base
// 0x0230 (0x0230 - 0x0000)
struct BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue;      // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0020(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetForwardVector_ReturnValue;             // 0x0034(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue;                       // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x004C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_563E[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaVisualSpawnManager*               K2Node_ComponentBoundEvent_InstigateSpawner;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_563F[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue;       // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5640[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0098(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5641[0x3];                                     // 0x00B5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00B8(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0144(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5642[0x3];                                     // 0x0145(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_2;       // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue;            // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue_1;     // 0x0152(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5643[0x5];                                     // 0x0153(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0170(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5644[0x4];                                     // 0x0174(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_3;       // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue_1;          // 0x0181(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5645[0x6];                                     // 0x0182(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_1;   // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_1;               // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5646[0x3];                                     // 0x0191(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               CallFunc_K2_GetComponentRotation_ReturnValue_1;    // 0x0194(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x01A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5647[0x3];                                     // 0x01A1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x01A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x01AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x01B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetDeltaAngleDegrees_ReturnValue;         // 0x01BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x01C0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x01CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Normal_ReturnValue_1;                     // 0x01D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x01DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5648[0x3];                                     // 0x01DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x01E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x01E4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5649[0x3];                                     // 0x01E5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x01E8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x01F8(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0208(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0218(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0228(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base) == 0x000008, "Wrong alignment on BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base");
static_assert(sizeof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base) == 0x000230, "Wrong size on BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, EntryPoint) == 0x000000, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_K2_GetComponentRotation_ReturnValue) == 0x000014, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_K2_GetComponentRotation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000020, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_BreakRotator_Roll) == 0x000028, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_BreakRotator_Pitch) == 0x00002C, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_BreakRotator_Yaw) == 0x000030, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_GetForwardVector_ReturnValue) == 0x000034, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_GetForwardVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_Normal_ReturnValue) == 0x000040, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_Normal_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00004C, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_IsValid_ReturnValue) == 0x000058, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_InstigateSpawner) == 0x000060, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_InstigateSpawner' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000068, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000070, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_Event_MainPlayer) == 0x000080, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000088, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_DynamicCast_bSuccess_1) == 0x000090, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_IsYahaha2SubmittedByID_ReturnValue) == 0x000091, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_IsYahaha2SubmittedByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_SwitchNetMode_OutNetMode) == 0x000092, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000098, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_OtherActor_1) == 0x0000A0, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_OtherComp_1) == 0x0000A8, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x0000B0, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_bFromSweep) == 0x0000B4, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_SweepResult) == 0x0000B8, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_SwitchEnum_CmpSuccess) == 0x000144, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_DynamicCast_AsQRSLPlayer_Character_2) == 0x000148, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_DynamicCast_AsQRSLPlayer_Character_2' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_DynamicCast_bSuccess_2) == 0x000150, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_IsLocalClientRole_ReturnValue) == 0x000151, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_IsLocalClientRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_IsYahaha2SubmittedByID_ReturnValue_1) == 0x000152, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_IsYahaha2SubmittedByID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000158, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_OtherActor) == 0x000160, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_OtherComp) == 0x000168, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000170, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_DynamicCast_AsQRSLPlayer_Character_3) == 0x000178, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_DynamicCast_AsQRSLPlayer_Character_3' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_DynamicCast_bSuccess_3) == 0x000180, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_IsLocalClientRole_ReturnValue_1) == 0x000181, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_IsLocalClientRole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_GetClientPlayerCharacter_ReturnValue_1) == 0x000188, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_GetClientPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_SwitchNetMode_OutNetMode_1) == 0x000190, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_SwitchNetMode_OutNetMode_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_K2_GetComponentRotation_ReturnValue_1) == 0x000194, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_K2_GetComponentRotation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_SwitchEnum_CmpSuccess_1) == 0x0001A0, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_BreakRotator_Roll_1) == 0x0001A4, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_BreakRotator_Pitch_1) == 0x0001A8, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_BreakRotator_Yaw_1) == 0x0001AC, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x0001B0, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_GetDeltaAngleDegrees_ReturnValue) == 0x0001BC, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_GetDeltaAngleDegrees_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_Subtract_VectorVector_ReturnValue) == 0x0001C0, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_Abs_ReturnValue) == 0x0001CC, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_Normal_ReturnValue_1) == 0x0001D0, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_Normal_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x0001DC, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_Dot_VectorVector_ReturnValue) == 0x0001E0, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x0001E4, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_Conv_FloatToString_ReturnValue) == 0x0001E8, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_Concat_StrStr_ReturnValue) == 0x0001F8, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000208, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000218, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base, K2Node_Event_EndPlayReason) == 0x000228, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ExecuteUbergraph_BP_Minigame_PerspectivePuzzle_Base::K2Node_Event_EndPlayReason' has a wrong offset!");

// Function BP_Minigame_PerspectivePuzzle_Base.BP_Minigame_PerspectivePuzzle_Base_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_Minigame_PerspectivePuzzle_Base_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Minigame_PerspectivePuzzle_Base_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_Minigame_PerspectivePuzzle_Base_C_ReceiveEndPlay");
static_assert(sizeof(BP_Minigame_PerspectivePuzzle_Base_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_Minigame_PerspectivePuzzle_Base_C_ReceiveEndPlay");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_Minigame_PerspectivePuzzle_Base.BP_Minigame_PerspectivePuzzle_Base_C.BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_2_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function BP_Minigame_PerspectivePuzzle_Base.BP_Minigame_PerspectivePuzzle_Base_C.BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_564A[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_Base_SphereTrigger_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function BP_Minigame_PerspectivePuzzle_Base.BP_Minigame_PerspectivePuzzle_Base_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_Minigame_PerspectivePuzzle_Base_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Minigame_PerspectivePuzzle_Base_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on BP_Minigame_PerspectivePuzzle_Base_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(BP_Minigame_PerspectivePuzzle_Base_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on BP_Minigame_PerspectivePuzzle_Base_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(BP_Minigame_PerspectivePuzzle_Base_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'BP_Minigame_PerspectivePuzzle_Base_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

// Function BP_Minigame_PerspectivePuzzle_Base.BP_Minigame_PerspectivePuzzle_Base_C.BndEvt__BP_Minigame_PerspectivePuzzle_1_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_1_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature final
{
public:
	class AHottaVisualSpawnManager*               InstigateSpawner;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_1_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_1_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(sizeof(BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_1_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Minigame_PerspectivePuzzle_Base_C_BndEvt__BP_Minigame_PerspectivePuzzle_1_RewardManager_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
