#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_mon_hum_026_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_mon_hum_026_Shake.BP_mon_hum_026_Shake_C
// 0x0C20 (0x0EE0 - 0x02C0)
class UBP_mon_hum_026_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_59D8[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02F8(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0410(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0430(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0450(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0558(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0660(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0768(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0870(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0978(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0A80(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0B88(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0C90(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0D98(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0EA0(0x0030)()
	float                                         BlendAlpha;                                        // 0x0ED0(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PushScale;                                         // 0x0ED4(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_mon_hum_026_Shake(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_026_Shake_AnimGraphNode_ModifyBone_EE001FC247BB1C6DF7162DB65683F2B0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_026_Shake_AnimGraphNode_ModifyBone_052064FE4FBF4236F3096080CF5C9A42();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_026_Shake_AnimGraphNode_ModifyBone_7312D96A48B942CFBBF2D4AD3A24D253();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_026_Shake_AnimGraphNode_ModifyBone_7D39481A4800179A7B3770BFB9C10A3B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_026_Shake_AnimGraphNode_ModifyBone_18B386584030EA6D415DE69FE4CECEB2();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_026_Shake_AnimGraphNode_ModifyBone_643C0D6A43DC5962852B96837A491F38();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_026_Shake_AnimGraphNode_ModifyBone_603887B2489CAB1B65DCCD8E6E491BBE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_026_Shake_AnimGraphNode_ModifyBone_ACB76F3847E38B8816085F9F2BACE54D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_026_Shake_AnimGraphNode_ModifyBone_9A04505E4126299014219D99373FE88D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_026_Shake_AnimGraphNode_ModifyBone_B5D5EA1540FF258D707F08BCB9DDEA6B();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BoneShakeLayer(const struct FPoseLink& InPose, float Param_PushScale, float Param_BlendAlpha, struct FPoseLink* Param_BoneShakeLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_mon_hum_026_Shake_C">();
	}
	static class UBP_mon_hum_026_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_mon_hum_026_Shake_C>();
	}
};
static_assert(alignof(UBP_mon_hum_026_Shake_C) == 0x000010, "Wrong alignment on UBP_mon_hum_026_Shake_C");
static_assert(sizeof(UBP_mon_hum_026_Shake_C) == 0x000EE0, "Wrong size on UBP_mon_hum_026_Shake_C");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_mon_hum_026_Shake_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_Root_1) == 0x0002C8, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_LinkedInputPose) == 0x0002F8, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_LocalToComponentSpace) == 0x000410, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ComponentToLocalSpace) == 0x000430, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ModifyBone_9) == 0x000450, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ModifyBone_8) == 0x000558, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ModifyBone_7) == 0x000660, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ModifyBone_6) == 0x000768, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ModifyBone_5) == 0x000870, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ModifyBone_4) == 0x000978, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ModifyBone_3) == 0x000A80, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ModifyBone_2) == 0x000B88, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ModifyBone_1) == 0x000C90, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_ModifyBone) == 0x000D98, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, AnimGraphNode_Root) == 0x000EA0, "Member 'UBP_mon_hum_026_Shake_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, BlendAlpha) == 0x000ED0, "Member 'UBP_mon_hum_026_Shake_C::BlendAlpha' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_026_Shake_C, PushScale) == 0x000ED4, "Member 'UBP_mon_hum_026_Shake_C::PushScale' has a wrong offset!");

}

