#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_mon_hum_022_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_mon_hum_022_Shake.BP_mon_hum_022_Shake_C
// 0x0C20 (0x0EE0 - 0x02C0)
class UBP_mon_hum_022_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_6CAF[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02F8(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0410(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0430(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0450(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0558(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0660(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0768(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0870(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0978(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0A80(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0B88(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0C90(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0D98(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0EA0(0x0030)()
	float                                         BlendAlpha;                                        // 0x0ED0(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PushScale;                                         // 0x0ED4(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_mon_hum_022_Shake(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_022_Shake_AnimGraphNode_ModifyBone_AAB5759A45A072CB03332A9BBBF14BD1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_022_Shake_AnimGraphNode_ModifyBone_E7E6F107453C023486307FA9CAC8C334();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_022_Shake_AnimGraphNode_ModifyBone_CD6FA2BF421A0BA37A90209B238649A3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_022_Shake_AnimGraphNode_ModifyBone_0590F8594D66C52C2E05D8B5E9028CE6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_022_Shake_AnimGraphNode_ModifyBone_ECA1FF78438673ABD7F8F5B4C33EF761();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_022_Shake_AnimGraphNode_ModifyBone_6033C2AD4B1A572F694F2894AA38F348();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_022_Shake_AnimGraphNode_ModifyBone_C60BA83E4C17DFE0153EB0ABDAF58D3A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_022_Shake_AnimGraphNode_ModifyBone_0FEEDAB04849FB621E1707B9618D417B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_022_Shake_AnimGraphNode_ModifyBone_89EACBEF439FB576300516891C381646();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_022_Shake_AnimGraphNode_ModifyBone_2713D8F741E0E3903FFE4FA53959D607();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BoneShakeLayer(const struct FPoseLink& InPose, float Param_PushScale, float Param_BlendAlpha, struct FPoseLink* Param_BoneShakeLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_mon_hum_022_Shake_C">();
	}
	static class UBP_mon_hum_022_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_mon_hum_022_Shake_C>();
	}
};
static_assert(alignof(UBP_mon_hum_022_Shake_C) == 0x000010, "Wrong alignment on UBP_mon_hum_022_Shake_C");
static_assert(sizeof(UBP_mon_hum_022_Shake_C) == 0x000EE0, "Wrong size on UBP_mon_hum_022_Shake_C");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_mon_hum_022_Shake_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_Root_1) == 0x0002C8, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_LinkedInputPose) == 0x0002F8, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_LocalToComponentSpace) == 0x000410, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ComponentToLocalSpace) == 0x000430, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ModifyBone_9) == 0x000450, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ModifyBone_8) == 0x000558, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ModifyBone_7) == 0x000660, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ModifyBone_6) == 0x000768, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ModifyBone_5) == 0x000870, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ModifyBone_4) == 0x000978, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ModifyBone_3) == 0x000A80, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ModifyBone_2) == 0x000B88, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ModifyBone_1) == 0x000C90, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_ModifyBone) == 0x000D98, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, AnimGraphNode_Root) == 0x000EA0, "Member 'UBP_mon_hum_022_Shake_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, BlendAlpha) == 0x000ED0, "Member 'UBP_mon_hum_022_Shake_C::BlendAlpha' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_022_Shake_C, PushScale) == 0x000ED4, "Member 'UBP_mon_hum_022_Shake_C::PushScale' has a wrong offset!");

}

