#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_mon_hum_009_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass BP_mon_hum_009_Shake.BP_mon_hum_009_Shake_C
// 0x0B10 (0x0DD0 - 0x02C0)
class UBP_mon_hum_009_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_6C87[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02C8(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x03E0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0400(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0420(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x0528(0x0030)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0558(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0660(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0768(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0870(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0978(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0A80(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0B88(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0C90(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0D98(0x0030)()
	float                                         BlendAlpha;                                        // 0x0DC8(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PushScale;                                         // 0x0DCC(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void BoneShakeLayer(const struct FPoseLink& InPose, float Param_PushScale, float Param_BlendAlpha, struct FPoseLink* Param_BoneShakeLayer);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_009_Shake_AnimGraphNode_ModifyBone_8C07B8FB4891DA56F22E2F835A129DB5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_009_Shake_AnimGraphNode_ModifyBone_6042379244B54943AB0249A71A794EB7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_009_Shake_AnimGraphNode_ModifyBone_8EF9D44A4D4D66CCEB3088BAF98F3648();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_009_Shake_AnimGraphNode_ModifyBone_1456E816435F2E11419C6688DB535F45();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_009_Shake_AnimGraphNode_ModifyBone_8D26AE82428E28FDB5B603AB15DF352E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_009_Shake_AnimGraphNode_ModifyBone_32283AEF47231079A85F7BA50CBFF443();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_009_Shake_AnimGraphNode_ModifyBone_CDF3AB14458F5D06177AA59073823B04();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_009_Shake_AnimGraphNode_ModifyBone_A1DD001341F467052C08B9A47479AF14();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BP_mon_hum_009_Shake_AnimGraphNode_ModifyBone_BCD2BA9140E5BBB0259ACF95F580B07F();
	void ExecuteUbergraph_BP_mon_hum_009_Shake(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_mon_hum_009_Shake_C">();
	}
	static class UBP_mon_hum_009_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_mon_hum_009_Shake_C>();
	}
};
static_assert(alignof(UBP_mon_hum_009_Shake_C) == 0x000010, "Wrong alignment on UBP_mon_hum_009_Shake_C");
static_assert(sizeof(UBP_mon_hum_009_Shake_C) == 0x000DD0, "Wrong size on UBP_mon_hum_009_Shake_C");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, UberGraphFrame) == 0x0002C0, "Member 'UBP_mon_hum_009_Shake_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_LinkedInputPose) == 0x0002C8, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_LocalToComponentSpace) == 0x0003E0, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_ComponentToLocalSpace) == 0x000400, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_ModifyBone_8) == 0x000420, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_Root_1) == 0x000528, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_ModifyBone_7) == 0x000558, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_ModifyBone_6) == 0x000660, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_ModifyBone_5) == 0x000768, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_ModifyBone_4) == 0x000870, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_ModifyBone_3) == 0x000978, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_ModifyBone_2) == 0x000A80, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_ModifyBone_1) == 0x000B88, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_ModifyBone) == 0x000C90, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, AnimGraphNode_Root) == 0x000D98, "Member 'UBP_mon_hum_009_Shake_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, BlendAlpha) == 0x000DC8, "Member 'UBP_mon_hum_009_Shake_C::BlendAlpha' has a wrong offset!");
static_assert(offsetof(UBP_mon_hum_009_Shake_C, PushScale) == 0x000DCC, "Member 'UBP_mon_hum_009_Shake_C::PushScale' has a wrong offset!");

}

