#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_NestYahahaSpawner

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_NestYahahaSpawner.BP_NestYahahaSpawner_C.ExecuteUbergraph_BP_NestYahahaSpawner
// 0x0028 (0x0028 - 0x0000)
struct BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5806[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue;       // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner) == 0x000008, "Wrong alignment on BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner");
static_assert(sizeof(BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner) == 0x000028, "Wrong size on BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner");
static_assert(offsetof(BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner, EntryPoint) == 0x000000, "Member 'BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner, K2Node_Event_MainPlayer) == 0x000008, "Member 'BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000010, "Member 'BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000018, "Member 'BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner, CallFunc_IsYahaha2SubmittedByID_ReturnValue) == 0x000021, "Member 'BP_NestYahahaSpawner_C_ExecuteUbergraph_BP_NestYahahaSpawner::CallFunc_IsYahaha2SubmittedByID_ReturnValue' has a wrong offset!");

// Function BP_NestYahahaSpawner.BP_NestYahahaSpawner_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_NestYahahaSpawner_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_NestYahahaSpawner_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on BP_NestYahahaSpawner_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(BP_NestYahahaSpawner_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on BP_NestYahahaSpawner_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(BP_NestYahahaSpawner_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'BP_NestYahahaSpawner_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

}

