#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlatformSettingActor

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_PlatformSettingActor.BP_PlatformSettingActor_C.ExecuteUbergraph_BP_PlatformSettingActor
// 0x0038 (0x0038 - 0x0000)
struct BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59D6[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetPlatformName_ReturnValue;              // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchString_CmpSuccess;                    // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPCPlatform_ReturnValue;                 // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsPCPlatform_ReturnValue_1;               // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59D7[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IBlendableInterface>   CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput; // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor) == 0x000008, "Wrong alignment on BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor");
static_assert(sizeof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor) == 0x000038, "Wrong size on BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor");
static_assert(offsetof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor, EntryPoint) == 0x000000, "Member 'BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor, CallFunc_SwitchNetMode_OutNetMode) == 0x000005, "Member 'BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor, CallFunc_GetPlatformName_ReturnValue) == 0x000008, "Member 'BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor::CallFunc_GetPlatformName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor, K2Node_SwitchString_CmpSuccess) == 0x000018, "Member 'BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor::K2Node_SwitchString_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor, CallFunc_IsPCPlatform_ReturnValue) == 0x000019, "Member 'BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor::CallFunc_IsPCPlatform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor, CallFunc_IsPCPlatform_ReturnValue_1) == 0x00001A, "Member 'BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor::CallFunc_IsPCPlatform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor, CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput) == 0x000020, "Member 'BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor::CallFunc_AddOrUpdateBlendable_InBlendableObject_CastInput' has a wrong offset!");
static_assert(offsetof(BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor, CallFunc_IsValid_ReturnValue_1) == 0x000030, "Member 'BP_PlatformSettingActor_C_ExecuteUbergraph_BP_PlatformSettingActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");

}

