#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PKVolumeBase

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PKVolumeBase.BP_PKVolumeBase_C
// 0x0028 (0x0340 - 0x0318)
class ABP_PKVolumeBase_C final : public AHottaPKVolumeActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0318(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 SkeletalMesh;                                      // 0x0320(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                      RangeShape;                                        // 0x0328(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDecalComponent*                        Circl;                                             // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_PKVolumeBase(int32 EntryPoint);
	void ReceiveDestroyed();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PKVolumeBase_C">();
	}
	static class ABP_PKVolumeBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PKVolumeBase_C>();
	}
};
static_assert(alignof(ABP_PKVolumeBase_C) == 0x000008, "Wrong alignment on ABP_PKVolumeBase_C");
static_assert(sizeof(ABP_PKVolumeBase_C) == 0x000340, "Wrong size on ABP_PKVolumeBase_C");
static_assert(offsetof(ABP_PKVolumeBase_C, UberGraphFrame) == 0x000318, "Member 'ABP_PKVolumeBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PKVolumeBase_C, SkeletalMesh) == 0x000320, "Member 'ABP_PKVolumeBase_C::SkeletalMesh' has a wrong offset!");
static_assert(offsetof(ABP_PKVolumeBase_C, RangeShape) == 0x000328, "Member 'ABP_PKVolumeBase_C::RangeShape' has a wrong offset!");
static_assert(offsetof(ABP_PKVolumeBase_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_PKVolumeBase_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PKVolumeBase_C, Circl) == 0x000338, "Member 'ABP_PKVolumeBase_C::Circl' has a wrong offset!");

}

