#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_PlatformSettingActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_PlatformSettingActor.BP_PlatformSettingActor_C
// 0x0050 (0x02B8 - 0x0268)
class ABP_PlatformSettingActor_C final : public APlatformPerformanceManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0268(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ADirectionalLight*                      DirectionalLightActor;                             // 0x0278(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ShadowDistance;                                    // 0x0280(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CSMCount;                                          // 0x0284(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CSMExponent;                                       // 0x0288(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseLSM;                                            // 0x028C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          UseDistanceFieldShadow;                            // 0x028D(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59D4[0x2];                                     // 0x028E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AStaticMeshActor*                       WaterMesh;                                         // 0x0290(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     WaterMat;                                          // 0x0298(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CSMTransitionFraction;                             // 0x02A0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59D5[0x4];                                     // 0x02A4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class APostProcessVolume*                     PostProcessVolume;                                 // 0x02A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInterface*                     MI_SceneEdgeLight;                                 // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_PlatformSettingActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_PlatformSettingActor_C">();
	}
	static class ABP_PlatformSettingActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_PlatformSettingActor_C>();
	}
};
static_assert(alignof(ABP_PlatformSettingActor_C) == 0x000008, "Wrong alignment on ABP_PlatformSettingActor_C");
static_assert(sizeof(ABP_PlatformSettingActor_C) == 0x0002B8, "Wrong size on ABP_PlatformSettingActor_C");
static_assert(offsetof(ABP_PlatformSettingActor_C, UberGraphFrame) == 0x000268, "Member 'ABP_PlatformSettingActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, DefaultSceneRoot) == 0x000270, "Member 'ABP_PlatformSettingActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, DirectionalLightActor) == 0x000278, "Member 'ABP_PlatformSettingActor_C::DirectionalLightActor' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, ShadowDistance) == 0x000280, "Member 'ABP_PlatformSettingActor_C::ShadowDistance' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, CSMCount) == 0x000284, "Member 'ABP_PlatformSettingActor_C::CSMCount' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, CSMExponent) == 0x000288, "Member 'ABP_PlatformSettingActor_C::CSMExponent' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, UseLSM) == 0x00028C, "Member 'ABP_PlatformSettingActor_C::UseLSM' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, UseDistanceFieldShadow) == 0x00028D, "Member 'ABP_PlatformSettingActor_C::UseDistanceFieldShadow' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, WaterMesh) == 0x000290, "Member 'ABP_PlatformSettingActor_C::WaterMesh' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, WaterMat) == 0x000298, "Member 'ABP_PlatformSettingActor_C::WaterMat' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, CSMTransitionFraction) == 0x0002A0, "Member 'ABP_PlatformSettingActor_C::CSMTransitionFraction' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, PostProcessVolume) == 0x0002A8, "Member 'ABP_PlatformSettingActor_C::PostProcessVolume' has a wrong offset!");
static_assert(offsetof(ABP_PlatformSettingActor_C, MI_SceneEdgeLight) == 0x0002B0, "Member 'ABP_PlatformSettingActor_C::MI_SceneEdgeLight' has a wrong offset!");

}

