#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_QRSLCharacterOceanFlowState

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BP_QRSLCharacterOceanFlowState.BP_QRSLCharacterOceanFlowState_C.ExecuteUbergraph_BP_QRSLCharacterOceanFlowState
// 0x00C0 (0x00C0 - 0x0000)
struct BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5536[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable;                                // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_1;                              // 0x0018(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x0028(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_1;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_2;                              // 0x0048(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_2;                            // 0x0058(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_3;                              // 0x0068(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_3;                            // 0x0078(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5537[0x6];                                     // 0x008A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_Player_1;                             // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5538[0x3];                                     // 0x0099(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_Event_Player;                               // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5539[0x2];                                     // 0x00AA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState) == 0x000008, "Wrong alignment on BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState");
static_assert(sizeof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState) == 0x0000C0, "Wrong size on BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, EntryPoint) == 0x000000, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, ___struct_Variable) == 0x000008, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::___struct_Variable' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, ___struct_Variable_1) == 0x000018, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, ___delegate_Variable) == 0x000028, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, ___delegate_Variable_1) == 0x000038, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::___delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, ___struct_Variable_2) == 0x000048, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, ___delegate_Variable_2) == 0x000058, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::___delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, ___struct_Variable_3) == 0x000068, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, ___delegate_Variable_3) == 0x000078, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::___delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, CallFunc_IsValid_ReturnValue) == 0x000088, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, CallFunc_IsValid_ReturnValue_1) == 0x000089, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, K2Node_Event_Player_1) == 0x000090, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::K2Node_Event_Player_1' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, CallFunc_IsValid_ReturnValue_2) == 0x000098, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, CallFunc_PostEvent_ReturnValue) == 0x00009C, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, K2Node_Event_Player) == 0x0000A0, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::K2Node_Event_Player' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, CallFunc_IsValid_ReturnValue_3) == 0x0000A8, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, CallFunc_IsValid_ReturnValue_4) == 0x0000A9, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, CallFunc_PostEvent_ReturnValue_1) == 0x0000AC, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, CallFunc_PostEvent_ReturnValue_2) == 0x0000B0, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, CallFunc_PostEvent_ReturnValue_3) == 0x0000B4, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::CallFunc_PostEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState, CallFunc_IsValid_ReturnValue_5) == 0x0000B8, "Member 'BP_QRSLCharacterOceanFlowState_C_ExecuteUbergraph_BP_QRSLCharacterOceanFlowState::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");

// Function BP_QRSLCharacterOceanFlowState.BP_QRSLCharacterOceanFlowState_C.BPCall_ClientPlayerOutState
// 0x0008 (0x0008 - 0x0000)
struct BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerOutState final
{
public:
	class AHottaPlayerCharacter*                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerOutState) == 0x000008, "Wrong alignment on BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerOutState");
static_assert(sizeof(BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerOutState) == 0x000008, "Wrong size on BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerOutState");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerOutState, Player) == 0x000000, "Member 'BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerOutState::Player' has a wrong offset!");

// Function BP_QRSLCharacterOceanFlowState.BP_QRSLCharacterOceanFlowState_C.BPCall_ClientPlayerEnterState
// 0x0008 (0x0008 - 0x0000)
struct BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerEnterState final
{
public:
	class AHottaPlayerCharacter*                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerEnterState) == 0x000008, "Wrong alignment on BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerEnterState");
static_assert(sizeof(BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerEnterState) == 0x000008, "Wrong size on BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerEnterState");
static_assert(offsetof(BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerEnterState, Player) == 0x000000, "Member 'BP_QRSLCharacterOceanFlowState_C_BPCall_ClientPlayerEnterState::Player' has a wrong offset!");

}

