#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RVT_Land_Material

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_RVT_Land_Material.BP_RVT_Land_Material_C.ExecuteUbergraph_BP_RVT_Land_Material
// 0x0008 (0x0008 - 0x0000)
struct BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDesktop_ReturnValue;                    // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material) == 0x000004, "Wrong alignment on BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material");
static_assert(sizeof(BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material) == 0x000008, "Wrong size on BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material");
static_assert(offsetof(BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material, EntryPoint) == 0x000000, "Member 'BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material, CallFunc_IsDesktop_ReturnValue) == 0x000004, "Member 'BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material::CallFunc_IsDesktop_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material, CallFunc_SwitchNetMode_OutNetMode) == 0x000005, "Member 'BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_RVT_Land_Material_C_ExecuteUbergraph_BP_RVT_Land_Material::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

}

