#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_RemoveGameEffect_NS

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_RemoveGameEffect_NS.BP_RemoveGameEffect_NS_C.Received_NotifyBegin
// 0x0050 (0x0050 - 0x0000)
struct BP_RemoveGameEffect_NS_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5807[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5808[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5809[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_580A[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on BP_RemoveGameEffect_NS_C_Received_NotifyBegin");
static_assert(sizeof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin) == 0x000050, "Wrong size on BP_RemoveGameEffect_NS_C_Received_NotifyBegin");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, ___int_Array_Index_Variable) == 0x000020, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, K2Node_DynamicCast_AsHotta_Character) == 0x000028, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, ___int_Loop_Counter_Variable) == 0x000034, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, CallFunc_Array_Length_ReturnValue) == 0x000040, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, CallFunc_Less_IntInt_ReturnValue) == 0x000044, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_RemoveGameEffect_NS_C_Received_NotifyBegin, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'BP_RemoveGameEffect_NS_C_Received_NotifyBegin::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");

}

