#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SiteTrigger

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_SiteTrigger.BP_SiteTrigger_C
// 0x00A0 (0x0640 - 0x05A0)
class ABP_SiteTrigger_C final : public AHottaVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    SiteTriggerBillboard;                              // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       SphereCollision;                                   // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x05B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class ACameraActor*                           CameraActor;                                       // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   TravePhotoID;                                      // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   PlayerCharacter;                                   // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                TravelPhotosComponent;                             // 0x05D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        ChestParticle;                                     // 0x05E0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                 ChestClass;                                        // 0x05E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                                ChestLocation;                                     // 0x05F0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FRotator                               ChestRotation;                                     // 0x05FC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	float                                         ChestSpawnDelaySeconds;                            // 0x0608(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FName                                   DropID;                                            // 0x060C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                         Pad_6D73[0x4];                                     // 0x0614(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInteractEntry>                 InteractEntries;                                   // 0x0618(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	float                                         CameraFadeInSeconds;                               // 0x0628(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         CameraFadeOutSeconds;                              // 0x062C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          CanTouch;                                          // 0x0630(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D74[0x7];                                     // 0x0631(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerController*                  PlayerController;                                  // 0x0638(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_SiteTrigger(int32 EntryPoint);
	void BPOnMainRoleLoadFinished(class AHottaPlayerCharacter* MainPlayer);
	void BndEvt__BP_SiteTrigger_SilentCheckComponent_K2Node_ComponentBoundEvent_0_UnSilent__DelegateSignature();
	void ReceiveDestroyed();
	void OnFunctionUnlocked(const class FName& FuncID);
	void BPInteractFinished(class AHottaPlayerController* ByPC, int32 InteractIndex);
	void ReceiveBeginPlay();
	void BPGetInteractEntries(class AHottaPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void OnUIClosed();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_SiteTrigger_C">();
	}
	static class ABP_SiteTrigger_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_SiteTrigger_C>();
	}
};
static_assert(alignof(ABP_SiteTrigger_C) == 0x000010, "Wrong alignment on ABP_SiteTrigger_C");
static_assert(sizeof(ABP_SiteTrigger_C) == 0x000640, "Wrong size on ABP_SiteTrigger_C");
static_assert(offsetof(ABP_SiteTrigger_C, UberGraphFrame) == 0x0005A0, "Member 'ABP_SiteTrigger_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, SiteTriggerBillboard) == 0x0005A8, "Member 'ABP_SiteTrigger_C::SiteTriggerBillboard' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, SphereCollision) == 0x0005B0, "Member 'ABP_SiteTrigger_C::SphereCollision' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, ParticleSystem) == 0x0005B8, "Member 'ABP_SiteTrigger_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, CameraActor) == 0x0005C0, "Member 'ABP_SiteTrigger_C::CameraActor' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, TravePhotoID) == 0x0005C8, "Member 'ABP_SiteTrigger_C::TravePhotoID' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, PlayerCharacter) == 0x0005D0, "Member 'ABP_SiteTrigger_C::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, TravelPhotosComponent) == 0x0005D8, "Member 'ABP_SiteTrigger_C::TravelPhotosComponent' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, ChestParticle) == 0x0005E0, "Member 'ABP_SiteTrigger_C::ChestParticle' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, ChestClass) == 0x0005E8, "Member 'ABP_SiteTrigger_C::ChestClass' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, ChestLocation) == 0x0005F0, "Member 'ABP_SiteTrigger_C::ChestLocation' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, ChestRotation) == 0x0005FC, "Member 'ABP_SiteTrigger_C::ChestRotation' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, ChestSpawnDelaySeconds) == 0x000608, "Member 'ABP_SiteTrigger_C::ChestSpawnDelaySeconds' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, DropID) == 0x00060C, "Member 'ABP_SiteTrigger_C::DropID' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, InteractEntries) == 0x000618, "Member 'ABP_SiteTrigger_C::InteractEntries' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, CameraFadeInSeconds) == 0x000628, "Member 'ABP_SiteTrigger_C::CameraFadeInSeconds' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, CameraFadeOutSeconds) == 0x00062C, "Member 'ABP_SiteTrigger_C::CameraFadeOutSeconds' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, CanTouch) == 0x000630, "Member 'ABP_SiteTrigger_C::CanTouch' has a wrong offset!");
static_assert(offsetof(ABP_SiteTrigger_C, PlayerController) == 0x000638, "Member 'ABP_SiteTrigger_C::PlayerController' has a wrong offset!");

}

