#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StormRainEffectActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HottaFramework_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_StormRainEffectActor.BP_StormRainEffectActor_C
// 0x0030 (0x0268 - 0x0238)
class ABP_StormRainEffectActor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         SoundMindelay;                                     // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SoundMaxdelay;                                     // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Thunder_C*                          ThunderActor;                                      // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 LihgtingActor;                                     // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveDestroyed();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_StormRainEffectActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_StormRainEffectActor_C">();
	}
	static class ABP_StormRainEffectActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_StormRainEffectActor_C>();
	}
};
static_assert(alignof(ABP_StormRainEffectActor_C) == 0x000008, "Wrong alignment on ABP_StormRainEffectActor_C");
static_assert(sizeof(ABP_StormRainEffectActor_C) == 0x000268, "Wrong size on ABP_StormRainEffectActor_C");
static_assert(offsetof(ABP_StormRainEffectActor_C, UberGraphFrame) == 0x000238, "Member 'ABP_StormRainEffectActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_StormRainEffectActor_C, ParticleSystem) == 0x000240, "Member 'ABP_StormRainEffectActor_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(ABP_StormRainEffectActor_C, DefaultSceneRoot) == 0x000248, "Member 'ABP_StormRainEffectActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_StormRainEffectActor_C, SoundMindelay) == 0x000250, "Member 'ABP_StormRainEffectActor_C::SoundMindelay' has a wrong offset!");
static_assert(offsetof(ABP_StormRainEffectActor_C, SoundMaxdelay) == 0x000254, "Member 'ABP_StormRainEffectActor_C::SoundMaxdelay' has a wrong offset!");
static_assert(offsetof(ABP_StormRainEffectActor_C, ThunderActor) == 0x000258, "Member 'ABP_StormRainEffectActor_C::ThunderActor' has a wrong offset!");
static_assert(offsetof(ABP_StormRainEffectActor_C, LihgtingActor) == 0x000260, "Member 'ABP_StormRainEffectActor_C::LihgtingActor' has a wrong offset!");

}

