#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SiteTrigger

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_SiteTrigger.BP_SiteTrigger_C.ExecuteUbergraph_BP_SiteTrigger
// 0x0198 (0x0198 - 0x0000)
struct BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D75[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_MakeLiteralText_ReturnValue;              // 0x0008(0x0018)()
	TDelegate<void(class FName& FuncID)>          K2Node_CreateDelegate_OutputDelegate;              // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsCharacterNearScenicSpotActor_ReturnValue; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D76[0x6];                                     // 0x0042(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaGameData*                         CallFunc_GetGameData_ReturnValue;                  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQRSLGameData*                          K2Node_DynamicCast_AsQRSLGame_Data;                // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D77[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerController*                  K2Node_DynamicCast_AsQRSLPlayer_Controller;        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D78[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHottaTravelPhotoData                  CallFunc_BP_GetTravelPhotoData_OutData;            // 0x0078(0x00B0)()
	bool                                          CallFunc_BP_GetTravelPhotoData_ReturnValue;        // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D79[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerController*                 K2Node_Event_ByPC;                                 // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnlyServer_ReturnValue;                 // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7A[0x3];                                     // 0x013D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_FuncID;                         // 0x0148(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnlyClient_ReturnValue;                 // 0x0151(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7B[0x6];                                     // 0x0152(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0160(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSpotPhotoUnlocked_ReturnValue;          // 0x0161(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7C[0x2];                                     // 0x0162(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue_1;            // 0x0164(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D7D[0x4];                                     // 0x016C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsFuncUnlocked_ReturnValue;               // 0x0178(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsFuncUnlocked_ReturnValue_1;             // 0x0179(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSpotPhotoUnlocked_ReturnValue_1;        // 0x017A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7E[0x5];                                     // 0x017B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerController*                  K2Node_DynamicCast_AsQRSLPlayer_Controller_1;      // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0190(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger) == 0x000008, "Wrong alignment on BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger");
static_assert(sizeof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger) == 0x000198, "Wrong size on BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, EntryPoint) == 0x000000, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_MakeLiteralText_ReturnValue) == 0x000008, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_MakeLiteralText_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_CreateDelegate_OutputDelegate) == 0x000020, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000030, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000038, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_IsCharacterNearScenicSpotActor_ReturnValue) == 0x000041, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_IsCharacterNearScenicSpotActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_GetGameData_ReturnValue) == 0x000048, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_GetGameData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_GetController_ReturnValue) == 0x000050, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_DynamicCast_AsQRSLGame_Data) == 0x000058, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_DynamicCast_AsQRSLGame_Data' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_DynamicCast_AsQRSLPlayer_Controller) == 0x000068, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_DynamicCast_AsQRSLPlayer_Controller' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_BP_GetTravelPhotoData_OutData) == 0x000078, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_BP_GetTravelPhotoData_OutData' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_BP_GetTravelPhotoData_ReturnValue) == 0x000128, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_BP_GetTravelPhotoData_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_Event_ByPC) == 0x000130, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_Event_ByPC' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_Event_InteractIndex) == 0x000138, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_Event_InteractIndex' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_IsOnlyServer_ReturnValue) == 0x00013C, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_IsOnlyServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_MakeLiteralName_ReturnValue) == 0x000140, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_CustomEvent_FuncID) == 0x000148, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_CustomEvent_FuncID' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000150, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_IsOnlyClient_ReturnValue) == 0x000151, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_IsOnlyClient_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000158, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_IsValid_ReturnValue) == 0x000160, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_IsSpotPhotoUnlocked_ReturnValue) == 0x000161, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_IsSpotPhotoUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_MakeLiteralName_ReturnValue_1) == 0x000164, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_MakeLiteralName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_Event_MainPlayer) == 0x000170, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_IsFuncUnlocked_ReturnValue) == 0x000178, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_IsFuncUnlocked_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_IsFuncUnlocked_ReturnValue_1) == 0x000179, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_IsFuncUnlocked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_IsSpotPhotoUnlocked_ReturnValue_1) == 0x00017A, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_IsSpotPhotoUnlocked_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, CallFunc_GetPlayerController_ReturnValue) == 0x000180, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_DynamicCast_AsQRSLPlayer_Controller_1) == 0x000188, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_DynamicCast_AsQRSLPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger, K2Node_DynamicCast_bSuccess_3) == 0x000190, "Member 'BP_SiteTrigger_C_ExecuteUbergraph_BP_SiteTrigger::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BP_SiteTrigger.BP_SiteTrigger_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_SiteTrigger_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SiteTrigger_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on BP_SiteTrigger_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(BP_SiteTrigger_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on BP_SiteTrigger_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(BP_SiteTrigger_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'BP_SiteTrigger_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

// Function BP_SiteTrigger.BP_SiteTrigger_C.OnFunctionUnlocked
// 0x0008 (0x0008 - 0x0000)
struct BP_SiteTrigger_C_OnFunctionUnlocked final
{
public:
	class FName                                   FuncID;                                            // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SiteTrigger_C_OnFunctionUnlocked) == 0x000004, "Wrong alignment on BP_SiteTrigger_C_OnFunctionUnlocked");
static_assert(sizeof(BP_SiteTrigger_C_OnFunctionUnlocked) == 0x000008, "Wrong size on BP_SiteTrigger_C_OnFunctionUnlocked");
static_assert(offsetof(BP_SiteTrigger_C_OnFunctionUnlocked, FuncID) == 0x000000, "Member 'BP_SiteTrigger_C_OnFunctionUnlocked::FuncID' has a wrong offset!");

// Function BP_SiteTrigger.BP_SiteTrigger_C.BPInteractFinished
// 0x0010 (0x0010 - 0x0000)
struct BP_SiteTrigger_C_BPInteractFinished final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SiteTrigger_C_BPInteractFinished) == 0x000008, "Wrong alignment on BP_SiteTrigger_C_BPInteractFinished");
static_assert(sizeof(BP_SiteTrigger_C_BPInteractFinished) == 0x000010, "Wrong size on BP_SiteTrigger_C_BPInteractFinished");
static_assert(offsetof(BP_SiteTrigger_C_BPInteractFinished, ByPC) == 0x000000, "Member 'BP_SiteTrigger_C_BPInteractFinished::ByPC' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_BPInteractFinished, InteractIndex) == 0x000008, "Member 'BP_SiteTrigger_C_BPInteractFinished::InteractIndex' has a wrong offset!");

// Function BP_SiteTrigger.BP_SiteTrigger_C.BPGetInteractEntries
// 0x0018 (0x0018 - 0x0000)
struct BP_SiteTrigger_C_BPGetInteractEntries final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 OutInteractEntries;                                // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(BP_SiteTrigger_C_BPGetInteractEntries) == 0x000008, "Wrong alignment on BP_SiteTrigger_C_BPGetInteractEntries");
static_assert(sizeof(BP_SiteTrigger_C_BPGetInteractEntries) == 0x000018, "Wrong size on BP_SiteTrigger_C_BPGetInteractEntries");
static_assert(offsetof(BP_SiteTrigger_C_BPGetInteractEntries, ByPC) == 0x000000, "Member 'BP_SiteTrigger_C_BPGetInteractEntries::ByPC' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_BPGetInteractEntries, OutInteractEntries) == 0x000008, "Member 'BP_SiteTrigger_C_BPGetInteractEntries::OutInteractEntries' has a wrong offset!");

// Function BP_SiteTrigger.BP_SiteTrigger_C.OnUIClosed
// 0x0010 (0x0010 - 0x0000)
struct BP_SiteTrigger_C_OnUIClosed final
{
public:
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SiteTrigger_C_OnUIClosed) == 0x000008, "Wrong alignment on BP_SiteTrigger_C_OnUIClosed");
static_assert(sizeof(BP_SiteTrigger_C_OnUIClosed) == 0x000010, "Wrong size on BP_SiteTrigger_C_OnUIClosed");
static_assert(offsetof(BP_SiteTrigger_C_OnUIClosed, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000000, "Member 'BP_SiteTrigger_C_OnUIClosed::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SiteTrigger_C_OnUIClosed, CallFunc_GetPlayerController_ReturnValue) == 0x000008, "Member 'BP_SiteTrigger_C_OnUIClosed::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");

}

