#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SandWeatherEffectActor

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_SandWeatherEffectActor.BP_SandWeatherEffectActor_C.ExecuteUbergraph_BP_SandWeatherEffectActor
// 0x0038 (0x0038 - 0x0000)
struct BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_1;               // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         CallFunc_GetRenderingMaterialQualityLevel_ReturnValue; // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5975[0x3];                                     // 0x002D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_1; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor) == 0x000008, "Wrong alignment on BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor");
static_assert(sizeof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor) == 0x000038, "Wrong size on BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, EntryPoint) == 0x000000, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000004, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000010, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, CallFunc_SwitchNetMode_OutNetMode) == 0x000018, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, CallFunc_SwitchNetMode_OutNetMode_1) == 0x000019, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::CallFunc_SwitchNetMode_OutNetMode_1' has a wrong offset!");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, K2Node_SwitchEnum_CmpSuccess_1) == 0x00001B, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, CallFunc_GetRenderingMaterialQualityLevel_ReturnValue) == 0x00001C, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::CallFunc_GetRenderingMaterialQualityLevel_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000020, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, CallFunc_NotEqual_IntInt_ReturnValue) == 0x00002C, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor, CallFunc_SpawnAkComponentAtLocation_ReturnValue_1) == 0x000030, "Member 'BP_SandWeatherEffectActor_C_ExecuteUbergraph_BP_SandWeatherEffectActor::CallFunc_SpawnAkComponentAtLocation_ReturnValue_1' has a wrong offset!");

}

