#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_StormRainEffectActor

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AkAudio_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_StormRainEffectActor.BP_StormRainEffectActor_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_StormRainEffectActor_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormRainEffectActor_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_StormRainEffectActor_C_ReceiveTick");
static_assert(sizeof(BP_StormRainEffectActor_C_ReceiveTick) == 0x000004, "Wrong size on BP_StormRainEffectActor_C_ReceiveTick");
static_assert(offsetof(BP_StormRainEffectActor_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_StormRainEffectActor_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_StormRainEffectActor.BP_StormRainEffectActor_C.ExecuteUbergraph_BP_StormRainEffectActor
// 0x0190 (0x0190 - 0x0000)
struct BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_1;               // 0x000E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x000F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59E1[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_1; // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue_2; // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59E2[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInPowerSaving_ReturnValue;              // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0062(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59E3[0x1];                                     // 0x0063(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59E4[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x006C(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	uint8                                         Pad_59E5[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0080(0x0030)(IsPlainOldData, NoDestructor)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59E6[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Thunder_C*                          CallFunc_FinishSpawningActor_ReturnValue;          // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1; // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_ThunderLighting_C*                  CallFunc_FinishSpawningActor_ReturnValue_1;        // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59E7[0x3];                                     // 0x00D9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_2;        // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetActorLocation_SweepHitResult;       // 0x00E8(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_K2_SetActorLocation_ReturnValue;          // 0x0174(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59E8[0x3];                                     // 0x0175(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_K2_GetRootComponent_ReturnValue;          // 0x0178(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0180(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59E9[0x3];                                     // 0x0181(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SpawnAkcomponentAttacked2_OutPlayingID;   // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkcomponentAttacked2_ReturnValue;    // 0x0188(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor) == 0x000010, "Wrong alignment on BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor");
static_assert(sizeof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor) == 0x000190, "Wrong size on BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, EntryPoint) == 0x000000, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_MakeLiteralName_ReturnValue) == 0x000004, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, ___bool_Has_Been_Initd_Variable) == 0x00000C, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_SwitchNetMode_OutNetMode) == 0x00000D, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_SwitchNetMode_OutNetMode_1) == 0x00000E, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_SwitchNetMode_OutNetMode_1' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, K2Node_SwitchEnum_CmpSuccess) == 0x00000F, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, K2Node_SwitchEnum_CmpSuccess_1) == 0x000010, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, K2Node_Event_DeltaSeconds) == 0x000014, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000018, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000024, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000030, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_SpawnAkComponentAtLocation_ReturnValue_1) == 0x000038, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_SpawnAkComponentAtLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_SpawnAkComponentAtLocation_ReturnValue_2) == 0x000040, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_SpawnAkComponentAtLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000048, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_IsValid_ReturnValue) == 0x000050, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000058, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, K2Node_DynamicCast_bSuccess) == 0x000060, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_IsInPowerSaving_ReturnValue) == 0x000061, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_IsInPowerSaving_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_Not_PreBool_ReturnValue) == 0x000062, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_RandomFloatInRange_ReturnValue) == 0x000064, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, ___bool_IsClosed_Variable) == 0x000068, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, ___delegate_Variable) == 0x00006C, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_MakeTransform_ReturnValue) == 0x000080, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000B0, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_IsValid_ReturnValue_1) == 0x0000B8, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000C0, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1) == 0x0000C8, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_FinishSpawningActor_ReturnValue_1) == 0x0000D0, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_FinishSpawningActor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_IsValid_ReturnValue_2) == 0x0000D8, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_K2_GetActorLocation_ReturnValue_2) == 0x0000DC, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_K2_GetActorLocation_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_K2_SetActorLocation_SweepHitResult) == 0x0000E8, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_K2_SetActorLocation_SweepHitResult' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_K2_SetActorLocation_ReturnValue) == 0x000174, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_K2_SetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_K2_GetRootComponent_ReturnValue) == 0x000178, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_K2_GetRootComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_IsValid_ReturnValue_3) == 0x000180, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_SpawnAkcomponentAttacked2_OutPlayingID) == 0x000184, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_SpawnAkcomponentAttacked2_OutPlayingID' has a wrong offset!");
static_assert(offsetof(BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor, CallFunc_SpawnAkcomponentAttacked2_ReturnValue) == 0x000188, "Member 'BP_StormRainEffectActor_C_ExecuteUbergraph_BP_StormRainEffectActor::CallFunc_SpawnAkcomponentAttacked2_ReturnValue' has a wrong offset!");

}

