#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spawner_Minigame_FeedAnimal_NoWalk

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Spawner_Minigame_FeedAnimal_NoWalk.BP_Spawner_Minigame_FeedAnimal_NoWalk_C
// 0x0020 (0x0428 - 0x0408)
class ABP_Spawner_Minigame_FeedAnimal_NoWalk_C final : public AHottaAISpawnManager
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0408(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   YahahaID;                                          // 0x0410(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaVisualSpawnManager*               RewardSpawner;                                     // 0x0418(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPC_FeedAnimal_NotWalk_Base_C*         FeedAnimal_Inst;                                   // 0x0420(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_Spawner_Minigame_FeedAnimal_NoWalk(int32 EntryPoint);
	void OnAICharacterSpawnedEvent_Event_1(class AHottaAICharacter* AICharacter);
	void BndEvt__BP_Spawner_Minigame_FeedAnimal_NoWalk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature(class AHottaVisualSpawnManager* InstigateSpawner);
	void AnimalFindReward_Event_0();
	void OnAICharacterSpawnedEvent_Event_0(class AHottaAICharacter* AICharacter);
	void ReceiveBeginPlay();
	void BPOnMainRoleLoadFinished(class AHottaPlayerCharacter* MainPlayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Spawner_Minigame_FeedAnimal_NoWalk_C">();
	}
	static class ABP_Spawner_Minigame_FeedAnimal_NoWalk_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Spawner_Minigame_FeedAnimal_NoWalk_C>();
	}
};
static_assert(alignof(ABP_Spawner_Minigame_FeedAnimal_NoWalk_C) == 0x000008, "Wrong alignment on ABP_Spawner_Minigame_FeedAnimal_NoWalk_C");
static_assert(sizeof(ABP_Spawner_Minigame_FeedAnimal_NoWalk_C) == 0x000428, "Wrong size on ABP_Spawner_Minigame_FeedAnimal_NoWalk_C");
static_assert(offsetof(ABP_Spawner_Minigame_FeedAnimal_NoWalk_C, UberGraphFrame) == 0x000408, "Member 'ABP_Spawner_Minigame_FeedAnimal_NoWalk_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Spawner_Minigame_FeedAnimal_NoWalk_C, YahahaID) == 0x000410, "Member 'ABP_Spawner_Minigame_FeedAnimal_NoWalk_C::YahahaID' has a wrong offset!");
static_assert(offsetof(ABP_Spawner_Minigame_FeedAnimal_NoWalk_C, RewardSpawner) == 0x000418, "Member 'ABP_Spawner_Minigame_FeedAnimal_NoWalk_C::RewardSpawner' has a wrong offset!");
static_assert(offsetof(ABP_Spawner_Minigame_FeedAnimal_NoWalk_C, FeedAnimal_Inst) == 0x000420, "Member 'ABP_Spawner_Minigame_FeedAnimal_NoWalk_C::FeedAnimal_Inst' has a wrong offset!");

}

