#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SetupTrailComponent

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SetupTrailComponent.BP_SetupTrailComponent_C.Trail
// 0x00F8 (0x00F8 - 0x0000)
struct BP_SetupTrailComponent_C_Trail final
{
public:
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_598E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x003C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_4;                 // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0084(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0094(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_4;                          // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_4;                          // 0x009C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_4;                          // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_5;                 // 0x00A4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_598F[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_5;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_5;                          // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_5;                          // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_6;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_6;                          // 0x00C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_6;                          // 0x00CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_6;                 // 0x00D0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_7;                 // 0x00DC(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_2;            // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_3;            // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_SetupTrailComponent_C_Trail) == 0x000008, "Wrong alignment on BP_SetupTrailComponent_C_Trail");
static_assert(sizeof(BP_SetupTrailComponent_C_Trail) == 0x0000F8, "Wrong size on BP_SetupTrailComponent_C_Trail");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000000, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_X) == 0x00000C, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Y) == 0x000010, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Z) == 0x000014, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_MakeVector_ReturnValue) == 0x000018, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_X_1) == 0x000024, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Y_1) == 0x000028, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Z_1) == 0x00002C, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_X_2) == 0x000030, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_X_2' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Y_2) == 0x000034, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Y_2' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Z_2) == 0x000038, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Z_2' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_MakeVector_ReturnValue_1) == 0x00003C, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_MakeVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_MakeVector_ReturnValue_2) == 0x000048, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_MakeVector_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_MakeVector_ReturnValue_3) == 0x000054, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_MakeVector_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000060, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_X_3) == 0x00006C, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_X_3' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Y_3) == 0x000070, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Y_3' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Z_3) == 0x000074, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Z_3' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_MakeVector_ReturnValue_4) == 0x000078, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_MakeVector_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000084, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_Vector_Distance_ReturnValue) == 0x000094, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_X_4) == 0x000098, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_X_4' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Y_4) == 0x00009C, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Y_4' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Z_4) == 0x0000A0, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Z_4' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_MakeVector_ReturnValue_5) == 0x0000A4, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_MakeVector_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000B0, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_Vector_Distance_ReturnValue_1) == 0x0000B4, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_Vector_Distance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_X_5) == 0x0000B8, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_X_5' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Y_5) == 0x0000BC, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Y_5' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Z_5) == 0x0000C0, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Z_5' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_X_6) == 0x0000C4, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_X_6' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Y_6) == 0x0000C8, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Y_6' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_BreakVector_Z_6) == 0x0000CC, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_BreakVector_Z_6' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_MakeVector_ReturnValue_6) == 0x0000D0, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_MakeVector_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_MakeVector_ReturnValue_7) == 0x0000DC, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_MakeVector_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_Vector_Distance_ReturnValue_2) == 0x0000E8, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_Vector_Distance_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_Vector_Distance_ReturnValue_3) == 0x0000EC, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_Vector_Distance_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000F0, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_Greater_FloatFloat_ReturnValue) == 0x0000F1, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail, CallFunc_Greater_FloatFloat_ReturnValue_1) == 0x0000F2, "Member 'BP_SetupTrailComponent_C_Trail::CallFunc_Greater_FloatFloat_ReturnValue_1' has a wrong offset!");

// Function BP_SetupTrailComponent.BP_SetupTrailComponent_C.Trail Start Set
// 0x0120 (0x0120 - 0x0000)
struct BP_SetupTrailComponent_C_Trail_Start_Set final
{
public:
	class USceneComponent*                        MeshComponent;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class USceneComponent*>                CallFunc_GetChildrenComponents_Children;           // 0x0010(0x0010)(ReferenceParm, ContainsInstancedReference)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5990[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USceneComponent*                        CallFunc_Array_Get_Item;                           // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TrailComponent_C*                   K2Node_DynamicCast_AsBP_Trail_Component;           // 0x0040(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5991[0x3];                                     // 0x0049(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x004C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x005C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5992[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FString>                         K2Node_MakeArray_Array;                            // 0x0070(0x0010)(ConstParm, ReferenceParm)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Array_Contains_ReturnValue;               // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5993[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5994[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue;          // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue_1;        // 0x00A8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue;         // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_1;       // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5995[0x6];                                     // 0x00B2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue_2;        // 0x00B8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue_3;        // 0x00C0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_2;       // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_3;       // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5996[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue_4;        // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue_5;        // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_4;       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_AttachToComponent_ReturnValue_5;       // 0x00E1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5997[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue_6;        // 0x00E8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x00F1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_2;          // 0x00F2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_3;          // 0x00F3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5998[0x4];                                     // 0x00F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue_7;        // 0x00F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UBP_TrailComponent_C*                   CallFunc_AddComponentByClass_ReturnValue_8;        // 0x0100(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0108(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0114(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SetupTrailComponent_C_Trail_Start_Set) == 0x000008, "Wrong alignment on BP_SetupTrailComponent_C_Trail_Start_Set");
static_assert(sizeof(BP_SetupTrailComponent_C_Trail_Start_Set) == 0x000120, "Wrong size on BP_SetupTrailComponent_C_Trail_Start_Set");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, MeshComponent) == 0x000000, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::MeshComponent' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_GetChildrenComponents_Children) == 0x000010, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_GetChildrenComponents_Children' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_Array_Length_ReturnValue) == 0x00002C, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, ___int_Array_Index_Variable) == 0x000030, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_Array_Get_Item) == 0x000038, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, K2Node_DynamicCast_AsBP_Trail_Component) == 0x000040, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::K2Node_DynamicCast_AsBP_Trail_Component' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x00004C, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x00005C, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, K2Node_MakeArray_Array) == 0x000070, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000080, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, ___int_Loop_Counter_Variable) == 0x000090, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_Array_Contains_ReturnValue) == 0x000094, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_Array_Contains_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_Less_IntInt_ReturnValue) == 0x000095, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_Add_IntInt_ReturnValue) == 0x000098, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_AddComponentByClass_ReturnValue) == 0x0000A0, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_AddComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_AddComponentByClass_ReturnValue_1) == 0x0000A8, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_AddComponentByClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_K2_AttachToComponent_ReturnValue) == 0x0000B0, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_K2_AttachToComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_K2_AttachToComponent_ReturnValue_1) == 0x0000B1, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_K2_AttachToComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_AddComponentByClass_ReturnValue_2) == 0x0000B8, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_AddComponentByClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_AddComponentByClass_ReturnValue_3) == 0x0000C0, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_AddComponentByClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_K2_AttachToComponent_ReturnValue_2) == 0x0000C8, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_K2_AttachToComponent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_K2_AttachToComponent_ReturnValue_3) == 0x0000C9, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_K2_AttachToComponent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_AddComponentByClass_ReturnValue_4) == 0x0000D0, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_AddComponentByClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_AddComponentByClass_ReturnValue_5) == 0x0000D8, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_AddComponentByClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_K2_AttachToComponent_ReturnValue_4) == 0x0000E0, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_K2_AttachToComponent_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_K2_AttachToComponent_ReturnValue_5) == 0x0000E1, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_K2_AttachToComponent_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_AddComponentByClass_ReturnValue_6) == 0x0000E8, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_AddComponentByClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000F0, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x0000F1, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_EqualEqual_IntInt_ReturnValue_2) == 0x0000F2, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_EqualEqual_IntInt_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_EqualEqual_IntInt_ReturnValue_3) == 0x0000F3, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_EqualEqual_IntInt_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_AddComponentByClass_ReturnValue_7) == 0x0000F8, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_AddComponentByClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_AddComponentByClass_ReturnValue_8) == 0x000100, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_AddComponentByClass_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_MakeVector_ReturnValue) == 0x000108, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_Trail_Start_Set, CallFunc_Add_VectorVector_ReturnValue) == 0x000114, "Member 'BP_SetupTrailComponent_C_Trail_Start_Set::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");

// Function BP_SetupTrailComponent.BP_SetupTrailComponent_C.SetBlendNormal
// 0x0090 (0x0090 - 0x0000)
struct BP_SetupTrailComponent_C_SetBlendNormal final
{
public:
	float                                         DeltaTime;                                         // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_1;                 // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_2;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_2;                          // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_2;                          // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_3;                          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_3;                          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_3;                          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_2;                 // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue_3;                 // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0078(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Vector_Distance_ReturnValue_1;            // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x0081(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5999[0x2];                                     // 0x0082(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SetupTrailComponent_C_SetBlendNormal) == 0x000004, "Wrong alignment on BP_SetupTrailComponent_C_SetBlendNormal");
static_assert(sizeof(BP_SetupTrailComponent_C_SetBlendNormal) == 0x000090, "Wrong size on BP_SetupTrailComponent_C_SetBlendNormal");
static_assert(offsetof(BP_SetupTrailComponent_C_SetBlendNormal, DeltaTime) == 0x000000, "Member 'BP_SetupTrailComponent_C_SetBlendNormal::DeltaTime' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_SetBlendNormal, CallFunc_BreakVector_X) == 0x000004, "Member 'BP_SetupTrailComponent_C_SetBlendNormal::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SetupTrailComponent_C_SetBlendNormal, CallFunc_BreakVector_Y) == 0x000008, "Member 'BP_SetupTrailComponent_C_SetBlendNormal::CallFunc_BreakVector_Y' has a wrong offset!");
