#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Simple_DisplayFog

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function BP_Simple_DisplayFog.BP_Simple_DisplayFog_C.ExecuteUbergraph_BP_Simple_DisplayFog
// 0x000C (0x000C - 0x0000)
struct BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsSM5_ReturnValue;                        // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaPlatformType                            CallFunc_SwitchPlatform_OutPlatformType;           // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog) == 0x000004, "Wrong alignment on BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog");
static_assert(sizeof(BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog) == 0x00000C, "Wrong size on BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog");
static_assert(offsetof(BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog, EntryPoint) == 0x000000, "Member 'BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog, CallFunc_IsSM5_ReturnValue) == 0x000004, "Member 'BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog::CallFunc_IsSM5_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog, CallFunc_SwitchPlatform_OutPlatformType) == 0x000005, "Member 'BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog::CallFunc_SwitchPlatform_OutPlatformType' has a wrong offset!");
static_assert(offsetof(BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog, K2Node_SwitchEnum_CmpSuccess) == 0x000006, "Member 'BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog, CallFunc_SwitchNetMode_OutNetMode) == 0x000007, "Member 'BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog, K2Node_SwitchEnum_CmpSuccess_1) == 0x000008, "Member 'BP_Simple_DisplayFog_C_ExecuteUbergraph_BP_Simple_DisplayFog::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

}

