#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Simple_DisplayFog

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Simple_DisplayFog.BP_Simple_DisplayFog_C
// 0x0028 (0x0260 - 0x0238)
class ABP_Simple_DisplayFog_C final : public AEditorEventActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   FogPrimitive;                                      // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         GridSizeZ;                                         // 0x0250(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         GridPixelSize;                                     // 0x0254(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         DepthDistributionScale;                            // 0x0258(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void WhenFeatureLevelChanged();
	void ExecuteUbergraph_BP_Simple_DisplayFog(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Simple_DisplayFog_C">();
	}
	static class ABP_Simple_DisplayFog_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Simple_DisplayFog_C>();
	}
};
static_assert(alignof(ABP_Simple_DisplayFog_C) == 0x000008, "Wrong alignment on ABP_Simple_DisplayFog_C");
static_assert(sizeof(ABP_Simple_DisplayFog_C) == 0x000260, "Wrong size on ABP_Simple_DisplayFog_C");
static_assert(offsetof(ABP_Simple_DisplayFog_C, UberGraphFrame) == 0x000238, "Member 'ABP_Simple_DisplayFog_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Simple_DisplayFog_C, FogPrimitive) == 0x000240, "Member 'ABP_Simple_DisplayFog_C::FogPrimitive' has a wrong offset!");
static_assert(offsetof(ABP_Simple_DisplayFog_C, DefaultSceneRoot) == 0x000248, "Member 'ABP_Simple_DisplayFog_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_Simple_DisplayFog_C, GridSizeZ) == 0x000250, "Member 'ABP_Simple_DisplayFog_C::GridSizeZ' has a wrong offset!");
static_assert(offsetof(ABP_Simple_DisplayFog_C, GridPixelSize) == 0x000254, "Member 'ABP_Simple_DisplayFog_C::GridPixelSize' has a wrong offset!");
static_assert(offsetof(ABP_Simple_DisplayFog_C, DepthDistributionScale) == 0x000258, "Member 'ABP_Simple_DisplayFog_C::DepthDistributionScale' has a wrong offset!");

}

