#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spawner_Minigame_InteractAnimal

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Spawner_Minigame_InteractAnimal.BP_Spawner_Minigame_InteractAnimal_C.ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal
// 0x00A0 (0x00A0 - 0x0000)
struct BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHottaAICharacter* AICharacter)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AHottaAICharacter* AICharacter)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_57B9[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue;       // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57BA[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaAICharacter*                      K2Node_CustomEvent_AICharacter_1;                  // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPC_InteractAnimal_Base_C*             K2Node_DynamicCast_AsNPC_Interact_Animal_Base;     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57BB[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaVisualSpawnManager*               K2Node_ComponentBoundEvent_InstigateSpawner;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57BC[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaAICharacter*                      K2Node_CustomEvent_AICharacter;                    // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ANPC_InteractAnimal_Base_C*             K2Node_DynamicCast_AsNPC_Interact_Animal_Base_1;   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal) == 0x000008, "Wrong alignment on BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal");
static_assert(sizeof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal) == 0x0000A0, "Wrong size on BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, EntryPoint) == 0x000000, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_Event_MainPlayer) == 0x000038, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000040, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_DynamicCast_bSuccess) == 0x000048, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, CallFunc_IsYahaha2SubmittedByID_ReturnValue) == 0x000049, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::CallFunc_IsYahaha2SubmittedByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_CustomEvent_AICharacter_1) == 0x000050, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_CustomEvent_AICharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_DynamicCast_AsNPC_Interact_Animal_Base) == 0x000058, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_DynamicCast_AsNPC_Interact_Animal_Base' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_ComponentBoundEvent_InstigateSpawner) == 0x000068, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_ComponentBoundEvent_InstigateSpawner' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000070, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000078, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_DynamicCast_bSuccess_2) == 0x000080, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_CustomEvent_AICharacter) == 0x000088, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_CustomEvent_AICharacter' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_DynamicCast_AsNPC_Interact_Animal_Base_1) == 0x000090, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_DynamicCast_AsNPC_Interact_Animal_Base_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal, K2Node_DynamicCast_bSuccess_3) == 0x000098, "Member 'BP_Spawner_Minigame_InteractAnimal_C_ExecuteUbergraph_BP_Spawner_Minigame_InteractAnimal::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");

// Function BP_Spawner_Minigame_InteractAnimal.BP_Spawner_Minigame_InteractAnimal_C.OnAICharacterSpawnedEvent_Event_1
// 0x0008 (0x0008 - 0x0000)
struct BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_1 final
{
public:
	class AHottaAICharacter*                      AICharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_1) == 0x000008, "Wrong alignment on BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_1");
static_assert(sizeof(BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_1) == 0x000008, "Wrong size on BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_1");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_1, AICharacter) == 0x000000, "Member 'BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_1::AICharacter' has a wrong offset!");

// Function BP_Spawner_Minigame_InteractAnimal.BP_Spawner_Minigame_InteractAnimal_C.BndEvt__BP_Spawner_Minigame_FeedAnimal_NoWalk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Spawner_Minigame_InteractAnimal_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_NoWalk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature final
{
public:
	class AHottaVisualSpawnManager*               InstigateSpawner;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_Minigame_InteractAnimal_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_NoWalk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Spawner_Minigame_InteractAnimal_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_NoWalk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(sizeof(BP_Spawner_Minigame_InteractAnimal_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_NoWalk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Spawner_Minigame_InteractAnimal_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_NoWalk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_NoWalk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature, InstigateSpawner) == 0x000000, "Member 'BP_Spawner_Minigame_InteractAnimal_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_NoWalk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature::InstigateSpawner' has a wrong offset!");

// Function BP_Spawner_Minigame_InteractAnimal.BP_Spawner_Minigame_InteractAnimal_C.OnAICharacterSpawnedEvent_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_0 final
{
public:
	class AHottaAICharacter*                      AICharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_0) == 0x000008, "Wrong alignment on BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_0");
static_assert(sizeof(BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_0) == 0x000008, "Wrong size on BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_0");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_0, AICharacter) == 0x000000, "Member 'BP_Spawner_Minigame_InteractAnimal_C_OnAICharacterSpawnedEvent_Event_0::AICharacter' has a wrong offset!");

// Function BP_Spawner_Minigame_InteractAnimal.BP_Spawner_Minigame_InteractAnimal_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_Spawner_Minigame_InteractAnimal_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_Minigame_InteractAnimal_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on BP_Spawner_Minigame_InteractAnimal_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(BP_Spawner_Minigame_InteractAnimal_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on BP_Spawner_Minigame_InteractAnimal_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(BP_Spawner_Minigame_InteractAnimal_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'BP_Spawner_Minigame_InteractAnimal_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

}

