#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Spawner_Minigame_Scanner_Base

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_Spawner_Minigame_Scanner_Base.BP_Spawner_Minigame_Scanner_Base_C.ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base
// 0x0148 (0x0148 - 0x0000)
struct BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AHottaAICharacter* AICharacter)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AHottaAICharacter* AICharacter)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_5566[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5567[0x6];                                     // 0x003A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5568[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue;               // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaAICharacter*                      K2Node_CustomEvent_AICharacter_1;                  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5569[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AScanner_jellyfish_C*                   K2Node_DynamicCast_AsScanner_Jellyfish;            // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_556A[0x7];                                     // 0x0079(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_1;             // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AScanner_honeybee_C*                    K2Node_DynamicCast_AsScanner_Honeybee;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_556B[0x6];                                     // 0x0092(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_2;             // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_3;             // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_3;      // 0x00A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_556C[0x6];                                     // 0x00AA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AScanner_Base_C*                        K2Node_DynamicCast_AsScanner_Base;                 // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_556D[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaVisualSpawnManager*               K2Node_ComponentBoundEvent_InstigateSpawner;       // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_4;             // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_4;      // 0x00D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_556E[0x7];                                     // 0x00D1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_5;             // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_5;      // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_556F[0x7];                                     // 0x00E1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaAICharacter*                      K2Node_CustomEvent_AICharacter;                    // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AScanner_jellyfish_C*                   K2Node_DynamicCast_AsScanner_Jellyfish_1;          // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5570[0x7];                                     // 0x00F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_6;             // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_6;      // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5571[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AScanner_honeybee_C*                    K2Node_DynamicCast_AsScanner_Honeybee_1;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5572[0x7];                                     // 0x0119(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_7;             // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 CallFunc_GetObjectClass_ReturnValue_8;             // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_7;      // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ClassClass_ReturnValue_8;      // 0x0131(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5573[0x6];                                     // 0x0132(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AScanner_Base_C*                        K2Node_DynamicCast_AsScanner_Base_1;               // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base) == 0x000008, "Wrong alignment on BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base");
static_assert(sizeof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base) == 0x000148, "Wrong size on BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, EntryPoint) == 0x000000, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_Event_MainPlayer) == 0x000028, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000030, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_IsYahaha2SubmittedByID_ReturnValue) == 0x000039, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_IsYahaha2SubmittedByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000040, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000048, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_bSuccess_1) == 0x000050, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_GetObjectClass_ReturnValue) == 0x000058, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_GetObjectClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_CustomEvent_AICharacter_1) == 0x000060, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_CustomEvent_AICharacter_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_EqualEqual_ClassClass_ReturnValue) == 0x000068, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_EqualEqual_ClassClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_AsScanner_Jellyfish) == 0x000070, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_AsScanner_Jellyfish' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_bSuccess_2) == 0x000078, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_GetObjectClass_ReturnValue_1) == 0x000080, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_GetObjectClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_AsScanner_Honeybee) == 0x000088, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_AsScanner_Honeybee' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_bSuccess_3) == 0x000090, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_EqualEqual_ClassClass_ReturnValue_1) == 0x000091, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_EqualEqual_ClassClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_GetObjectClass_ReturnValue_2) == 0x000098, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_GetObjectClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_GetObjectClass_ReturnValue_3) == 0x0000A0, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_GetObjectClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_EqualEqual_ClassClass_ReturnValue_2) == 0x0000A8, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_EqualEqual_ClassClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_EqualEqual_ClassClass_ReturnValue_3) == 0x0000A9, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_EqualEqual_ClassClass_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_AsScanner_Base) == 0x0000B0, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_AsScanner_Base' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_bSuccess_4) == 0x0000B8, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_ComponentBoundEvent_InstigateSpawner) == 0x0000C0, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_ComponentBoundEvent_InstigateSpawner' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_GetObjectClass_ReturnValue_4) == 0x0000C8, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_GetObjectClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_EqualEqual_ClassClass_ReturnValue_4) == 0x0000D0, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_EqualEqual_ClassClass_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_GetObjectClass_ReturnValue_5) == 0x0000D8, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_GetObjectClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_EqualEqual_ClassClass_ReturnValue_5) == 0x0000E0, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_EqualEqual_ClassClass_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_CustomEvent_AICharacter) == 0x0000E8, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_CustomEvent_AICharacter' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_AsScanner_Jellyfish_1) == 0x0000F0, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_AsScanner_Jellyfish_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_bSuccess_5) == 0x0000F8, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_GetObjectClass_ReturnValue_6) == 0x000100, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_GetObjectClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_EqualEqual_ClassClass_ReturnValue_6) == 0x000108, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_EqualEqual_ClassClass_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_AsScanner_Honeybee_1) == 0x000110, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_AsScanner_Honeybee_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_bSuccess_6) == 0x000118, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_GetObjectClass_ReturnValue_7) == 0x000120, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_GetObjectClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_GetObjectClass_ReturnValue_8) == 0x000128, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_GetObjectClass_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_EqualEqual_ClassClass_ReturnValue_7) == 0x000130, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_EqualEqual_ClassClass_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, CallFunc_EqualEqual_ClassClass_ReturnValue_8) == 0x000131, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::CallFunc_EqualEqual_ClassClass_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_AsScanner_Base_1) == 0x000138, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_AsScanner_Base_1' has a wrong offset!");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base, K2Node_DynamicCast_bSuccess_7) == 0x000140, "Member 'BP_Spawner_Minigame_Scanner_Base_C_ExecuteUbergraph_BP_Spawner_Minigame_Scanner_Base::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");

// Function BP_Spawner_Minigame_Scanner_Base.BP_Spawner_Minigame_Scanner_Base_C.OnAICharacterSpawnedEvent_Event_1
// 0x0008 (0x0008 - 0x0000)
struct BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_1 final
{
public:
	class AHottaAICharacter*                      AICharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_1) == 0x000008, "Wrong alignment on BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_1");
static_assert(sizeof(BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_1) == 0x000008, "Wrong size on BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_1");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_1, AICharacter) == 0x000000, "Member 'BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_1::AICharacter' has a wrong offset!");

// Function BP_Spawner_Minigame_Scanner_Base.BP_Spawner_Minigame_Scanner_Base_C.BndEvt__BP_Spawner_Minigame_FeedAnimal_Walk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct BP_Spawner_Minigame_Scanner_Base_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_Walk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature final
{
public:
	class AHottaVisualSpawnManager*               InstigateSpawner;                                  // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_Minigame_Scanner_Base_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_Walk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong alignment on BP_Spawner_Minigame_Scanner_Base_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_Walk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(sizeof(BP_Spawner_Minigame_Scanner_Base_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_Walk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature) == 0x000008, "Wrong size on BP_Spawner_Minigame_Scanner_Base_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_Walk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_Walk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature, InstigateSpawner) == 0x000000, "Member 'BP_Spawner_Minigame_Scanner_Base_C_BndEvt__BP_Spawner_Minigame_FeedAnimal_Walk_RewardSpawner_K2Node_ComponentBoundEvent_0_AllVisualsHarvestedSignature__DelegateSignature::InstigateSpawner' has a wrong offset!");

// Function BP_Spawner_Minigame_Scanner_Base.BP_Spawner_Minigame_Scanner_Base_C.OnAICharacterSpawnedEvent_Event_0
// 0x0008 (0x0008 - 0x0000)
struct BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_0 final
{
public:
	class AHottaAICharacter*                      AICharacter;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_0) == 0x000008, "Wrong alignment on BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_0");
static_assert(sizeof(BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_0) == 0x000008, "Wrong size on BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_0");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_0, AICharacter) == 0x000000, "Member 'BP_Spawner_Minigame_Scanner_Base_C_OnAICharacterSpawnedEvent_Event_0::AICharacter' has a wrong offset!");

// Function BP_Spawner_Minigame_Scanner_Base.BP_Spawner_Minigame_Scanner_Base_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct BP_Spawner_Minigame_Scanner_Base_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_Spawner_Minigame_Scanner_Base_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on BP_Spawner_Minigame_Scanner_Base_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(BP_Spawner_Minigame_Scanner_Base_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on BP_Spawner_Minigame_Scanner_Base_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(BP_Spawner_Minigame_Scanner_Base_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'BP_Spawner_Minigame_Scanner_Base_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

}

