#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_SandComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_SandComponent.BP_SandComponent_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_SandComponent_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SandComponent_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_SandComponent_C_ReceiveTick");
static_assert(sizeof(BP_SandComponent_C_ReceiveTick) == 0x000004, "Wrong size on BP_SandComponent_C_ReceiveTick");
static_assert(offsetof(BP_SandComponent_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_SandComponent_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_SandComponent.BP_SandComponent_C.ExecuteUbergraph_BP_SandComponent
// 0x01D0 (0x01D0 - 0x0000)
struct BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571D[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class ABP_TrailsManager_C*>            CallFunc_GetAllActorsOfClass_OutActors;            // 0x0008(0x0010)(ReferenceParm)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_571E[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_TrailsManager_C*                    CallFunc_Array_Get_Item;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_571F[0x1];                                     // 0x002F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentScale_ReturnValue;         // 0x0040(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5720[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakVector_X;                            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0080(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5721[0x7];                                     // 0x0099(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         ___object_Variable;                                // 0x00A0(0x0010)(ConstParm, ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5722[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             CallFunc_SphereTraceSingleForObjects_OutHit;       // 0x00B4(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_SphereTraceSingleForObjects_ReturnValue;  // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5723[0x1];                                     // 0x0143(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0144(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0148(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0158(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0164(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x0170(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5724[0x4];                                     // 0x017C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x01A4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x01A8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x01B4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x01C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x01C4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5725[0x3];                                     // 0x01C5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent) == 0x000008, "Wrong alignment on BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent");
static_assert(sizeof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent) == 0x0001D0, "Wrong size on BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, EntryPoint) == 0x000000, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_GetAllActorsOfClass_OutActors) == 0x000008, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, K2Node_Event_DeltaSeconds) == 0x000018, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_Array_Get_Item) == 0x000020, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_Array_Length_ReturnValue) == 0x000028, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_Less_IntInt_ReturnValue) == 0x00002C, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_Greater_IntInt_ReturnValue) == 0x00002D, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BooleanOR_ReturnValue) == 0x00002E, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, K2Node_MakeArray_Array) == 0x000030, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_K2_GetComponentScale_ReturnValue) == 0x000040, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_K2_GetComponentScale_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_IsValid_ReturnValue) == 0x00004C, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakVector_X) == 0x000050, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakVector_Y) == 0x000054, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakVector_Z) == 0x000058, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00005C, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000060, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000064, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_MakeVector_ReturnValue) == 0x000070, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x00007C, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000080, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_Add_VectorVector_ReturnValue) == 0x00008C, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_IsDedicatedServer_ReturnValue) == 0x000098, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, ___object_Variable) == 0x0000A0, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::___object_Variable' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000B0, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_SphereTraceSingleForObjects_OutHit) == 0x0000B4, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_SphereTraceSingleForObjects_OutHit' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_SphereTraceSingleForObjects_ReturnValue) == 0x000140, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_SphereTraceSingleForObjects_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_bBlockingHit) == 0x000141, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_bInitialOverlap) == 0x000142, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_Time) == 0x000144, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_Distance) == 0x000148, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_Location) == 0x00014C, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_ImpactPoint) == 0x000158, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_Normal) == 0x000164, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_ImpactNormal) == 0x000170, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_PhysMat) == 0x000180, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_HitActor) == 0x000188, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_HitComponent) == 0x000190, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_HitBoneName) == 0x000198, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_HitItem) == 0x0001A0, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_FaceIndex) == 0x0001A4, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_TraceStart) == 0x0001A8, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_BreakHitResult_TraceEnd) == 0x0001B4, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x0001C0, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_ActorHasTag_ReturnValue) == 0x0001C4, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent, CallFunc_FMax_ReturnValue) == 0x0001C8, "Member 'BP_SandComponent_C_ExecuteUbergraph_BP_SandComponent::CallFunc_FMax_ReturnValue' has a wrong offset!");

}

