#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrailComponent

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_TrailComponent.BP_TrailComponent_C
// 0x0060 (0x0270 - 0x0210)
class UBP_TrailComponent_C final : public USceneComponent
{
public:
	uint8                                         Pad_6C26[0x8];                                     // 0x0208(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0210(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_TrailsManager_C*                    TrailManagerInstance;                              // 0x0218(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Hardness;                                          // 0x0220(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReceivingActorsTag;                                // 0x0224(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C27[0x4];                                     // 0x022C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             Spawn_Transform;                                   // 0x0230(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                         DrawDistance;                                      // 0x0260(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                HistoryLocation;                                   // 0x0264(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_TrailComponent(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_TrailComponent_C">();
	}
	static class UBP_TrailComponent_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_TrailComponent_C>();
	}
};
static_assert(alignof(UBP_TrailComponent_C) == 0x000010, "Wrong alignment on UBP_TrailComponent_C");
static_assert(sizeof(UBP_TrailComponent_C) == 0x000270, "Wrong size on UBP_TrailComponent_C");
static_assert(offsetof(UBP_TrailComponent_C, UberGraphFrame) == 0x000210, "Member 'UBP_TrailComponent_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, TrailManagerInstance) == 0x000218, "Member 'UBP_TrailComponent_C::TrailManagerInstance' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, Hardness) == 0x000220, "Member 'UBP_TrailComponent_C::Hardness' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, ReceivingActorsTag) == 0x000224, "Member 'UBP_TrailComponent_C::ReceivingActorsTag' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, Spawn_Transform) == 0x000230, "Member 'UBP_TrailComponent_C::Spawn_Transform' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, DrawDistance) == 0x000260, "Member 'UBP_TrailComponent_C::DrawDistance' has a wrong offset!");
static_assert(offsetof(UBP_TrailComponent_C, HistoryLocation) == 0x000264, "Member 'UBP_TrailComponent_C::HistoryLocation' has a wrong offset!");

}

