#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThunderLighting

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BP_ThunderLighting.BP_ThunderLighting_C.ExecuteUbergraph_BP_ThunderLighting
// 0x003C (0x003C - 0x0000)
struct BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_FirstRun;                         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59F0[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_Data;                             // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_MultiGate_ScratchBool;                      // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59F1[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_MultiGate_ScratchIndex;                     // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_MakeColor_ReturnValue;                    // 0x001C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x002C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting) == 0x000004, "Wrong alignment on BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting");
static_assert(sizeof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting) == 0x00003C, "Wrong size on BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting");
static_assert(offsetof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting, EntryPoint) == 0x000000, "Member 'BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting, K2Node_MultiGate_FirstRun) == 0x000004, "Member 'BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting::K2Node_MultiGate_FirstRun' has a wrong offset!");
static_assert(offsetof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting, K2Node_MultiGate_Data) == 0x000008, "Member 'BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting::K2Node_MultiGate_Data' has a wrong offset!");
static_assert(offsetof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting, K2Node_MultiGate_ScratchBool) == 0x00000C, "Member 'BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting::K2Node_MultiGate_ScratchBool' has a wrong offset!");
static_assert(offsetof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting, K2Node_MultiGate_ScratchIndex) == 0x000010, "Member 'BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting::K2Node_MultiGate_ScratchIndex' has a wrong offset!");
static_assert(offsetof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000014, "Member 'BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting, CallFunc_Add_FloatFloat_ReturnValue) == 0x000018, "Member 'BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting, CallFunc_MakeColor_ReturnValue) == 0x00001C, "Member 'BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting::CallFunc_MakeColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting, K2Node_MakeStruct_LinearColor) == 0x00002C, "Member 'BP_ThunderLighting_C_ExecuteUbergraph_BP_ThunderLighting::K2Node_MakeStruct_LinearColor' has a wrong offset!");

}

