#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ToonLightControllActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_ToonLightControllActor.BP_ToonLightControllActor_C.UserConstructionScript
// 0x0010 (0x0010 - 0x0000)
struct BP_ToonLightControllActor_C_UserConstructionScript final
{
public:
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_ToonLightControllActor_C_UserConstructionScript) == 0x000008, "Wrong alignment on BP_ToonLightControllActor_C_UserConstructionScript");
static_assert(sizeof(BP_ToonLightControllActor_C_UserConstructionScript) == 0x000010, "Wrong size on BP_ToonLightControllActor_C_UserConstructionScript");
static_assert(offsetof(BP_ToonLightControllActor_C_UserConstructionScript, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000000, "Member 'BP_ToonLightControllActor_C_UserConstructionScript::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_ToonLightControllActor_C_UserConstructionScript, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_ToonLightControllActor_C_UserConstructionScript::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function BP_ToonLightControllActor.BP_ToonLightControllActor_C.ExecuteUbergraph_BP_ToonLightControllActor
// 0x0004 (0x0004 - 0x0000)
struct BP_ToonLightControllActor_C_ExecuteUbergraph_BP_ToonLightControllActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_ToonLightControllActor_C_ExecuteUbergraph_BP_ToonLightControllActor) == 0x000004, "Wrong alignment on BP_ToonLightControllActor_C_ExecuteUbergraph_BP_ToonLightControllActor");
static_assert(sizeof(BP_ToonLightControllActor_C_ExecuteUbergraph_BP_ToonLightControllActor) == 0x000004, "Wrong size on BP_ToonLightControllActor_C_ExecuteUbergraph_BP_ToonLightControllActor");
static_assert(offsetof(BP_ToonLightControllActor_C_ExecuteUbergraph_BP_ToonLightControllActor, EntryPoint) == 0x000000, "Member 'BP_ToonLightControllActor_C_ExecuteUbergraph_BP_ToonLightControllActor::EntryPoint' has a wrong offset!");

}

