#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_ThunderLighting

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_ThunderLighting.BP_ThunderLighting_C
// 0x0080 (0x02B8 - 0x0238)
class ABP_ThunderLighting_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Short5_IntensityScale_66EACE654DBABA5E15C763AC991FAA14; // 0x0248(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Short5__Direction_66EACE654DBABA5E15C763AC991FAA14; // 0x024C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59EA[0x3];                                     // 0x024D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Short5;                                            // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Short3_IntensityScale_6A716DB84AF763E882F1DBACAB731729; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Short3__Direction_6A716DB84AF763E882F1DBACAB731729; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59EB[0x3];                                     // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Short3;                                            // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Short2_IntensityScale_ED85D31C4C328585A93ACB8AC5CA2585; // 0x0268(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Short2__Direction_ED85D31C4C328585A93ACB8AC5CA2585; // 0x026C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59EC[0x3];                                     // 0x026D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Short2;                                            // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Short1_IntensityScale_18C2CADB4B08495A21F34596C5ADDF52; // 0x0278(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Short1__Direction_18C2CADB4B08495A21F34596C5ADDF52; // 0x027C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59ED[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Short1;                                            // 0x0280(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Long_IntensityScale_5755219C4A45427EFCD9939BCC5C5087; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Long__Direction_5755219C4A45427EFCD9939BCC5C5087;  // 0x028C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59EE[0x3];                                     // 0x028D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Long;                                              // 0x0290(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanThunder;                                        // 0x0298(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59EF[0x3];                                     // 0x0299(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BrightScale;                                       // 0x029C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           DefaultSkyLightColor;                              // 0x02A0(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DefaultIntensity;                                  // 0x02B0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         IntensityScale;                                    // 0x02B4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Short1__FinishedFunc();
	void Short1__UpdateFunc();
	void Short2__FinishedFunc();
	void Short2__UpdateFunc();
	void Short3__FinishedFunc();
	void Short3__UpdateFunc();
	void Long__FinishedFunc();
	void Long__UpdateFunc();
	void Short5__FinishedFunc();
	void Short5__UpdateFunc();
	void ThunderLighting();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_BP_ThunderLighting(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_ThunderLighting_C">();
	}
	static class ABP_ThunderLighting_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_ThunderLighting_C>();
	}
};
static_assert(alignof(ABP_ThunderLighting_C) == 0x000008, "Wrong alignment on ABP_ThunderLighting_C");
static_assert(sizeof(ABP_ThunderLighting_C) == 0x0002B8, "Wrong size on ABP_ThunderLighting_C");
static_assert(offsetof(ABP_ThunderLighting_C, UberGraphFrame) == 0x000238, "Member 'ABP_ThunderLighting_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, DefaultSceneRoot) == 0x000240, "Member 'ABP_ThunderLighting_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short5_IntensityScale_66EACE654DBABA5E15C763AC991FAA14) == 0x000248, "Member 'ABP_ThunderLighting_C::Short5_IntensityScale_66EACE654DBABA5E15C763AC991FAA14' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short5__Direction_66EACE654DBABA5E15C763AC991FAA14) == 0x00024C, "Member 'ABP_ThunderLighting_C::Short5__Direction_66EACE654DBABA5E15C763AC991FAA14' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short5) == 0x000250, "Member 'ABP_ThunderLighting_C::Short5' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short3_IntensityScale_6A716DB84AF763E882F1DBACAB731729) == 0x000258, "Member 'ABP_ThunderLighting_C::Short3_IntensityScale_6A716DB84AF763E882F1DBACAB731729' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short3__Direction_6A716DB84AF763E882F1DBACAB731729) == 0x00025C, "Member 'ABP_ThunderLighting_C::Short3__Direction_6A716DB84AF763E882F1DBACAB731729' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short3) == 0x000260, "Member 'ABP_ThunderLighting_C::Short3' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short2_IntensityScale_ED85D31C4C328585A93ACB8AC5CA2585) == 0x000268, "Member 'ABP_ThunderLighting_C::Short2_IntensityScale_ED85D31C4C328585A93ACB8AC5CA2585' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short2__Direction_ED85D31C4C328585A93ACB8AC5CA2585) == 0x00026C, "Member 'ABP_ThunderLighting_C::Short2__Direction_ED85D31C4C328585A93ACB8AC5CA2585' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short2) == 0x000270, "Member 'ABP_ThunderLighting_C::Short2' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short1_IntensityScale_18C2CADB4B08495A21F34596C5ADDF52) == 0x000278, "Member 'ABP_ThunderLighting_C::Short1_IntensityScale_18C2CADB4B08495A21F34596C5ADDF52' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short1__Direction_18C2CADB4B08495A21F34596C5ADDF52) == 0x00027C, "Member 'ABP_ThunderLighting_C::Short1__Direction_18C2CADB4B08495A21F34596C5ADDF52' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Short1) == 0x000280, "Member 'ABP_ThunderLighting_C::Short1' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Long_IntensityScale_5755219C4A45427EFCD9939BCC5C5087) == 0x000288, "Member 'ABP_ThunderLighting_C::Long_IntensityScale_5755219C4A45427EFCD9939BCC5C5087' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Long__Direction_5755219C4A45427EFCD9939BCC5C5087) == 0x00028C, "Member 'ABP_ThunderLighting_C::Long__Direction_5755219C4A45427EFCD9939BCC5C5087' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, Long) == 0x000290, "Member 'ABP_ThunderLighting_C::Long' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, CanThunder) == 0x000298, "Member 'ABP_ThunderLighting_C::CanThunder' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, BrightScale) == 0x00029C, "Member 'ABP_ThunderLighting_C::BrightScale' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, DefaultSkyLightColor) == 0x0002A0, "Member 'ABP_ThunderLighting_C::DefaultSkyLightColor' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, DefaultIntensity) == 0x0002B0, "Member 'ABP_ThunderLighting_C::DefaultIntensity' has a wrong offset!");
static_assert(offsetof(ABP_ThunderLighting_C, IntensityScale) == 0x0002B4, "Member 'ABP_ThunderLighting_C::IntensityScale' has a wrong offset!");

}

