#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_Thunder

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_Thunder.BP_Thunder_C
// 0x0110 (0x0348 - 0x0238)
class ABP_Thunder_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        Scene;                                             // 0x0240(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          TargetBoxExtend;                                   // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          SourceBoxExtend;                                   // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lightning_01;                                   // 0x0258(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lightning_00;                                   // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lightning_03;                                   // 0x0268(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                   SM_Lightning_02;                                   // 0x0270(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                    Billboard;                                         // 0x0278(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_BoltBrightnessScale_33285F334D4C5D9CCD3E558ECEA71322; // 0x0280(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_BranchOutProgress_33285F334D4C5D9CCD3E558ECEA71322; // 0x0284(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_BranchInProgress_33285F334D4C5D9CCD3E558ECEA71322; // 0x0288(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_BoltProgress_33285F334D4C5D9CCD3E558ECEA71322; // 0x028C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_33285F334D4C5D9CCD3E558ECEA71322; // 0x0290(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_550E[0x7];                                     // 0x0291(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UStaticMeshComponent*>           Meshes;                                            // 0x02A0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class UMaterialInstanceDynamic*               LightingMID;                                       // 0x02B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         LighningSpeed;                                     // 0x02B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_550F[0x4];                                     // 0x02BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UStaticMeshComponent*                   CurrentMesh;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             FlashEvent;                                        // 0x02C8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                         LightningBrightness;                               // 0x02D8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CanLighting;                                       // 0x02DC(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5510[0x3];                                     // 0x02DD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTimerHandle                           TimeHandle;                                        // 0x02E0(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class USoundCue*>                      ThunderSound;                                      // 0x02E8(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          Sound;                                             // 0x02F8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5511[0x7];                                     // 0x02F9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class USoundBase*                             SoundRef;                                          // 0x0300(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SoundScale;                                        // 0x0308(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5512[0x4];                                     // 0x030C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class UAudioComponent*>                SoundArray;                                        // 0x0310(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class ABP_ThunderLighting_C*                  ThunderLighting;                                   // 0x0320(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BoltThicknessScale;                                // 0x0328(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BranchThicknessScale;                              // 0x032C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                SourcePos;                                         // 0x0330(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                TargetPos;                                         // 0x033C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void PlaySound_(class UAudioComponent* InputPin);
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void Timeline_0__FlashEvent__EventFunc();
	void _ResetMaterialParameters();
	void _AimTarget(class UMeshComponent* Mesh);
	void StartLThunder();
	void ReceiveTick(float DeltaSeconds);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void PlaySound();
	void StopSound();
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ExecuteUbergraph_BP_Thunder(int32 EntryPoint);
	void FlashEvent__DelegateSignature();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_Thunder_C">();
	}
	static class ABP_Thunder_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_Thunder_C>();
	}
};
static_assert(alignof(ABP_Thunder_C) == 0x000008, "Wrong alignment on ABP_Thunder_C");
static_assert(sizeof(ABP_Thunder_C) == 0x000348, "Wrong size on ABP_Thunder_C");
static_assert(offsetof(ABP_Thunder_C, UberGraphFrame) == 0x000238, "Member 'ABP_Thunder_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Scene) == 0x000240, "Member 'ABP_Thunder_C::Scene' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, TargetBoxExtend) == 0x000248, "Member 'ABP_Thunder_C::TargetBoxExtend' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, SourceBoxExtend) == 0x000250, "Member 'ABP_Thunder_C::SourceBoxExtend' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, SM_Lightning_01) == 0x000258, "Member 'ABP_Thunder_C::SM_Lightning_01' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, SM_Lightning_00) == 0x000260, "Member 'ABP_Thunder_C::SM_Lightning_00' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, SM_Lightning_03) == 0x000268, "Member 'ABP_Thunder_C::SM_Lightning_03' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, SM_Lightning_02) == 0x000270, "Member 'ABP_Thunder_C::SM_Lightning_02' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Billboard) == 0x000278, "Member 'ABP_Thunder_C::Billboard' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Timeline_0_BoltBrightnessScale_33285F334D4C5D9CCD3E558ECEA71322) == 0x000280, "Member 'ABP_Thunder_C::Timeline_0_BoltBrightnessScale_33285F334D4C5D9CCD3E558ECEA71322' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Timeline_0_BranchOutProgress_33285F334D4C5D9CCD3E558ECEA71322) == 0x000284, "Member 'ABP_Thunder_C::Timeline_0_BranchOutProgress_33285F334D4C5D9CCD3E558ECEA71322' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Timeline_0_BranchInProgress_33285F334D4C5D9CCD3E558ECEA71322) == 0x000288, "Member 'ABP_Thunder_C::Timeline_0_BranchInProgress_33285F334D4C5D9CCD3E558ECEA71322' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Timeline_0_BoltProgress_33285F334D4C5D9CCD3E558ECEA71322) == 0x00028C, "Member 'ABP_Thunder_C::Timeline_0_BoltProgress_33285F334D4C5D9CCD3E558ECEA71322' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Timeline_0__Direction_33285F334D4C5D9CCD3E558ECEA71322) == 0x000290, "Member 'ABP_Thunder_C::Timeline_0__Direction_33285F334D4C5D9CCD3E558ECEA71322' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Timeline_0) == 0x000298, "Member 'ABP_Thunder_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Meshes) == 0x0002A0, "Member 'ABP_Thunder_C::Meshes' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, LightingMID) == 0x0002B0, "Member 'ABP_Thunder_C::LightingMID' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, LighningSpeed) == 0x0002B8, "Member 'ABP_Thunder_C::LighningSpeed' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, CurrentMesh) == 0x0002C0, "Member 'ABP_Thunder_C::CurrentMesh' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, FlashEvent) == 0x0002C8, "Member 'ABP_Thunder_C::FlashEvent' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, LightningBrightness) == 0x0002D8, "Member 'ABP_Thunder_C::LightningBrightness' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, CanLighting) == 0x0002DC, "Member 'ABP_Thunder_C::CanLighting' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, TimeHandle) == 0x0002E0, "Member 'ABP_Thunder_C::TimeHandle' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, ThunderSound) == 0x0002E8, "Member 'ABP_Thunder_C::ThunderSound' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, Sound) == 0x0002F8, "Member 'ABP_Thunder_C::Sound' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, SoundRef) == 0x000300, "Member 'ABP_Thunder_C::SoundRef' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, SoundScale) == 0x000308, "Member 'ABP_Thunder_C::SoundScale' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, SoundArray) == 0x000310, "Member 'ABP_Thunder_C::SoundArray' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, ThunderLighting) == 0x000320, "Member 'ABP_Thunder_C::ThunderLighting' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, BoltThicknessScale) == 0x000328, "Member 'ABP_Thunder_C::BoltThicknessScale' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, BranchThicknessScale) == 0x00032C, "Member 'ABP_Thunder_C::BranchThicknessScale' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, SourcePos) == 0x000330, "Member 'ABP_Thunder_C::SourcePos' has a wrong offset!");
static_assert(offsetof(ABP_Thunder_C, TargetPos) == 0x00033C, "Member 'ABP_Thunder_C::TargetPos' has a wrong offset!");

}

