#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_TrailsManager

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_TrailsManager.BP_TrailsManager_C.Initialize
// 0x0090 (0x0090 - 0x0000)
struct BP_TrailsManager_C_Initialize final
{
public:
	class UObject*                                CallFunc_LoadObjectByPath_ReturnValue;             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_573B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_As______2D;                     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_573C[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                CallFunc_LoadObjectByPath_ReturnValue_1;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_573D[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_DynamicCast_As______2D_1;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsDesktopRender_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_573E[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_573F[0x2];                                     // 0x004E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5740[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_1; // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5741[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue;         // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTextureRenderTarget2D*                 CallFunc_CreateRenderTarget2D_ReturnValue_1;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue_2; // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_Initialize) == 0x000008, "Wrong alignment on BP_TrailsManager_C_Initialize");
static_assert(sizeof(BP_TrailsManager_C_Initialize) == 0x000090, "Wrong size on BP_TrailsManager_C_Initialize");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_LoadObjectByPath_ReturnValue) == 0x000000, "Member 'BP_TrailsManager_C_Initialize::CallFunc_LoadObjectByPath_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'BP_TrailsManager_C_Initialize::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, K2Node_DynamicCast_As______2D) == 0x000010, "Member 'BP_TrailsManager_C_Initialize::K2Node_DynamicCast_As______2D' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'BP_TrailsManager_C_Initialize::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_LoadObjectByPath_ReturnValue_1) == 0x000020, "Member 'BP_TrailsManager_C_Initialize::CallFunc_LoadObjectByPath_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'BP_TrailsManager_C_Initialize::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, K2Node_DynamicCast_As______2D_1) == 0x000030, "Member 'BP_TrailsManager_C_Initialize::K2Node_DynamicCast_As______2D_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'BP_TrailsManager_C_Initialize::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_IsDesktopRender_ReturnValue) == 0x000039, "Member 'BP_TrailsManager_C_Initialize::CallFunc_IsDesktopRender_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_FMax_ReturnValue) == 0x00003C, "Member 'BP_TrailsManager_C_Initialize::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000040, "Member 'BP_TrailsManager_C_Initialize::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000044, "Member 'BP_TrailsManager_C_Initialize::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000048, "Member 'BP_TrailsManager_C_Initialize::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_IsValid_ReturnValue_2) == 0x00004C, "Member 'BP_TrailsManager_C_Initialize::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_IsValid_ReturnValue_3) == 0x00004D, "Member 'BP_TrailsManager_C_Initialize::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000050, "Member 'BP_TrailsManager_C_Initialize::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000058, "Member 'BP_TrailsManager_C_Initialize::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_CreateDynamicMaterialInstance_ReturnValue_1) == 0x000060, "Member 'BP_TrailsManager_C_Initialize::CallFunc_CreateDynamicMaterialInstance_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000068, "Member 'BP_TrailsManager_C_Initialize::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_CreateRenderTarget2D_ReturnValue) == 0x000070, "Member 'BP_TrailsManager_C_Initialize::CallFunc_CreateRenderTarget2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_CreateRenderTarget2D_ReturnValue_1) == 0x000078, "Member 'BP_TrailsManager_C_Initialize::CallFunc_CreateRenderTarget2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_Conv_IntToFloat_ReturnValue) == 0x000080, "Member 'BP_TrailsManager_C_Initialize::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_Divide_FloatFloat_ReturnValue_2) == 0x000084, "Member 'BP_TrailsManager_C_Initialize::CallFunc_Divide_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_Initialize, CallFunc_CreateDynamicMaterialInstance_ReturnValue_2) == 0x000088, "Member 'BP_TrailsManager_C_Initialize::CallFunc_CreateDynamicMaterialInstance_ReturnValue_2' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.CalculateLocation
// 0x0048 (0x0048 - 0x0000)
struct BP_TrailsManager_C_CalculateLocation final
{
public:
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0008(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0014(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FIntVector                             CallFunc_FTruncVector_ReturnValue;                 // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Conv_IntVectorToVector_ReturnValue;       // 0x002C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Multiply_VectorFloat_ReturnValue;         // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_CalculateLocation) == 0x000008, "Wrong alignment on BP_TrailsManager_C_CalculateLocation");
static_assert(sizeof(BP_TrailsManager_C_CalculateLocation) == 0x000048, "Wrong size on BP_TrailsManager_C_CalculateLocation");
static_assert(offsetof(BP_TrailsManager_C_CalculateLocation, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000000, "Member 'BP_TrailsManager_C_CalculateLocation::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_CalculateLocation, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000008, "Member 'BP_TrailsManager_C_CalculateLocation::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_CalculateLocation, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000014, "Member 'BP_TrailsManager_C_CalculateLocation::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_CalculateLocation, CallFunc_FTruncVector_ReturnValue) == 0x000020, "Member 'BP_TrailsManager_C_CalculateLocation::CallFunc_FTruncVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_CalculateLocation, CallFunc_Conv_IntVectorToVector_ReturnValue) == 0x00002C, "Member 'BP_TrailsManager_C_CalculateLocation::CallFunc_Conv_IntVectorToVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_CalculateLocation, CallFunc_Multiply_VectorFloat_ReturnValue) == 0x000038, "Member 'BP_TrailsManager_C_CalculateLocation::CallFunc_Multiply_VectorFloat_ReturnValue' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.RenderTrails
// 0x0090 (0x0090 - 0x0000)
struct BP_TrailsManager_C_RenderTrails final
{
public:
	int32                                         ___int_Array_Index_Variable;                       // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Array_Get_Item;                           // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0014(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0038(0x0010)(NoDestructor)
	float                                         CallFunc_Array_Get_Item_1;                         // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_2;                         // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Array_Get_Item_3;                         // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DFloat_ReturnValue;       // 0x005C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue;    // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Array_Get_Item_4;                         // 0x006C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5742[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_Multiply_Vector2DVector2D_ReturnValue_1;  // 0x0084(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_RenderTrails) == 0x000008, "Wrong alignment on BP_TrailsManager_C_RenderTrails");
static_assert(sizeof(BP_TrailsManager_C_RenderTrails) == 0x000090, "Wrong size on BP_TrailsManager_C_RenderTrails");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, ___int_Array_Index_Variable) == 0x000000, "Member 'BP_TrailsManager_C_RenderTrails::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Array_Get_Item) == 0x000004, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, ___int_Loop_Counter_Variable) == 0x000010, "Member 'BP_TrailsManager_C_RenderTrails::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000014, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Add_IntInt_ReturnValue) == 0x000024, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000028, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000030, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000038, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Array_Get_Item_1) == 0x000048, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Array_Get_Item_2) == 0x00004C, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Array_Get_Item_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_MakeVector2D_ReturnValue) == 0x000050, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Array_Get_Item_3) == 0x000058, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Array_Get_Item_3' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Multiply_Vector2DFloat_ReturnValue) == 0x00005C, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Multiply_Vector2DFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Multiply_Vector2DVector2D_ReturnValue) == 0x000064, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Multiply_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Array_Get_Item_4) == 0x00006C, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Array_Get_Item_4' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Array_Length_ReturnValue) == 0x000074, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x000078, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Less_IntInt_ReturnValue) == 0x000080, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RenderTrails, CallFunc_Multiply_Vector2DVector2D_ReturnValue_1) == 0x000084, "Member 'BP_TrailsManager_C_RenderTrails::CallFunc_Multiply_Vector2DVector2D_ReturnValue_1' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.RegisterTrail
// 0x00F0 (0x00F0 - 0x0000)
struct BP_TrailsManager_C_RegisterTrail final
{
public:
	struct FVector                                Location;                                          // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Radius;                                            // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Depth;                                             // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Hardness;                                          // 0x0014(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         DynamicIntensity;                                  // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ColorChannel;                                      // 0x001C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Sqrt_ReturnValue;                         // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5743[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0084(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5744[0x3];                                     // 0x0085(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue_1;      // 0x0094(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x00A0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x00AC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x00B8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue;                          // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Conv_VectorToVector2D_ReturnValue;        // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Abs_ReturnValue_1;                        // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FMax_ReturnValue;                         // 0x00D4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x00D8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_2;                  // 0x00DC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5745[0x3];                                     // 0x00E1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Add_ReturnValue_3;                  // 0x00E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Add_ReturnValue_4;                  // 0x00E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_RegisterTrail) == 0x000008, "Wrong alignment on BP_TrailsManager_C_RegisterTrail");
static_assert(sizeof(BP_TrailsManager_C_RegisterTrail) == 0x0000F0, "Wrong size on BP_TrailsManager_C_RegisterTrail");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, Location) == 0x000000, "Member 'BP_TrailsManager_C_RegisterTrail::Location' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, Radius) == 0x00000C, "Member 'BP_TrailsManager_C_RegisterTrail::Radius' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, Depth) == 0x000010, "Member 'BP_TrailsManager_C_RegisterTrail::Depth' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, Hardness) == 0x000014, "Member 'BP_TrailsManager_C_RegisterTrail::Hardness' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, DynamicIntensity) == 0x000018, "Member 'BP_TrailsManager_C_RegisterTrail::DynamicIntensity' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, ColorChannel) == 0x00001C, "Member 'BP_TrailsManager_C_RegisterTrail::ColorChannel' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000028, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Array_Add_ReturnValue) == 0x00002C, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000030, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x000034, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x000038, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x000040, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Sqrt_ReturnValue) == 0x000044, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Sqrt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000048, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_BreakVector_X) == 0x000054, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_BreakVector_Y) == 0x000058, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_BreakVector_Z) == 0x00005C, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_MakeVector_ReturnValue) == 0x000060, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Array_Add_ReturnValue_1) == 0x00006C, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Array_Add_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x000070, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000078, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Divide_FloatFloat_ReturnValue_1) == 0x000080, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Divide_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_IsValid_ReturnValue) == 0x000084, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000088, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Subtract_VectorVector_ReturnValue_1) == 0x000094, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Subtract_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Divide_VectorFloat_ReturnValue) == 0x0000A0, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_BreakVector_X_1) == 0x0000AC, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_BreakVector_Y_1) == 0x0000B0, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_BreakVector_Z_1) == 0x0000B4, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Add_VectorVector_ReturnValue) == 0x0000B8, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Abs_ReturnValue) == 0x0000C4, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Abs_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Conv_VectorToVector2D_ReturnValue) == 0x0000C8, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Conv_VectorToVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Abs_ReturnValue_1) == 0x0000D0, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Abs_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_FMax_ReturnValue) == 0x0000D4, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_FMax_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0000D8, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Array_Add_ReturnValue_2) == 0x0000DC, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Array_Add_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Less_FloatFloat_ReturnValue) == 0x0000E0, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Array_Add_ReturnValue_3) == 0x0000E4, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Array_Add_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_RegisterTrail, CallFunc_Array_Add_ReturnValue_4) == 0x0000E8, "Member 'BP_TrailsManager_C_RegisterTrail::CallFunc_Array_Add_ReturnValue_4' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct BP_TrailsManager_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_ReceiveTick) == 0x000004, "Wrong alignment on BP_TrailsManager_C_ReceiveTick");
static_assert(sizeof(BP_TrailsManager_C_ReceiveTick) == 0x000004, "Wrong size on BP_TrailsManager_C_ReceiveTick");
static_assert(offsetof(BP_TrailsManager_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'BP_TrailsManager_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.ReceiveEndPlay
// 0x0001 (0x0001 - 0x0000)
struct BP_TrailsManager_C_ReceiveEndPlay final
{
public:
	EEndPlayReason                                EndPlayReason;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_TrailsManager_C_ReceiveEndPlay) == 0x000001, "Wrong alignment on BP_TrailsManager_C_ReceiveEndPlay");
static_assert(sizeof(BP_TrailsManager_C_ReceiveEndPlay) == 0x000001, "Wrong size on BP_TrailsManager_C_ReceiveEndPlay");
static_assert(offsetof(BP_TrailsManager_C_ReceiveEndPlay, EndPlayReason) == 0x000000, "Member 'BP_TrailsManager_C_ReceiveEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_TrailsManager.BP_TrailsManager_C.ExecuteUbergraph_BP_TrailsManager
// 0x0158 (0x0158 - 0x0000)
struct BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context;    // 0x0020(0x0010)(NoDestructor)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue;              // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEndPlayReason                                K2Node_Event_EndPlayReason;                        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5746[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvas*                                CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1;   // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_BeginDrawCanvasToRenderTarget_Size_1;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDrawToRenderTargetContext             CallFunc_BeginDrawCanvasToRenderTarget_Context_1;  // 0x0048(0x0010)(NoDestructor)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue;     // 0x0074(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Divide_VectorFloat_ReturnValue;           // 0x0084(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_1;   // 0x0090(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x00A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue;            // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5747[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x00A8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_1;          // 0x00AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5748[0x3];                                     // 0x00AD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x00B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_1;                     // 0x00BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_2;        // 0x00C0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_FClamp_ReturnValue_2;                     // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class ALandscape*>                     CallFunc_GetAllActorsOfClass_OutActors;            // 0x00C8(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsDedicatedServer_ReturnValue_2;          // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5749[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ALandscape*                             CallFunc_Array_Get_Item;                           // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_Origin;                    // 0x00E8(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetActorBounds_BoxExtent;                 // 0x00F4(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0100(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0104(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0108(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_574A[0x3];                                     // 0x0111(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FMax_ReturnValue;                         // 0x0114(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                           CallFunc_Conv_VectorToLinearColor_ReturnValue_2;   // 0x011C(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_574B[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0130(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_ColorToString_ReturnValue;           // 0x0140(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0150(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_IntInt_ReturnValue_1;            // 0x0154(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager) == 0x000008, "Wrong alignment on BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager");
static_assert(sizeof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager) == 0x000158, "Wrong size on BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, EntryPoint) == 0x000000, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, ___int_Array_Index_Variable) == 0x000004, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, K2Node_Event_DeltaSeconds) == 0x000008, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Length_ReturnValue) == 0x00000C, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BeginDrawCanvasToRenderTarget_Canvas) == 0x000010, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BeginDrawCanvasToRenderTarget_Canvas' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BeginDrawCanvasToRenderTarget_Size) == 0x000018, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BeginDrawCanvasToRenderTarget_Size' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BeginDrawCanvasToRenderTarget_Context) == 0x000020, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BeginDrawCanvasToRenderTarget_Context' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_NotEqual_IntInt_ReturnValue) == 0x000030, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_NotEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, K2Node_Event_EndPlayReason) == 0x000031, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::K2Node_Event_EndPlayReason' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1) == 0x000038, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BeginDrawCanvasToRenderTarget_Canvas_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BeginDrawCanvasToRenderTarget_Size_1) == 0x000040, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BeginDrawCanvasToRenderTarget_Size_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BeginDrawCanvasToRenderTarget_Context_1) == 0x000048, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BeginDrawCanvasToRenderTarget_Context_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000058, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000060, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_FClamp_ReturnValue) == 0x000064, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_FClamp_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000068, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Conv_VectorToLinearColor_ReturnValue) == 0x000074, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Conv_VectorToLinearColor_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Divide_VectorFloat_ReturnValue) == 0x000084, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Divide_VectorFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Conv_VectorToLinearColor_ReturnValue_1) == 0x000090, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Conv_VectorToLinearColor_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, ___int_Loop_Counter_Variable) == 0x0000A0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_IsDedicatedServer_ReturnValue) == 0x0000A4, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_IsDedicatedServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Add_IntInt_ReturnValue) == 0x0000A8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_IsDedicatedServer_ReturnValue_1) == 0x0000AC, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_IsDedicatedServer_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Multiply_FloatFloat_ReturnValue_2) == 0x0000B0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Multiply_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Subtract_FloatFloat_ReturnValue_1) == 0x0000B4, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Subtract_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Multiply_FloatFloat_ReturnValue_3) == 0x0000B8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Multiply_FloatFloat_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_FClamp_ReturnValue_1) == 0x0000BC, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_FClamp_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Subtract_FloatFloat_ReturnValue_2) == 0x0000C0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Subtract_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_FClamp_ReturnValue_2) == 0x0000C4, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_FClamp_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_GetAllActorsOfClass_OutActors) == 0x0000C8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_IsDedicatedServer_ReturnValue_2) == 0x0000D8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_IsDedicatedServer_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Get_Item) == 0x0000E0, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_GetActorBounds_Origin) == 0x0000E8, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_GetActorBounds_Origin' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_GetActorBounds_BoxExtent) == 0x0000F4, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_GetActorBounds_BoxExtent' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Array_Length_ReturnValue_1) == 0x000100, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BreakVector_X) == 0x000104, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BreakVector_Y) == 0x000108, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_BreakVector_Z) == 0x00010C, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_Less_IntInt_ReturnValue) == 0x000110, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager, CallFunc_FMax_ReturnValue) == 0x000114, "Member 'BP_TrailsManager_C_ExecuteUbergraph_BP_TrailsManager::CallFunc_FMax_ReturnValue' has a wrong offset!");
