#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIMapFog

#include "Basic.hpp"


namespace SDK::Params
{

// Function BP_UIMapFog.BP_UIMapFog_C.UpdateMaterial
// 0x0018 (0x0018 - 0x0000)
struct BP_UIMapFog_C_UpdateMaterial final
{
public:
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_592E[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetFogMaterialForUMG_ReturnValue;         // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMapFog_C_UpdateMaterial) == 0x000008, "Wrong alignment on BP_UIMapFog_C_UpdateMaterial");
static_assert(sizeof(BP_UIMapFog_C_UpdateMaterial) == 0x000018, "Wrong size on BP_UIMapFog_C_UpdateMaterial");
static_assert(offsetof(BP_UIMapFog_C_UpdateMaterial, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x000000, "Member 'BP_UIMapFog_C_UpdateMaterial::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapFog_C_UpdateMaterial, CallFunc_IsValid_ReturnValue) == 0x000004, "Member 'BP_UIMapFog_C_UpdateMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapFog_C_UpdateMaterial, CallFunc_GetFogMaterialForUMG_ReturnValue) == 0x000008, "Member 'BP_UIMapFog_C_UpdateMaterial::CallFunc_GetFogMaterialForUMG_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapFog_C_UpdateMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000010, "Member 'BP_UIMapFog_C_UpdateMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_UIMapFog.BP_UIMapFog_C.ExecuteUbergraph_BP_UIMapFog
// 0x0004 (0x0004 - 0x0000)
struct BP_UIMapFog_C_ExecuteUbergraph_BP_UIMapFog final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMapFog_C_ExecuteUbergraph_BP_UIMapFog) == 0x000004, "Wrong alignment on BP_UIMapFog_C_ExecuteUbergraph_BP_UIMapFog");
static_assert(sizeof(BP_UIMapFog_C_ExecuteUbergraph_BP_UIMapFog) == 0x000004, "Wrong size on BP_UIMapFog_C_ExecuteUbergraph_BP_UIMapFog");
static_assert(offsetof(BP_UIMapFog_C_ExecuteUbergraph_BP_UIMapFog, EntryPoint) == 0x000000, "Member 'BP_UIMapFog_C_ExecuteUbergraph_BP_UIMapFog::EntryPoint' has a wrong offset!");

}

