#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIStaminaExpireTime

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UIStaminaExpireTime.BP_UIStaminaExpireTime_C
// 0x0038 (0x05B0 - 0x0578)
class UBP_UIStaminaExpireTime_C final : public UQRSL_UserWidgetBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0578(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_374;                                         // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextExpireTime;                                    // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FName                                   StaminaItemId;                                     // 0x0590(0x0008)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RemindDaysThreshold;                               // 0x0598(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55DE[0x4];                                     // 0x059C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              ImmediatelyExpireTime;                             // 0x05A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           RemoveSelfTH;                                      // 0x05A8(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void StopRefresh();
	void DetermineRefresh(class UHottaItem* Item);
	void RefreshExpireTime();
	void OnInitialized();
	void Destruct();
	void OnTimerExpireTime();
	void OnUpdateItemInventory(class UHottaInventoryComponent* InventoryComponent, int32 Param_Slot, int32 ItemType, EItemUpdateType ItemUpdateType, const struct FVarList& UpdateParams);
	void OnRemoveItemInventory(class UHottaInventoryComponent* InventoryComponent, int32 Param_Slot, class UHottaItem* HTItem, int32 ItemType);
	void RemoveNextTick();
	void ExecuteUbergraph_BP_UIStaminaExpireTime(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UIStaminaExpireTime_C">();
	}
	static class UBP_UIStaminaExpireTime_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UIStaminaExpireTime_C>();
	}
};
static_assert(alignof(UBP_UIStaminaExpireTime_C) == 0x000008, "Wrong alignment on UBP_UIStaminaExpireTime_C");
static_assert(sizeof(UBP_UIStaminaExpireTime_C) == 0x0005B0, "Wrong size on UBP_UIStaminaExpireTime_C");
static_assert(offsetof(UBP_UIStaminaExpireTime_C, UberGraphFrame) == 0x000578, "Member 'UBP_UIStaminaExpireTime_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UIStaminaExpireTime_C, Image_374) == 0x000580, "Member 'UBP_UIStaminaExpireTime_C::Image_374' has a wrong offset!");
static_assert(offsetof(UBP_UIStaminaExpireTime_C, TextExpireTime) == 0x000588, "Member 'UBP_UIStaminaExpireTime_C::TextExpireTime' has a wrong offset!");
static_assert(offsetof(UBP_UIStaminaExpireTime_C, StaminaItemId) == 0x000590, "Member 'UBP_UIStaminaExpireTime_C::StaminaItemId' has a wrong offset!");
static_assert(offsetof(UBP_UIStaminaExpireTime_C, RemindDaysThreshold) == 0x000598, "Member 'UBP_UIStaminaExpireTime_C::RemindDaysThreshold' has a wrong offset!");
static_assert(offsetof(UBP_UIStaminaExpireTime_C, ImmediatelyExpireTime) == 0x0005A0, "Member 'UBP_UIStaminaExpireTime_C::ImmediatelyExpireTime' has a wrong offset!");
static_assert(offsetof(UBP_UIStaminaExpireTime_C, RemoveSelfTH) == 0x0005A8, "Member 'UBP_UIStaminaExpireTime_C::RemoveSelfTH' has a wrong offset!");

}

