#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIMiniMapContianer

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "QRSL_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UIMiniMapContianer.BP_UIMiniMapContianer_C
// 0x0070 (0x0BC8 - 0x0B58)
class UBP_UIMiniMapContianer_C final : public UQRSLUI_MiniMap
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B58(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UHottaButton*                           BtnShowSurvivalGuide;                              // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_PCKey;                                 // 0x0B68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_DiamondDetectionEntry_C*            DiamondDetectionEntry;                             // 0x0B70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_frame;                                       // 0x0B78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_UIMinimap_C*                        Minimap;                                           // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           OpenMapButton;                                     // 0x0B88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key;                                            // 0x0B90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_89;                                         // 0x0B98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PS4Touchpad_1;                                     // 0x0BA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 PS5Touchpad;                                       // 0x0BA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SurvivalGuidePanel;                                // 0x0BB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WeatherPreview_BP_C*                UI_WeatherPreview_BP;                              // 0x0BB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          NewVar_0;                                          // 0x0BC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void CollapsePCkey();
	void CollapseImgFrame();
	void CollapseWeatherPreview();
	void CollapseSurvivalGuidePanel();
	void BndEvt__OpenMapButton_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature(class UWidget* BtnWidget);
	void BndEvt__BtnShowSurvivalGuide_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();
	void BPRerenderMapFog();
	void OnInitialized();
	void PreConstruct(bool IsDesignTime);
	void BPOnGamepadInputChanged(bool bGamepad);
	void Construct();
	void ExecuteUbergraph_BP_UIMiniMapContianer(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UIMiniMapContianer_C">();
	}
	static class UBP_UIMiniMapContianer_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UIMiniMapContianer_C>();
	}
};
static_assert(alignof(UBP_UIMiniMapContianer_C) == 0x000008, "Wrong alignment on UBP_UIMiniMapContianer_C");
static_assert(sizeof(UBP_UIMiniMapContianer_C) == 0x000BC8, "Wrong size on UBP_UIMiniMapContianer_C");
static_assert(offsetof(UBP_UIMiniMapContianer_C, UberGraphFrame) == 0x000B58, "Member 'UBP_UIMiniMapContianer_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, BtnShowSurvivalGuide) == 0x000B60, "Member 'UBP_UIMiniMapContianer_C::BtnShowSurvivalGuide' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, CanvasPanel_PCKey) == 0x000B68, "Member 'UBP_UIMiniMapContianer_C::CanvasPanel_PCKey' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, DiamondDetectionEntry) == 0x000B70, "Member 'UBP_UIMiniMapContianer_C::DiamondDetectionEntry' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, Image_frame) == 0x000B78, "Member 'UBP_UIMiniMapContianer_C::Image_frame' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, Minimap) == 0x000B80, "Member 'UBP_UIMiniMapContianer_C::Minimap' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, OpenMapButton) == 0x000B88, "Member 'UBP_UIMiniMapContianer_C::OpenMapButton' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, PC_Key) == 0x000B90, "Member 'UBP_UIMiniMapContianer_C::PC_Key' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, PC_Key_89) == 0x000B98, "Member 'UBP_UIMiniMapContianer_C::PC_Key_89' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, PS4Touchpad_1) == 0x000BA0, "Member 'UBP_UIMiniMapContianer_C::PS4Touchpad_1' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, PS5Touchpad) == 0x000BA8, "Member 'UBP_UIMiniMapContianer_C::PS5Touchpad' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, SurvivalGuidePanel) == 0x000BB0, "Member 'UBP_UIMiniMapContianer_C::SurvivalGuidePanel' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, UI_WeatherPreview_BP) == 0x000BB8, "Member 'UBP_UIMiniMapContianer_C::UI_WeatherPreview_BP' has a wrong offset!");
static_assert(offsetof(UBP_UIMiniMapContianer_C, NewVar_0) == 0x000BC0, "Member 'UBP_UIMiniMapContianer_C::NewVar_0' has a wrong offset!");

}

