#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIMonsterBufferManager

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_UIMonsterBufferManager.BP_UIMonsterBufferManager_C.ExecuteUbergraph_BP_UIMonsterBufferManager
// 0x0020 (0x0020 - 0x0000)
struct BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateSizeRule                                ___byte_Variable;                                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateSizeRule                                ___byte_Variable_1;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateSizeRule                                K2Node_Select_Default;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_555E[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateChildSize                        K2Node_MakeStruct_SlateChildSize;                  // 0x000C(0x0008)(NoDestructor)
	uint8                                         Pad_555F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHorizontalBoxSlot*                     CallFunc_SlotAsHorizontalBoxSlot_ReturnValue;      // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager) == 0x000008, "Wrong alignment on BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager");
static_assert(sizeof(BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager) == 0x000020, "Wrong size on BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager");
static_assert(offsetof(BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager, EntryPoint) == 0x000000, "Member 'BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager, ___bool_Variable) == 0x000004, "Member 'BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager::___bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager, ___byte_Variable) == 0x000005, "Member 'BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager::___byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager, ___byte_Variable_1) == 0x000006, "Member 'BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager, K2Node_Event_IsDesignTime) == 0x000007, "Member 'BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager, K2Node_Select_Default) == 0x000008, "Member 'BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager, K2Node_MakeStruct_SlateChildSize) == 0x00000C, "Member 'BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager::K2Node_MakeStruct_SlateChildSize' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager, CallFunc_SlotAsHorizontalBoxSlot_ReturnValue) == 0x000018, "Member 'BP_UIMonsterBufferManager_C_ExecuteUbergraph_BP_UIMonsterBufferManager::CallFunc_SlotAsHorizontalBoxSlot_ReturnValue' has a wrong offset!");

// Function BP_UIMonsterBufferManager.BP_UIMonsterBufferManager_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct BP_UIMonsterBufferManager_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIMonsterBufferManager_C_PreConstruct) == 0x000001, "Wrong alignment on BP_UIMonsterBufferManager_C_PreConstruct");
static_assert(sizeof(BP_UIMonsterBufferManager_C_PreConstruct) == 0x000001, "Wrong size on BP_UIMonsterBufferManager_C_PreConstruct");
static_assert(offsetof(BP_UIMonsterBufferManager_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'BP_UIMonsterBufferManager_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

