#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIMonsterHeadUpInfo

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BP_UIMonsterHeadUpInfo.BP_UIMonsterHeadUpInfo_C.ExecuteUbergraph_BP_UIMonsterHeadUpInfo
// 0x0018 (0x0018 - 0x0000)
struct BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57A5[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_InWidget;               // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InNewVisibility;        // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InOldVisibility;        // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo) == 0x000008, "Wrong alignment on BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo");
static_assert(sizeof(BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo) == 0x000018, "Wrong size on BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo");
static_assert(offsetof(BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo, EntryPoint) == 0x000000, "Member 'BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo, K2Node_ComponentBoundEvent_InWidget) == 0x000008, "Member 'BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo, K2Node_ComponentBoundEvent_InNewVisibility) == 0x000010, "Member 'BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo::K2Node_ComponentBoundEvent_InNewVisibility' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo, K2Node_ComponentBoundEvent_InOldVisibility) == 0x000011, "Member 'BP_UIMonsterHeadUpInfo_C_ExecuteUbergraph_BP_UIMonsterHeadUpInfo::K2Node_ComponentBoundEvent_InOldVisibility' has a wrong offset!");

// Function BP_UIMonsterHeadUpInfo.BP_UIMonsterHeadUpInfo_C.BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InNewVisibility;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InOldVisibility;                                   // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature");
static_assert(sizeof(BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature) == 0x000010, "Wrong size on BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature");
static_assert(offsetof(BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature, InWidget) == 0x000000, "Member 'BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature::InWidget' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature, InNewVisibility) == 0x000008, "Member 'BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature::InNewVisibility' has a wrong offset!");
static_assert(offsetof(BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature, InOldVisibility) == 0x000009, "Member 'BP_UIMonsterHeadUpInfo_C_BndEvt__BP_UIMonsterHeadUpInfo_RageProgressBar_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature::InOldVisibility' has a wrong offset!");

}

