#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UIMapBackground

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function BP_UIMapBackground.BP_UIMapBackground_C.SetMapBackgroundFogMask
// 0x0048 (0x0048 - 0x0000)
struct BP_UIMapBackground_C_SetMapBackgroundFogMask final
{
public:
	class UMapViewComponent*                      RedrawMapViewComp;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogRatio;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FogOffset;                                         // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9E[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FLinearColor                           K2Node_MakeStruct_LinearColor;                     // 0x0020(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   CallFunc_GetPlayer_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMapViewComponent*                      CallFunc_GetComponentByClass_ReturnValue;          // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BP_UIMapBackground_C_SetMapBackgroundFogMask) == 0x000008, "Wrong alignment on BP_UIMapBackground_C_SetMapBackgroundFogMask");
static_assert(sizeof(BP_UIMapBackground_C_SetMapBackgroundFogMask) == 0x000048, "Wrong size on BP_UIMapBackground_C_SetMapBackgroundFogMask");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, RedrawMapViewComp) == 0x000000, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::RedrawMapViewComp' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, FogRatio) == 0x000008, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::FogRatio' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, FogOffset) == 0x00000C, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::FogOffset' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, CallFunc_BreakVector2D_X) == 0x000014, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, CallFunc_BreakVector2D_Y) == 0x000018, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x00001C, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, K2Node_MakeStruct_LinearColor) == 0x000020, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::K2Node_MakeStruct_LinearColor' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, CallFunc_GetPlayer_ReturnValue) == 0x000030, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::CallFunc_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, CallFunc_GetComponentByClass_ReturnValue) == 0x000038, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::CallFunc_GetComponentByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000040, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_SetMapBackgroundFogMask, CallFunc_BooleanAND_ReturnValue) == 0x000041, "Member 'BP_UIMapBackground_C_SetMapBackgroundFogMask::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function BP_UIMapBackground.BP_UIMapBackground_C.InitOverlay
// 0x0010 (0x0010 - 0x0000)
struct BP_UIMapBackground_C_InitOverlay final
{
public:
	bool                                          CallFunc_IsLevelScene_ReturnValue;                 // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9F[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMapBackground_C_InitOverlay) == 0x000008, "Wrong alignment on BP_UIMapBackground_C_InitOverlay");
static_assert(sizeof(BP_UIMapBackground_C_InitOverlay) == 0x000010, "Wrong size on BP_UIMapBackground_C_InitOverlay");
static_assert(offsetof(BP_UIMapBackground_C_InitOverlay, CallFunc_IsLevelScene_ReturnValue) == 0x000000, "Member 'BP_UIMapBackground_C_InitOverlay::CallFunc_IsLevelScene_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_InitOverlay, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000008, "Member 'BP_UIMapBackground_C_InitOverlay::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");

// Function BP_UIMapBackground.BP_UIMapBackground_C.UpdateVisibility
// 0x0020 (0x0020 - 0x0000)
struct BP_UIMapBackground_C_UpdateVisibility final
{
public:
	bool                                          ___bool_Variable;                                  // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              ___byte_Variable;                                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ___byte_Variable_1;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA0[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       K2Node_DynamicCast_As_____;                        // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA1[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_GetBackgroundZOrder_ReturnValue;          // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBackgroundVisible_ReturnValue;          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMapBackground_C_UpdateVisibility) == 0x000008, "Wrong alignment on BP_UIMapBackground_C_UpdateVisibility");
static_assert(sizeof(BP_UIMapBackground_C_UpdateVisibility) == 0x000020, "Wrong size on BP_UIMapBackground_C_UpdateVisibility");
static_assert(offsetof(BP_UIMapBackground_C_UpdateVisibility, ___bool_Variable) == 0x000000, "Member 'BP_UIMapBackground_C_UpdateVisibility::___bool_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateVisibility, ___byte_Variable) == 0x000001, "Member 'BP_UIMapBackground_C_UpdateVisibility::___byte_Variable' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateVisibility, ___byte_Variable_1) == 0x000002, "Member 'BP_UIMapBackground_C_UpdateVisibility::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateVisibility, CallFunc_IsValid_ReturnValue) == 0x000003, "Member 'BP_UIMapBackground_C_UpdateVisibility::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateVisibility, K2Node_DynamicCast_As_____) == 0x000008, "Member 'BP_UIMapBackground_C_UpdateVisibility::K2Node_DynamicCast_As_____' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateVisibility, K2Node_DynamicCast_bSuccess) == 0x000010, "Member 'BP_UIMapBackground_C_UpdateVisibility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateVisibility, CallFunc_GetBackgroundZOrder_ReturnValue) == 0x000014, "Member 'BP_UIMapBackground_C_UpdateVisibility::CallFunc_GetBackgroundZOrder_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateVisibility, CallFunc_IsBackgroundVisible_ReturnValue) == 0x000018, "Member 'BP_UIMapBackground_C_UpdateVisibility::CallFunc_IsBackgroundVisible_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateVisibility, K2Node_Select_Default) == 0x000019, "Member 'BP_UIMapBackground_C_UpdateVisibility::K2Node_Select_Default' has a wrong offset!");

// Function BP_UIMapBackground.BP_UIMapBackground_C.UpdateMaterial
// 0x0040 (0x0040 - 0x0000)
struct BP_UIMapBackground_C_UpdateMaterial final
{
public:
	bool                                          bShouldRecreate;                                   // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA2[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     NewMaterial;                                       // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA3[0x6];                                     // 0x0012(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterialInterface*                     CallFunc_GetBackgroundMaterialForUMG_ReturnValue;  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA4[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UMaterial*                              CallFunc_GetBaseMaterial_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ObjectObject_ReturnValue;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CA5[0x3];                                     // 0x0039(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeInSeconds_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMapBackground_C_UpdateMaterial) == 0x000008, "Wrong alignment on BP_UIMapBackground_C_UpdateMaterial");
static_assert(sizeof(BP_UIMapBackground_C_UpdateMaterial) == 0x000040, "Wrong size on BP_UIMapBackground_C_UpdateMaterial");
static_assert(offsetof(BP_UIMapBackground_C_UpdateMaterial, bShouldRecreate) == 0x000000, "Member 'BP_UIMapBackground_C_UpdateMaterial::bShouldRecreate' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateMaterial, NewMaterial) == 0x000008, "Member 'BP_UIMapBackground_C_UpdateMaterial::NewMaterial' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateMaterial, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'BP_UIMapBackground_C_UpdateMaterial::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateMaterial, CallFunc_IsValid_ReturnValue_1) == 0x000011, "Member 'BP_UIMapBackground_C_UpdateMaterial::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateMaterial, CallFunc_GetBackgroundMaterialForUMG_ReturnValue) == 0x000018, "Member 'BP_UIMapBackground_C_UpdateMaterial::CallFunc_GetBackgroundMaterialForUMG_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateMaterial, CallFunc_IsValid_ReturnValue_2) == 0x000020, "Member 'BP_UIMapBackground_C_UpdateMaterial::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateMaterial, CallFunc_GetBaseMaterial_ReturnValue) == 0x000028, "Member 'BP_UIMapBackground_C_UpdateMaterial::CallFunc_GetBaseMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateMaterial, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'BP_UIMapBackground_C_UpdateMaterial::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateMaterial, CallFunc_NotEqual_ObjectObject_ReturnValue) == 0x000038, "Member 'BP_UIMapBackground_C_UpdateMaterial::CallFunc_NotEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_UpdateMaterial, CallFunc_GetGameTimeInSeconds_ReturnValue) == 0x00003C, "Member 'BP_UIMapBackground_C_UpdateMaterial::CallFunc_GetGameTimeInSeconds_ReturnValue' has a wrong offset!");

// Function BP_UIMapBackground.BP_UIMapBackground_C.OnTextureMatChanged
// 0x0008 (0x0008 - 0x0000)
struct BP_UIMapBackground_C_OnTextureMatChanged final
{
public:
	class AMapBackground*                         MapBackground;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMapBackground_C_OnTextureMatChanged) == 0x000008, "Wrong alignment on BP_UIMapBackground_C_OnTextureMatChanged");
static_assert(sizeof(BP_UIMapBackground_C_OnTextureMatChanged) == 0x000008, "Wrong size on BP_UIMapBackground_C_OnTextureMatChanged");
static_assert(offsetof(BP_UIMapBackground_C_OnTextureMatChanged, MapBackground) == 0x000000, "Member 'BP_UIMapBackground_C_OnTextureMatChanged::MapBackground' has a wrong offset!");

// Function BP_UIMapBackground.BP_UIMapBackground_C.OnEndPlay
// 0x0010 (0x0010 - 0x0000)
struct BP_UIMapBackground_C_OnEndPlay final
{
public:
	class AActor*                                 Actor;                                             // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                EndPlayReason;                                     // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMapBackground_C_OnEndPlay) == 0x000008, "Wrong alignment on BP_UIMapBackground_C_OnEndPlay");
static_assert(sizeof(BP_UIMapBackground_C_OnEndPlay) == 0x000010, "Wrong size on BP_UIMapBackground_C_OnEndPlay");
static_assert(offsetof(BP_UIMapBackground_C_OnEndPlay, Actor) == 0x000000, "Member 'BP_UIMapBackground_C_OnEndPlay::Actor' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_OnEndPlay, EndPlayReason) == 0x000008, "Member 'BP_UIMapBackground_C_OnEndPlay::EndPlayReason' has a wrong offset!");

// Function BP_UIMapBackground.BP_UIMapBackground_C.On Appearance Changed
// 0x0008 (0x0008 - 0x0000)
struct BP_UIMapBackground_C_On_Appearance_Changed final
{
public:
	class AMapBackground*                         MapBackground;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMapBackground_C_On_Appearance_Changed) == 0x000008, "Wrong alignment on BP_UIMapBackground_C_On_Appearance_Changed");
static_assert(sizeof(BP_UIMapBackground_C_On_Appearance_Changed) == 0x000008, "Wrong size on BP_UIMapBackground_C_On_Appearance_Changed");
static_assert(offsetof(BP_UIMapBackground_C_On_Appearance_Changed, MapBackground) == 0x000000, "Member 'BP_UIMapBackground_C_On_Appearance_Changed::MapBackground' has a wrong offset!");

// Function BP_UIMapBackground.BP_UIMapBackground_C.On Overlay Changed
// 0x0018 (0x0018 - 0x0000)
struct BP_UIMapBackground_C_On_Overlay_Changed final
{
public:
	class AMapBackground*                         MapBackground;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Level;                                             // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA6[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 RenderTarget;                                      // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMapBackground_C_On_Overlay_Changed) == 0x000008, "Wrong alignment on BP_UIMapBackground_C_On_Overlay_Changed");
static_assert(sizeof(BP_UIMapBackground_C_On_Overlay_Changed) == 0x000018, "Wrong size on BP_UIMapBackground_C_On_Overlay_Changed");
static_assert(offsetof(BP_UIMapBackground_C_On_Overlay_Changed, MapBackground) == 0x000000, "Member 'BP_UIMapBackground_C_On_Overlay_Changed::MapBackground' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_On_Overlay_Changed, Level) == 0x000008, "Member 'BP_UIMapBackground_C_On_Overlay_Changed::Level' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_On_Overlay_Changed, RenderTarget) == 0x000010, "Member 'BP_UIMapBackground_C_On_Overlay_Changed::RenderTarget' has a wrong offset!");

// Function BP_UIMapBackground.BP_UIMapBackground_C.OnMapBackgroundFogMaskChange_ܚ_0
// 0x0018 (0x0018 - 0x0000)
struct BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0 final
{
public:
	class UMapViewComponent*                      Param_MapViewComp;                                 // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FogRatio;                                          // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              FogOffset;                                         // 0x000C(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0) == 0x000008, "Wrong alignment on BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0");
static_assert(sizeof(BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0) == 0x000018, "Wrong size on BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0");
static_assert(offsetof(BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0, Param_MapViewComp) == 0x000000, "Member 'BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0::Param_MapViewComp' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0, FogRatio) == 0x000008, "Member 'BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0::FogRatio' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0, FogOffset) == 0x00000C, "Member 'BP_UIMapBackground_C_OnMapBackgroundFogMaskChange____0::FogOffset' has a wrong offset!");

// Function BP_UIMapBackground.BP_UIMapBackground_C.ExecuteUbergraph_BP_UIMapBackground
// 0x00A8 (0x00A8 - 0x0000)
struct BP_UIMapBackground_C_ExecuteUbergraph_BP_UIMapBackground final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA7[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapBackground*                         K2Node_CustomEvent_MapBackground_2;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UMapViewComponent* MapViewComp, float FogRatio, const struct FVector2D& FogOffset)> K2Node_CreateDelegate_OutputDelegate;              // 0x0010(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AMapBackground* MapBackground, int32 Level, class UTextureRenderTarget2D* RenderTarget)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0020(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 K2Node_CustomEvent_Actor;                          // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEndPlayReason                                K2Node_CustomEvent_EndPlayReason;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA8[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMapBackground*                         K2Node_CustomEvent_MapBackground_1;                // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AMapBackground* MapBackground)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	class AMapBackground*                         K2Node_CustomEvent_MapBackground;                  // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_CustomEvent_Level;                          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6CA9[0x4];                                     // 0x0064(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTextureRenderTarget2D*                 K2Node_CustomEvent_RenderTarget;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* Actor, EEndPlayReason EndPlayReason)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0070(0x0010)(ZeroConstructor, NoDestructor)
	class UMapViewComponent*                      K2Node_CustomEvent_MapViewComp;                    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_FogRatio;                       // 0x0088(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              K2Node_CustomEvent_FogOffset;                      // 0x008C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AMapBackground* MapBackground)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0094(0x0010)(ZeroConstructor, NoDestructor)
};
static_assert(alignof(BP_UIMapBackground_C_ExecuteUbergraph_BP_UIMapBackground) == 0x000008, "Wrong alignment on BP_UIMapBackground_C_ExecuteUbergraph_BP_UIMapBackground");
static_assert(sizeof(BP_UIMapBackground_C_ExecuteUbergraph_BP_UIMapBackground) == 0x0000A8, "Wrong size on BP_UIMapBackground_C_ExecuteUbergraph_BP_UIMapBackground");
static_assert(offsetof(BP_UIMapBackground_C_ExecuteUbergraph_BP_UIMapBackground, EntryPoint) == 0x000000, "Member 'BP_UIMapBackground_C_ExecuteUbergraph_BP_UIMapBackground::EntryPoint' has a wrong offset!");
static_assert(offsetof(BP_UIMapBackground_C_ExecuteUbergraph_BP_UIMapBackground, K2Node_CustomEvent_MapBackground_2) == 0x000008, "Member 'BP_UIMapBackground_C_ExecuteUbergraph_BP_UIMapBackground::K2Node_CustomEvent_MapBackground_2' has a wrong offset!");
