#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_UISupplyShortcut

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "QRSL_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BP_UISupplyShortcut.BP_UISupplyShortcut_C
// 0x0048 (0x0998 - 0x0950)
class UBP_UISupplyShortcut_C final : public UQRSLUI_SupplyShortcut
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0950(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       PullSupply;                                        // 0x0958(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       PushSupply;                                        // 0x0960(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key;                                            // 0x0968(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0970(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           SupplyChoosePanel;                                 // 0x0978(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Scrollbox_C*                        SupplyScrollBox;                                   // 0x0980(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           UseCountPanel;                                     // 0x0988(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         UseCountRichText;                                  // 0x0990(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BP_UISupplyShortcut(int32 EntryPoint);
	void BPOnGamepadInputChanged(bool bGamepad);
	void OnFinishedPullAnim();
	void OnHottaScrollEnd();
	void OnPushAnimFinished();
	void OnChangeHasUseSupplyCount();
	void Destruct();
	void BndEvt__ShrinkButton_1_K2Node_ComponentBoundEvent_2_OnButtonClickedEvent__DelegateSignature();
	void BndEvt__ShrinkButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();
	void OnPushAnimEndedEvent(class UCanvasPanel* Param_SupplyChoosePanel);
	void RefreshUseSupplyCount();
	struct FVector2D GetItemTipsOffset(const struct FGeometry& ItemGeometry);
	void RecoverSettingPanelState();
	void SequenceEvent__ENTRYPOINTBP_UISupplyShortcut_0(class UCanvasPanel* Param_SupplyChoosePanel);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_UISupplyShortcut_C">();
	}
	static class UBP_UISupplyShortcut_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBP_UISupplyShortcut_C>();
	}
};
static_assert(alignof(UBP_UISupplyShortcut_C) == 0x000008, "Wrong alignment on UBP_UISupplyShortcut_C");
static_assert(sizeof(UBP_UISupplyShortcut_C) == 0x000998, "Wrong size on UBP_UISupplyShortcut_C");
static_assert(offsetof(UBP_UISupplyShortcut_C, UberGraphFrame) == 0x000950, "Member 'UBP_UISupplyShortcut_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBP_UISupplyShortcut_C, PullSupply) == 0x000958, "Member 'UBP_UISupplyShortcut_C::PullSupply' has a wrong offset!");
static_assert(offsetof(UBP_UISupplyShortcut_C, PushSupply) == 0x000960, "Member 'UBP_UISupplyShortcut_C::PushSupply' has a wrong offset!");
static_assert(offsetof(UBP_UISupplyShortcut_C, PC_Key) == 0x000968, "Member 'UBP_UISupplyShortcut_C::PC_Key' has a wrong offset!");
static_assert(offsetof(UBP_UISupplyShortcut_C, SafeZone_0) == 0x000970, "Member 'UBP_UISupplyShortcut_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UBP_UISupplyShortcut_C, SupplyChoosePanel) == 0x000978, "Member 'UBP_UISupplyShortcut_C::SupplyChoosePanel' has a wrong offset!");
static_assert(offsetof(UBP_UISupplyShortcut_C, SupplyScrollBox) == 0x000980, "Member 'UBP_UISupplyShortcut_C::SupplyScrollBox' has a wrong offset!");
static_assert(offsetof(UBP_UISupplyShortcut_C, UseCountPanel) == 0x000988, "Member 'UBP_UISupplyShortcut_C::UseCountPanel' has a wrong offset!");
static_assert(offsetof(UBP_UISupplyShortcut_C, UseCountRichText) == 0x000990, "Member 'UBP_UISupplyShortcut_C::UseCountRichText' has a wrong offset!");

}

