#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BP_WeatherControllActor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_WeatherControllActor.BP_WeatherControllActor_C
// 0x0018 (0x0340 - 0x0328)
class ABP_WeatherControllActor_C final : public AWeatherControllActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0328(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0330(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UQRSLUI_MainForm*                       Uimainform;                                        // 0x0338(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ReceiveBeginPlay();
	void ReceiveTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_WeatherControllActor(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_WeatherControllActor_C">();
	}
	static class ABP_WeatherControllActor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_WeatherControllActor_C>();
	}
};
static_assert(alignof(ABP_WeatherControllActor_C) == 0x000008, "Wrong alignment on ABP_WeatherControllActor_C");
static_assert(sizeof(ABP_WeatherControllActor_C) == 0x000340, "Wrong size on ABP_WeatherControllActor_C");
static_assert(offsetof(ABP_WeatherControllActor_C, UberGraphFrame) == 0x000328, "Member 'ABP_WeatherControllActor_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ABP_WeatherControllActor_C, DefaultSceneRoot) == 0x000330, "Member 'ABP_WeatherControllActor_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(ABP_WeatherControllActor_C, Uimainform) == 0x000338, "Member 'ABP_WeatherControllActor_C::Uimainform' has a wrong offset!");

}

