#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPAnimNotifyStateJumpLoop

#include "Basic.hpp"

#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function BPAnimNotifyStateJumpLoop.BPAnimNotifyStateJumpLoop_C.Received_NotifyEnd
// 0x0040 (0x0040 - 0x0000)
struct BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C71[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsClientOrStandalone_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C72[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkcomponentAttacked_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd");
static_assert(sizeof(BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd) == 0x000040, "Wrong size on BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd, ___delegate_Variable) == 0x000020, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd, CallFunc_IsClientOrStandalone_ReturnValue) == 0x000030, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd::CallFunc_IsClientOrStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd, CallFunc_SpawnAkcomponentAttacked_ReturnValue) == 0x000038, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyEnd::CallFunc_SpawnAkcomponentAttacked_ReturnValue' has a wrong offset!");

// Function BPAnimNotifyStateJumpLoop.BPAnimNotifyStateJumpLoop_C.Received_NotifyBegin
// 0x0040 (0x0040 - 0x0000)
struct BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C73[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x0020(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsClientOrStandalone_ReturnValue;         // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C74[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkcomponentAttacked_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin");
static_assert(sizeof(BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin) == 0x000040, "Wrong size on BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin, ___delegate_Variable) == 0x000020, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin, CallFunc_IsClientOrStandalone_ReturnValue) == 0x000030, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin::CallFunc_IsClientOrStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin, CallFunc_SpawnAkcomponentAttacked_ReturnValue) == 0x000038, "Member 'BPAnimNotifyStateJumpLoop_C_Received_NotifyBegin::CallFunc_SpawnAkcomponentAttacked_ReturnValue' has a wrong offset!");

}

