#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BPLFishCursorActor

#include "Basic.hpp"


namespace SDK::Params
{

// Function BPLFishCursorActor.BPLFishCursorActor_C.SetCursorCanUsed
// 0x0001 (0x0001 - 0x0000)
struct BPLFishCursorActor_C_SetCursorCanUsed final
{
public:
	bool                                          _use;                                              // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPLFishCursorActor_C_SetCursorCanUsed) == 0x000001, "Wrong alignment on BPLFishCursorActor_C_SetCursorCanUsed");
static_assert(sizeof(BPLFishCursorActor_C_SetCursorCanUsed) == 0x000001, "Wrong size on BPLFishCursorActor_C_SetCursorCanUsed");
static_assert(offsetof(BPLFishCursorActor_C_SetCursorCanUsed, _use) == 0x000000, "Member 'BPLFishCursorActor_C_SetCursorCanUsed::_use' has a wrong offset!");

// Function BPLFishCursorActor.BPLFishCursorActor_C.ExecuteUbergraph_BPLFishCursorActor
// 0x0008 (0x0008 - 0x0000)
struct BPLFishCursorActor_C_ExecuteUbergraph_BPLFishCursorActor final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event__use;                                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BPLFishCursorActor_C_ExecuteUbergraph_BPLFishCursorActor) == 0x000004, "Wrong alignment on BPLFishCursorActor_C_ExecuteUbergraph_BPLFishCursorActor");
static_assert(sizeof(BPLFishCursorActor_C_ExecuteUbergraph_BPLFishCursorActor) == 0x000008, "Wrong size on BPLFishCursorActor_C_ExecuteUbergraph_BPLFishCursorActor");
static_assert(offsetof(BPLFishCursorActor_C_ExecuteUbergraph_BPLFishCursorActor, EntryPoint) == 0x000000, "Member 'BPLFishCursorActor_C_ExecuteUbergraph_BPLFishCursorActor::EntryPoint' has a wrong offset!");
static_assert(offsetof(BPLFishCursorActor_C_ExecuteUbergraph_BPLFishCursorActor, K2Node_Event__use) == 0x000004, "Member 'BPLFishCursorActor_C_ExecuteUbergraph_BPLFishCursorActor::K2Node_Event__use' has a wrong offset!");

}

