#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BreakFateBossBuffItem

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function BreakFateBossBuffItem.BreakFateBossBuffItem_C.ExecuteUbergraph_BreakFateBossBuffItem
// 0x0020 (0x0020 - 0x0000)
struct BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5981[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_InWidget;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InNewVisibility;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InOldVisibility;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem) == 0x000008, "Wrong alignment on BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem");
static_assert(sizeof(BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem) == 0x000020, "Wrong size on BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem");
static_assert(offsetof(BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem, EntryPoint) == 0x000000, "Member 'BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem::EntryPoint' has a wrong offset!");
static_assert(offsetof(BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem, CallFunc_PlayAnimation_ReturnValue) == 0x000008, "Member 'BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem, K2Node_ComponentBoundEvent_InWidget) == 0x000010, "Member 'BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem, K2Node_ComponentBoundEvent_InNewVisibility) == 0x000018, "Member 'BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem::K2Node_ComponentBoundEvent_InNewVisibility' has a wrong offset!");
static_assert(offsetof(BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem, K2Node_ComponentBoundEvent_InOldVisibility) == 0x000019, "Member 'BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem::K2Node_ComponentBoundEvent_InOldVisibility' has a wrong offset!");
static_assert(offsetof(BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00001A, "Member 'BreakFateBossBuffItem_C_ExecuteUbergraph_BreakFateBossBuffItem::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function BreakFateBossBuffItem.BreakFateBossBuffItem_C.BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InNewVisibility;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InOldVisibility;                                   // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature");
static_assert(sizeof(BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature) == 0x000010, "Wrong size on BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature");
static_assert(offsetof(BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature, InWidget) == 0x000000, "Member 'BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature::InWidget' has a wrong offset!");
static_assert(offsetof(BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature, InNewVisibility) == 0x000008, "Member 'BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature::InNewVisibility' has a wrong offset!");
static_assert(offsetof(BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature, InOldVisibility) == 0x000009, "Member 'BreakFateBossBuffItem_C_BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature::InOldVisibility' has a wrong offset!");

}

