#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BreakFateBossBuffItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass BreakFateBossBuffItem.BreakFateBossBuffItem_C
// 0x0028 (0x09A0 - 0x0978)
class UBreakFateBossBuffItem_C final : public UQRSLUI_BreakFateBossBuffSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0978(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Jinyong;                                           // 0x0980(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0988(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0990(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBg;                                           // 0x0998(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_BreakFateBossBuffItem(int32 EntryPoint);
	void BndEvt__BreakFateBossBuffItem_Img_Flag_K2Node_ComponentBoundEvent_0_OnVisibilityChangedDelegate__DelegateSignature(class UWidget* InWidget, ESlateVisibility InNewVisibility, ESlateVisibility InOldVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BreakFateBossBuffItem_C">();
	}
	static class UBreakFateBossBuffItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UBreakFateBossBuffItem_C>();
	}
};
static_assert(alignof(UBreakFateBossBuffItem_C) == 0x000008, "Wrong alignment on UBreakFateBossBuffItem_C");
static_assert(sizeof(UBreakFateBossBuffItem_C) == 0x0009A0, "Wrong size on UBreakFateBossBuffItem_C");
static_assert(offsetof(UBreakFateBossBuffItem_C, UberGraphFrame) == 0x000978, "Member 'UBreakFateBossBuffItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UBreakFateBossBuffItem_C, Jinyong) == 0x000980, "Member 'UBreakFateBossBuffItem_C::Jinyong' has a wrong offset!");
static_assert(offsetof(UBreakFateBossBuffItem_C, Image_0) == 0x000988, "Member 'UBreakFateBossBuffItem_C::Image_0' has a wrong offset!");
static_assert(offsetof(UBreakFateBossBuffItem_C, Image_1) == 0x000990, "Member 'UBreakFateBossBuffItem_C::Image_1' has a wrong offset!");
static_assert(offsetof(UBreakFateBossBuffItem_C, ImageBg) == 0x000998, "Member 'UBreakFateBossBuffItem_C::ImageBg' has a wrong offset!");

}

