#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_SetStrafeAttackMoveDestination

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function BTTask_SetStrafeAttackMoveDestination.BTTask_SetStrafeAttackMoveDestination_C.ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination
// 0x0038 (0x0038 - 0x0000)
struct BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5782[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaAICharacter*                      K2Node_DynamicCast_AsHotta_AICharacter;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5783[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetStrafeAttackMoveDestination_OutDestination; // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GetStrafeAttackMoveDestination_ReturnValue; // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination) == 0x000008, "Wrong alignment on BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination");
static_assert(sizeof(BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination) == 0x000038, "Wrong size on BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination");
static_assert(offsetof(BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination, EntryPoint) == 0x000000, "Member 'BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination, K2Node_DynamicCast_AsHotta_AICharacter) == 0x000018, "Member 'BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination::K2Node_DynamicCast_AsHotta_AICharacter' has a wrong offset!");
static_assert(offsetof(BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination, CallFunc_GetStrafeAttackMoveDestination_OutDestination) == 0x000024, "Member 'BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination::CallFunc_GetStrafeAttackMoveDestination_OutDestination' has a wrong offset!");
static_assert(offsetof(BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination, CallFunc_GetStrafeAttackMoveDestination_ReturnValue) == 0x000030, "Member 'BTTask_SetStrafeAttackMoveDestination_C_ExecuteUbergraph_BTTask_SetStrafeAttackMoveDestination::CallFunc_GetStrafeAttackMoveDestination_ReturnValue' has a wrong offset!");

// Function BTTask_SetStrafeAttackMoveDestination.BTTask_SetStrafeAttackMoveDestination_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_SetStrafeAttackMoveDestination_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_SetStrafeAttackMoveDestination_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_SetStrafeAttackMoveDestination_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_SetStrafeAttackMoveDestination_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_SetStrafeAttackMoveDestination_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_SetStrafeAttackMoveDestination_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_SetStrafeAttackMoveDestination_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_SetStrafeAttackMoveDestination_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_SetStrafeAttackMoveDestination_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

