#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: BTTask_UseHuntSkill

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function BTTask_UseHuntSkill.BTTask_UseHuntSkill_C.ExecuteUbergraph_BTTask_UseHuntSkill
// 0x0028 (0x0028 - 0x0000)
struct BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E35[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          K2Node_Event_OwnerController;                      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  K2Node_Event_ControlledPawn;                       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AMon_ele_004_C*                         K2Node_DynamicCast_AsMon_Ele_004;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E36[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayAbilitySpecHandle             CallFunc_K2_GiveAbilityAndActivateOnce_ReturnValue; // 0x0024(0x0004)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill) == 0x000008, "Wrong alignment on BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill");
static_assert(sizeof(BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill) == 0x000028, "Wrong size on BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill");
static_assert(offsetof(BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill, EntryPoint) == 0x000000, "Member 'BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill::EntryPoint' has a wrong offset!");
static_assert(offsetof(BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill, K2Node_Event_OwnerController) == 0x000008, "Member 'BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill::K2Node_Event_OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill, K2Node_Event_ControlledPawn) == 0x000010, "Member 'BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill::K2Node_Event_ControlledPawn' has a wrong offset!");
static_assert(offsetof(BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill, K2Node_DynamicCast_AsMon_Ele_004) == 0x000018, "Member 'BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill::K2Node_DynamicCast_AsMon_Ele_004' has a wrong offset!");
static_assert(offsetof(BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill, CallFunc_K2_GiveAbilityAndActivateOnce_ReturnValue) == 0x000024, "Member 'BTTask_UseHuntSkill_C_ExecuteUbergraph_BTTask_UseHuntSkill::CallFunc_K2_GiveAbilityAndActivateOnce_ReturnValue' has a wrong offset!");

// Function BTTask_UseHuntSkill.BTTask_UseHuntSkill_C.ReceiveExecuteAI
// 0x0010 (0x0010 - 0x0000)
struct BTTask_UseHuntSkill_C_ReceiveExecuteAI final
{
public:
	class AAIController*                          OwnerController;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  ControlledPawn;                                    // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(BTTask_UseHuntSkill_C_ReceiveExecuteAI) == 0x000008, "Wrong alignment on BTTask_UseHuntSkill_C_ReceiveExecuteAI");
static_assert(sizeof(BTTask_UseHuntSkill_C_ReceiveExecuteAI) == 0x000010, "Wrong size on BTTask_UseHuntSkill_C_ReceiveExecuteAI");
static_assert(offsetof(BTTask_UseHuntSkill_C_ReceiveExecuteAI, OwnerController) == 0x000000, "Member 'BTTask_UseHuntSkill_C_ReceiveExecuteAI::OwnerController' has a wrong offset!");
static_assert(offsetof(BTTask_UseHuntSkill_C_ReceiveExecuteAI, ControlledPawn) == 0x000008, "Member 'BTTask_UseHuntSkill_C_ReceiveExecuteAI::ControlledPawn' has a wrong offset!");

}

