#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: buff_sleep

#include "Basic.hpp"


namespace SDK::Params
{

// Function buff_sleep.buff_sleep_C.CalcExtraDamage
// 0x0018 (0x0018 - 0x0000)
struct buff_sleep_C_CalcExtraDamage final
{
public:
	class AHottaCharacter*                        TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                SourceAbilityComp;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(buff_sleep_C_CalcExtraDamage) == 0x000008, "Wrong alignment on buff_sleep_C_CalcExtraDamage");
static_assert(sizeof(buff_sleep_C_CalcExtraDamage) == 0x000018, "Wrong size on buff_sleep_C_CalcExtraDamage");
static_assert(offsetof(buff_sleep_C_CalcExtraDamage, TargetActor) == 0x000000, "Member 'buff_sleep_C_CalcExtraDamage::TargetActor' has a wrong offset!");
static_assert(offsetof(buff_sleep_C_CalcExtraDamage, SourceAbilityComp) == 0x000008, "Member 'buff_sleep_C_CalcExtraDamage::SourceAbilityComp' has a wrong offset!");
static_assert(offsetof(buff_sleep_C_CalcExtraDamage, ReturnValue) == 0x000010, "Member 'buff_sleep_C_CalcExtraDamage::ReturnValue' has a wrong offset!");

}

