#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Calu_MonShieldBreakColdDown

#include "Basic.hpp"


namespace SDK::Params
{

// Function Calu_MonShieldBreakColdDown.Calu_MonShieldBreakColdDown_C.HottaCalculateBaseMagnitude
// 0x0020 (0x0020 - 0x0000)
struct Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude final
{
public:
	const class AActor*                           OwnerActor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           HitActor;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InstigatorActor;                                   // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsBalanceServerMode_ReturnValue;          // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude) == 0x000008, "Wrong alignment on Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude");
static_assert(sizeof(Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude) == 0x000020, "Wrong size on Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude");
static_assert(offsetof(Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude, OwnerActor) == 0x000000, "Member 'Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude::OwnerActor' has a wrong offset!");
static_assert(offsetof(Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude, HitActor) == 0x000008, "Member 'Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude::HitActor' has a wrong offset!");
static_assert(offsetof(Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude, InstigatorActor) == 0x000010, "Member 'Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude::InstigatorActor' has a wrong offset!");
static_assert(offsetof(Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude, ReturnValue) == 0x000018, "Member 'Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude, CallFunc_IsBalanceServerMode_ReturnValue) == 0x00001C, "Member 'Calu_MonShieldBreakColdDown_C_HottaCalculateBaseMagnitude::CallFunc_IsBalanceServerMode_ReturnValue' has a wrong offset!");

}

