#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraShakeNotify

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function CameraShakeNotify.CameraShakeNotify_C.Received_Notify
// 0x0070 (0x0070 - 0x0000)
struct CameraShakeNotify_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55F5[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55F6[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0024(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaRole                                    CallFunc_SwitchRole_OutRole;                       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55F7[0x5];                                     // 0x003B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UQRSLHandleOperationManager*            CallFunc_K2_GetHandleOperatorManager_ReturnValue;  // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_FloatFloat_ReturnValue;          // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55F8[0x3];                                     // 0x0051(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue_1;        // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsOnlyServer_ReturnValue;                 // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55F9[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Vector_Distance_ReturnValue;              // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x006A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x006B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CameraShakeNotify_C_Received_Notify) == 0x000008, "Wrong alignment on CameraShakeNotify_C_Received_Notify");
static_assert(sizeof(CameraShakeNotify_C_Received_Notify) == 0x000070, "Wrong size on CameraShakeNotify_C_Received_Notify");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, MeshComp) == 0x000000, "Member 'CameraShakeNotify_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, Animation) == 0x000008, "Member 'CameraShakeNotify_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, ReturnValue) == 0x000010, "Member 'CameraShakeNotify_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_NotEqual_NameName_ReturnValue) == 0x000020, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000024, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000030, "Member 'CameraShakeNotify_C_Received_Notify::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'CameraShakeNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_SwitchRole_OutRole) == 0x000039, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_SwitchRole_OutRole' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, K2Node_SwitchEnum_CmpSuccess) == 0x00003A, "Member 'CameraShakeNotify_C_Received_Notify::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_K2_GetHandleOperatorManager_ReturnValue) == 0x000040, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_K2_GetHandleOperatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000048, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_NotEqual_FloatFloat_ReturnValue) == 0x000050, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_NotEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_K2_GetActorLocation_ReturnValue_1) == 0x000054, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_K2_GetActorLocation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_IsOnlyServer_ReturnValue) == 0x000060, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_IsOnlyServer_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_Vector_Distance_ReturnValue) == 0x000064, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_Vector_Distance_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000068, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000069, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_BooleanAND_ReturnValue) == 0x00006A, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraShakeNotify_C_Received_Notify, CallFunc_BooleanAND_ReturnValue_1) == 0x00006B, "Member 'CameraShakeNotify_C_Received_Notify::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

