#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraShakeNotify

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass CameraShakeNotify.CameraShakeNotify_C
// 0x0038 (0x0080 - 0x0048)
class UCameraShakeNotify_C final : public UAnimNotify_CameraShake
{
public:
	float                                         Inner_Radius;                                      // 0x0048(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Outer_Radius;                                      // 0x004C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Falloff;                                           // 0x0050(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55F3[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClass*                                 CamerShake;                                        // 0x0058(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SelfUse;                                           // 0x0060(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55F4[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Blur_Inner_Radius;                                 // 0x0064(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Blur_Outer_Radius;                                 // 0x0068(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                Offset;                                            // 0x006C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   PadShake;                                          // 0x0078(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_Notify(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"CameraShakeNotify_C">();
	}
	static class UCameraShakeNotify_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UCameraShakeNotify_C>();
	}
};
static_assert(alignof(UCameraShakeNotify_C) == 0x000008, "Wrong alignment on UCameraShakeNotify_C");
static_assert(sizeof(UCameraShakeNotify_C) == 0x000080, "Wrong size on UCameraShakeNotify_C");
static_assert(offsetof(UCameraShakeNotify_C, Inner_Radius) == 0x000048, "Member 'UCameraShakeNotify_C::Inner_Radius' has a wrong offset!");
static_assert(offsetof(UCameraShakeNotify_C, Outer_Radius) == 0x00004C, "Member 'UCameraShakeNotify_C::Outer_Radius' has a wrong offset!");
static_assert(offsetof(UCameraShakeNotify_C, Falloff) == 0x000050, "Member 'UCameraShakeNotify_C::Falloff' has a wrong offset!");
static_assert(offsetof(UCameraShakeNotify_C, CamerShake) == 0x000058, "Member 'UCameraShakeNotify_C::CamerShake' has a wrong offset!");
static_assert(offsetof(UCameraShakeNotify_C, SelfUse) == 0x000060, "Member 'UCameraShakeNotify_C::SelfUse' has a wrong offset!");
static_assert(offsetof(UCameraShakeNotify_C, Blur_Inner_Radius) == 0x000064, "Member 'UCameraShakeNotify_C::Blur_Inner_Radius' has a wrong offset!");
static_assert(offsetof(UCameraShakeNotify_C, Blur_Outer_Radius) == 0x000068, "Member 'UCameraShakeNotify_C::Blur_Outer_Radius' has a wrong offset!");
static_assert(offsetof(UCameraShakeNotify_C, Offset) == 0x00006C, "Member 'UCameraShakeNotify_C::Offset' has a wrong offset!");
static_assert(offsetof(UCameraShakeNotify_C, PadShake) == 0x000078, "Member 'UCameraShakeNotify_C::PadShake' has a wrong offset!");

}

