#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: CameraLensEffectNotify

#include "Basic.hpp"


namespace SDK::Params
{

// Function CameraLensEffectNotify.CameraLensEffectNotify_C.Received_Notify
// 0x0078 (0x0078 - 0x0000)
struct CameraLensEffectNotify_C_Received_Notify final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C75[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            TempController;                                    // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  TempPlayer;                                        // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLMountCharacter*                    K2Node_DynamicCast_AsQRSLMount_Character;          // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsSimulatedProxyRole_ReturnValue;         // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C76[0x5];                                     // 0x0043(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_2;              // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalController_ReturnValue;            // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C77[0x6];                                     // 0x0062(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class APlayerController*                      K2Node_DynamicCast_As_____;                        // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(CameraLensEffectNotify_C_Received_Notify) == 0x000008, "Wrong alignment on CameraLensEffectNotify_C_Received_Notify");
static_assert(sizeof(CameraLensEffectNotify_C_Received_Notify) == 0x000078, "Wrong size on CameraLensEffectNotify_C_Received_Notify");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, MeshComp) == 0x000000, "Member 'CameraLensEffectNotify_C_Received_Notify::MeshComp' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, Animation) == 0x000008, "Member 'CameraLensEffectNotify_C_Received_Notify::Animation' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, ReturnValue) == 0x000010, "Member 'CameraLensEffectNotify_C_Received_Notify::ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, TempController) == 0x000018, "Member 'CameraLensEffectNotify_C_Received_Notify::TempController' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, TempPlayer) == 0x000020, "Member 'CameraLensEffectNotify_C_Received_Notify::TempPlayer' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, CallFunc_GetOwner_ReturnValue) == 0x000028, "Member 'CameraLensEffectNotify_C_Received_Notify::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, CallFunc_GetController_ReturnValue) == 0x000030, "Member 'CameraLensEffectNotify_C_Received_Notify::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, K2Node_DynamicCast_AsQRSLMount_Character) == 0x000038, "Member 'CameraLensEffectNotify_C_Received_Notify::K2Node_DynamicCast_AsQRSLMount_Character' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'CameraLensEffectNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, CallFunc_IsSimulatedProxyRole_ReturnValue) == 0x000041, "Member 'CameraLensEffectNotify_C_Received_Notify::CallFunc_IsSimulatedProxyRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, CallFunc_IsValid_ReturnValue) == 0x000042, "Member 'CameraLensEffectNotify_C_Received_Notify::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, CallFunc_GetController_ReturnValue_1) == 0x000048, "Member 'CameraLensEffectNotify_C_Received_Notify::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, CallFunc_GetController_ReturnValue_2) == 0x000050, "Member 'CameraLensEffectNotify_C_Received_Notify::CallFunc_GetController_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000058, "Member 'CameraLensEffectNotify_C_Received_Notify::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'CameraLensEffectNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, CallFunc_IsLocalController_ReturnValue) == 0x000061, "Member 'CameraLensEffectNotify_C_Received_Notify::CallFunc_IsLocalController_ReturnValue' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, K2Node_DynamicCast_As_____) == 0x000068, "Member 'CameraLensEffectNotify_C_Received_Notify::K2Node_DynamicCast_As_____' has a wrong offset!");
static_assert(offsetof(CameraLensEffectNotify_C_Received_Notify, K2Node_DynamicCast_bSuccess_2) == 0x000070, "Member 'CameraLensEffectNotify_C_Received_Notify::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");

}

