#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ChangeWeaponEffect_Paradox

#include "Basic.hpp"


namespace SDK::Params
{

// Function ChangeWeaponEffect_Paradox.ChangeWeaponEffect_Paradox_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct ChangeWeaponEffect_Paradox_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ChangeWeaponEffect_Paradox_C_ReceiveTick) == 0x000004, "Wrong alignment on ChangeWeaponEffect_Paradox_C_ReceiveTick");
static_assert(sizeof(ChangeWeaponEffect_Paradox_C_ReceiveTick) == 0x000004, "Wrong size on ChangeWeaponEffect_Paradox_C_ReceiveTick");
static_assert(offsetof(ChangeWeaponEffect_Paradox_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'ChangeWeaponEffect_Paradox_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function ChangeWeaponEffect_Paradox.ChangeWeaponEffect_Paradox_C.ExecuteUbergraph_ChangeWeaponEffect_Paradox
// 0x0028 (0x0028 - 0x0000)
struct ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        CallFunc_ChooseRightSpecialEffect_ReturnValue;     // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInState_ReturnValue;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox) == 0x000008, "Wrong alignment on ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox");
static_assert(sizeof(ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox) == 0x000028, "Wrong size on ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox");
static_assert(offsetof(ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox, EntryPoint) == 0x000000, "Member 'ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox::EntryPoint' has a wrong offset!");
static_assert(offsetof(ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox, CallFunc_GetOwner_ReturnValue) == 0x000008, "Member 'ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox, CallFunc_ChooseRightSpecialEffect_ReturnValue) == 0x000010, "Member 'ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox::CallFunc_ChooseRightSpecialEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000018, "Member 'ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox, CallFunc_IsInState_ReturnValue) == 0x000021, "Member 'ChangeWeaponEffect_Paradox_C_ExecuteUbergraph_ChangeWeaponEffect_Paradox::CallFunc_IsInState_ReturnValue' has a wrong offset!");

}

