#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DialogInteractEntryWidget_BP

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function DialogInteractEntryWidget_BP.DialogInteractEntryWidget_BP_C.ExecuteUbergraph_DialogInteractEntryWidget_BP
// 0x0030 (0x0030 - 0x0000)
struct DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ___byte_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              ___byte_Variable_1;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bGamepad;                             // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5526[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_BP_GetPlayer_ReturnValue;                 // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWorld*                                 CallFunc_K2_GetWorld_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaHandleOperationManager*           CallFunc_GetManager_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetGamepadConnected_ReturnValue;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP) == 0x000008, "Wrong alignment on DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP");
static_assert(sizeof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP) == 0x000030, "Wrong size on DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, EntryPoint) == 0x000000, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, ___byte_Variable) == 0x000004, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::___byte_Variable' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, ___bool_Variable) == 0x000005, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::___bool_Variable' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, ___byte_Variable_1) == 0x000006, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, K2Node_Event_IsDesignTime) == 0x000007, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, K2Node_Event_bGamepad) == 0x000008, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::K2Node_Event_bGamepad' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, K2Node_Select_Default) == 0x000009, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, CallFunc_BP_GetPlayer_ReturnValue) == 0x000010, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::CallFunc_BP_GetPlayer_ReturnValue' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, CallFunc_K2_GetWorld_ReturnValue) == 0x000018, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::CallFunc_K2_GetWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, CallFunc_GetManager_ReturnValue) == 0x000020, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::CallFunc_GetManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, CallFunc_IsValid_ReturnValue) == 0x000028, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP, CallFunc_GetGamepadConnected_ReturnValue) == 0x000029, "Member 'DialogInteractEntryWidget_BP_C_ExecuteUbergraph_DialogInteractEntryWidget_BP::CallFunc_GetGamepadConnected_ReturnValue' has a wrong offset!");

// Function DialogInteractEntryWidget_BP.DialogInteractEntryWidget_BP_C.BPOnGamepadInputChanged
// 0x0001 (0x0001 - 0x0000)
struct DialogInteractEntryWidget_BP_C_BPOnGamepadInputChanged final
{
public:
	bool                                          bGamepad;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DialogInteractEntryWidget_BP_C_BPOnGamepadInputChanged) == 0x000001, "Wrong alignment on DialogInteractEntryWidget_BP_C_BPOnGamepadInputChanged");
static_assert(sizeof(DialogInteractEntryWidget_BP_C_BPOnGamepadInputChanged) == 0x000001, "Wrong size on DialogInteractEntryWidget_BP_C_BPOnGamepadInputChanged");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_BPOnGamepadInputChanged, bGamepad) == 0x000000, "Member 'DialogInteractEntryWidget_BP_C_BPOnGamepadInputChanged::bGamepad' has a wrong offset!");

// Function DialogInteractEntryWidget_BP.DialogInteractEntryWidget_BP_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct DialogInteractEntryWidget_BP_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(DialogInteractEntryWidget_BP_C_PreConstruct) == 0x000001, "Wrong alignment on DialogInteractEntryWidget_BP_C_PreConstruct");
static_assert(sizeof(DialogInteractEntryWidget_BP_C_PreConstruct) == 0x000001, "Wrong size on DialogInteractEntryWidget_BP_C_PreConstruct");
static_assert(offsetof(DialogInteractEntryWidget_BP_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'DialogInteractEntryWidget_BP_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

