#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DialogInteractEntryWidget_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass DialogInteractEntryWidget_BP.DialogInteractEntryWidget_BP_C
// 0x0020 (0x09D0 - 0x09B0)
class UDialogInteractEntryWidget_BP_C final : public UHottaInteractEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_68;                                          // 0x09B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           InteractButton;                                    // 0x09C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHottaShortcutKeyTipsWidget*            Shortcut_Key_Widget;                               // 0x09C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_DialogInteractEntryWidget_BP(int32 EntryPoint);
	void BPOnGamepadInputChanged(bool bGamepad);
	void Construct();
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"DialogInteractEntryWidget_BP_C">();
	}
	static class UDialogInteractEntryWidget_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UDialogInteractEntryWidget_BP_C>();
	}
};
static_assert(alignof(UDialogInteractEntryWidget_BP_C) == 0x000008, "Wrong alignment on UDialogInteractEntryWidget_BP_C");
static_assert(sizeof(UDialogInteractEntryWidget_BP_C) == 0x0009D0, "Wrong size on UDialogInteractEntryWidget_BP_C");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, UberGraphFrame) == 0x0009B0, "Member 'UDialogInteractEntryWidget_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, Image_68) == 0x0009B8, "Member 'UDialogInteractEntryWidget_BP_C::Image_68' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, InteractButton) == 0x0009C0, "Member 'UDialogInteractEntryWidget_BP_C::InteractButton' has a wrong offset!");
static_assert(offsetof(UDialogInteractEntryWidget_BP_C, Shortcut_Key_Widget) == 0x0009C8, "Member 'UDialogInteractEntryWidget_BP_C::Shortcut_Key_Widget' has a wrong offset!");

}

