#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: DlgSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK
{

// Enum DlgSystem.EDlgCompare
// NumValues: 0x0004
enum class EDlgCompare : uint8
{
	ToConst                                  = 0,
	ToVariable                               = 1,
	ToClassVariable                          = 2,
	EDlgCompare_MAX                          = 3,
};

// Enum DlgSystem.EDlgOperation
// NumValues: 0x0007
enum class EDlgOperation : uint8
{
	Equal                                    = 0,
	NotEqual                                 = 1,
	Less                                     = 2,
	LessOrEqual                              = 3,
	Greater                                  = 4,
	GreaterOrEqual                           = 5,
	EDlgOperation_MAX                        = 6,
};

// Enum DlgSystem.EDlgConditionType
// NumValues: 0x000D
enum class EDlgConditionType : uint8
{
	IntCall                                  = 0,
	FloatCall                                = 1,
	BoolCall                                 = 2,
	NameCall                                 = 3,
	EventCall                                = 4,
	ClassIntVariable                         = 5,
	ClassFloatVariable                       = 6,
	ClassBoolVariable                        = 7,
	ClassNameVariable                        = 8,
	WasNodeVisited                           = 9,
	HasSatisfiedChild                        = 10,
	Custom                                   = 11,
	EDlgConditionType_MAX                    = 12,
};

// Enum DlgSystem.EDlgConditionStrength
// NumValues: 0x0003
enum class EDlgConditionStrength : uint8
{
	Strong                                   = 0,
	Weak                                     = 1,
	EDlgConditionStrength_MAX                = 2,
};

// Enum DlgSystem.EDlgValidateStatus
// NumValues: 0x0006
enum class EDlgValidateStatus : uint8
{
	Valid                                    = 0,
	ParticipantIsNull                        = 1,
	DialogueIsNull                           = 2,
	ParticipantDoesNotImplementInterface     = 3,
	ParticipantIsABlueprintClassAndDoesNotImplementInterface = 4,
	EDlgValidateStatus_MAX                   = 5,
};

// Enum DlgSystem.EDlgEventType
// NumValues: 0x000B
enum class EDlgEventType : uint8
{
	Event                                    = 0,
	ModifyInt                                = 1,
	ModifyFloat                              = 2,
	ModifyBool                               = 3,
	ModifyName                               = 4,
	ModifyClassIntVariable                   = 5,
	ModifyClassFloatVariable                 = 6,
	ModifyClassBoolVariable                  = 7,
	ModifyClassNameVariable                  = 8,
	Custom                                   = 9,
	EDlgEventType_MAX                        = 10,
};

// Enum DlgSystem.EDlgTestEnum
// NumValues: 0x0005
enum class EDlgTestEnum : uint8
{
	First                                    = 0,
	Second                                   = 1,
	Third                                    = 2,
	NumOf                                    = 3,
	EDlgTestEnum_MAX                         = 4,
};

// Enum DlgSystem.EDlgNodeSelectorType
// NumValues: 0x0003
enum class EDlgNodeSelectorType : uint8
{
	First                                    = 0,
	Random                                   = 1,
	EDlgNodeSelectorType_MAX                 = 2,
};

// Enum DlgSystem.EDlgClassPickerDisplayMode
// NumValues: 0x0004
enum class EDlgClassPickerDisplayMode : uint8
{
	DefaultView                              = 0,
	TreeView                                 = 1,
	ListView                                 = 2,
	EDlgClassPickerDisplayMode_MAX           = 3,
};

// Enum DlgSystem.EDlgTextNamespaceLocalization
// NumValues: 0x0005
enum class EDlgTextNamespaceLocalization : uint8
{
	Ignore                                   = 0,
	PerDialogue                              = 1,
	WithPrefixPerDialogue                    = 2,
	Global                                   = 3,
	EDlgTextNamespaceLocalization_MAX        = 4,
};

// Enum DlgSystem.EDlgTextInputKeyForNewLine
// NumValues: 0x0003
enum class EDlgTextInputKeyForNewLine : uint8
{
	Enter                                    = 0,
	ShiftPlusEnter                           = 1,
	EDlgTextInputKeyForNewLine_MAX           = 2,
};

// Enum DlgSystem.EDlgSpeakerStateVisibility
// NumValues: 0x0005
enum class EDlgSpeakerStateVisibility : uint8
{
	HideAll                                  = 0,
	ShowOnEdge                               = 1,
	ShowOnNode                               = 2,
	ShowOnNodeAndEdge                        = 3,
	EDlgSpeakerStateVisibility_MAX           = 4,
};

// Enum DlgSystem.EDlgVoiceDisplayedFields
// NumValues: 0x0005
enum class EDlgVoiceDisplayedFields : uint8
{
	None                                     = 0,
	SoundWave                                = 1,
	DialogueWave                             = 2,
	SoundWaveAndDialogueWave                 = 3,
	EDlgVoiceDisplayedFields_MAX             = 4,
};

// Enum DlgSystem.EDlgDialogueTextFormat
// NumValues: 0x0007
enum class EDlgDialogueTextFormat : uint8
{
	None                                     = 0,
	All                                      = 1,
	DialogueDEPRECATED                       = 2,
	StartTextFormats                         = 2,
	JSON                                     = 3,
	NumTextFormats                           = 4,
	EDlgDialogueTextFormat_MAX               = 5,
};

// Enum DlgSystem.EDlgTextArgumentType
// NumValues: 0x0009
enum class EDlgTextArgumentType : uint8
{
	DisplayName                              = 0,
	Gender                                   = 1,
	DialogueInt                              = 2,
	DialogueFloat                            = 3,
	ClassInt                                 = 4,
	ClassFloat                               = 5,
	ClassText                                = 6,
	Custom                                   = 7,
	EDlgTextArgumentType_MAX                 = 8,
};

// Enum DlgSystem.ENYLoggerLogLevel
// NumValues: 0x0007
enum class ENYLoggerLogLevel : uint8
{
	NoLogging                                = 0,
	Error                                    = 1,
	Warning                                  = 2,
	Info                                     = 3,
	Debug                                    = 4,
	Trace                                    = 5,
	ENYLoggerLogLevel_MAX                    = 6,
};

// ScriptStruct DlgSystem.DlgCamera
// 0x0014 (0x0014 - 0x0000)
struct FDlgCamera final
{
public:
	bool                                          bCameraActor;                                      // 0x0000(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bPlayer;                                           // 0x0001(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_178F[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CameraOwnerName;                                   // 0x0004(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CameraName;                                        // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgCamera) == 0x000004, "Wrong alignment on FDlgCamera");
static_assert(sizeof(FDlgCamera) == 0x000014, "Wrong size on FDlgCamera");
static_assert(offsetof(FDlgCamera, bCameraActor) == 0x000000, "Member 'FDlgCamera::bCameraActor' has a wrong offset!");
static_assert(offsetof(FDlgCamera, bPlayer) == 0x000001, "Member 'FDlgCamera::bPlayer' has a wrong offset!");
static_assert(offsetof(FDlgCamera, CameraOwnerName) == 0x000004, "Member 'FDlgCamera::CameraOwnerName' has a wrong offset!");
static_assert(offsetof(FDlgCamera, CameraName) == 0x00000C, "Member 'FDlgCamera::CameraName' has a wrong offset!");

// ScriptStruct DlgSystem.DlgMidCameraConfig
// 0x0024 (0x0024 - 0x0000)
struct FDlgMidCameraConfig final
{
public:
	struct FDlgCamera                             Camera;                                            // 0x0000(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x0014(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewTargetBlendFunction                      BlendFunc;                                         // 0x0018(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1790[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x001C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         WaittingTime;                                      // 0x0020(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgMidCameraConfig) == 0x000004, "Wrong alignment on FDlgMidCameraConfig");
static_assert(sizeof(FDlgMidCameraConfig) == 0x000024, "Wrong size on FDlgMidCameraConfig");
static_assert(offsetof(FDlgMidCameraConfig, Camera) == 0x000000, "Member 'FDlgMidCameraConfig::Camera' has a wrong offset!");
static_assert(offsetof(FDlgMidCameraConfig, BlendTime) == 0x000014, "Member 'FDlgMidCameraConfig::BlendTime' has a wrong offset!");
static_assert(offsetof(FDlgMidCameraConfig, BlendFunc) == 0x000018, "Member 'FDlgMidCameraConfig::BlendFunc' has a wrong offset!");
static_assert(offsetof(FDlgMidCameraConfig, BlendExp) == 0x00001C, "Member 'FDlgMidCameraConfig::BlendExp' has a wrong offset!");
static_assert(offsetof(FDlgMidCameraConfig, WaittingTime) == 0x000020, "Member 'FDlgMidCameraConfig::WaittingTime' has a wrong offset!");

// ScriptStruct DlgSystem.DlgCameraConfig
// 0x0038 (0x0038 - 0x0000)
struct FDlgCameraConfig final
{
public:
	struct FDlgCamera                             Camera1;                                           // 0x0000(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                          bCameraBlend;                                      // 0x0014(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1791[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDlgCamera                             Camera2;                                           // 0x0018(0x0014)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                         BlendTime;                                         // 0x002C(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EViewTargetBlendFunction                      BlendFunc;                                         // 0x0030(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1792[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlendExp;                                          // 0x0034(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgCameraConfig) == 0x000004, "Wrong alignment on FDlgCameraConfig");
static_assert(sizeof(FDlgCameraConfig) == 0x000038, "Wrong size on FDlgCameraConfig");
static_assert(offsetof(FDlgCameraConfig, Camera1) == 0x000000, "Member 'FDlgCameraConfig::Camera1' has a wrong offset!");
static_assert(offsetof(FDlgCameraConfig, bCameraBlend) == 0x000014, "Member 'FDlgCameraConfig::bCameraBlend' has a wrong offset!");
static_assert(offsetof(FDlgCameraConfig, Camera2) == 0x000018, "Member 'FDlgCameraConfig::Camera2' has a wrong offset!");
static_assert(offsetof(FDlgCameraConfig, BlendTime) == 0x00002C, "Member 'FDlgCameraConfig::BlendTime' has a wrong offset!");
static_assert(offsetof(FDlgCameraConfig, BlendFunc) == 0x000030, "Member 'FDlgCameraConfig::BlendFunc' has a wrong offset!");
static_assert(offsetof(FDlgCameraConfig, BlendExp) == 0x000034, "Member 'FDlgCameraConfig::BlendExp' has a wrong offset!");

// ScriptStruct DlgSystem.DlgCondition
// 0x0058 (0x0058 - 0x0000)
struct FDlgCondition final
{
public:
	EDlgConditionStrength                         Strength;                                          // 0x0000(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgConditionType                             ConditionType;                                     // 0x0001(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1793[0x2];                                     // 0x0002(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParticipantName;                                   // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   CallbackName;                                      // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgOperation                                 Operation;                                         // 0x0014(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgCompare                                   CompareType;                                       // 0x0015(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1794[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   OtherParticipantName;                              // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   OtherVariableName;                                 // 0x0020(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntValue;                                          // 0x0028(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x002C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NameValue;                                         // 0x0030(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoolValue;                                        // 0x0038(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bLongTermMemory;                                   // 0x0039(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1795[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGuid                                  Guid;                                              // 0x003C(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1796[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgConditionCustom*                    CustomCondition;                                   // 0x0050(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgCondition) == 0x000008, "Wrong alignment on FDlgCondition");
static_assert(sizeof(FDlgCondition) == 0x000058, "Wrong size on FDlgCondition");
static_assert(offsetof(FDlgCondition, Strength) == 0x000000, "Member 'FDlgCondition::Strength' has a wrong offset!");
static_assert(offsetof(FDlgCondition, ConditionType) == 0x000001, "Member 'FDlgCondition::ConditionType' has a wrong offset!");
static_assert(offsetof(FDlgCondition, ParticipantName) == 0x000004, "Member 'FDlgCondition::ParticipantName' has a wrong offset!");
static_assert(offsetof(FDlgCondition, CallbackName) == 0x00000C, "Member 'FDlgCondition::CallbackName' has a wrong offset!");
static_assert(offsetof(FDlgCondition, Operation) == 0x000014, "Member 'FDlgCondition::Operation' has a wrong offset!");
static_assert(offsetof(FDlgCondition, CompareType) == 0x000015, "Member 'FDlgCondition::CompareType' has a wrong offset!");
static_assert(offsetof(FDlgCondition, OtherParticipantName) == 0x000018, "Member 'FDlgCondition::OtherParticipantName' has a wrong offset!");
static_assert(offsetof(FDlgCondition, OtherVariableName) == 0x000020, "Member 'FDlgCondition::OtherVariableName' has a wrong offset!");
static_assert(offsetof(FDlgCondition, IntValue) == 0x000028, "Member 'FDlgCondition::IntValue' has a wrong offset!");
static_assert(offsetof(FDlgCondition, FloatValue) == 0x00002C, "Member 'FDlgCondition::FloatValue' has a wrong offset!");
static_assert(offsetof(FDlgCondition, NameValue) == 0x000030, "Member 'FDlgCondition::NameValue' has a wrong offset!");
static_assert(offsetof(FDlgCondition, bBoolValue) == 0x000038, "Member 'FDlgCondition::bBoolValue' has a wrong offset!");
static_assert(offsetof(FDlgCondition, bLongTermMemory) == 0x000039, "Member 'FDlgCondition::bLongTermMemory' has a wrong offset!");
static_assert(offsetof(FDlgCondition, Guid) == 0x00003C, "Member 'FDlgCondition::Guid' has a wrong offset!");
static_assert(offsetof(FDlgCondition, CustomCondition) == 0x000050, "Member 'FDlgCondition::CustomCondition' has a wrong offset!");

// ScriptStruct DlgSystem.DlgTextArgument
// 0x0030 (0x0030 - 0x0000)
struct FDlgTextArgument final
{
public:
	class FString                                 DisplayString;                                     // 0x0000(0x0010)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgTextArgumentType                          Type;                                              // 0x0010(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1797[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ParticipantName;                                   // 0x0014(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   VariableName;                                      // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1798[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgTextArgumentCustom*                 CustomTextArgument;                                // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgTextArgument) == 0x000008, "Wrong alignment on FDlgTextArgument");
static_assert(sizeof(FDlgTextArgument) == 0x000030, "Wrong size on FDlgTextArgument");
static_assert(offsetof(FDlgTextArgument, DisplayString) == 0x000000, "Member 'FDlgTextArgument::DisplayString' has a wrong offset!");
static_assert(offsetof(FDlgTextArgument, Type) == 0x000010, "Member 'FDlgTextArgument::Type' has a wrong offset!");
static_assert(offsetof(FDlgTextArgument, ParticipantName) == 0x000014, "Member 'FDlgTextArgument::ParticipantName' has a wrong offset!");
static_assert(offsetof(FDlgTextArgument, VariableName) == 0x00001C, "Member 'FDlgTextArgument::VariableName' has a wrong offset!");
static_assert(offsetof(FDlgTextArgument, CustomTextArgument) == 0x000028, "Member 'FDlgTextArgument::CustomTextArgument' has a wrong offset!");

// ScriptStruct DlgSystem.DlgEdge
// 0x0068 (0x0068 - 0x0000)
struct FDlgEdge final
{
public:
	int32                                         TargetIndex;                                       // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         EdgeIndex;                                         // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDlgCondition>                  Conditions;                                        // 0x0008(0x0010)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                   SpeakerState;                                      // 0x0018(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bIncludeInAllOptionListIfUnsatisfied;              // 0x0020(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bForceShow;                                        // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1799[0x6];                                     // 0x0022(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Text;                                              // 0x0028(0x0018)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FDlgTextArgument>               TextArguments;                                     // 0x0040(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, EditFixedSize, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                         Pad_179A[0x18];                                    // 0x0050(0x0018)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDlgEdge) == 0x000008, "Wrong alignment on FDlgEdge");
static_assert(sizeof(FDlgEdge) == 0x000068, "Wrong size on FDlgEdge");
static_assert(offsetof(FDlgEdge, TargetIndex) == 0x000000, "Member 'FDlgEdge::TargetIndex' has a wrong offset!");
static_assert(offsetof(FDlgEdge, EdgeIndex) == 0x000004, "Member 'FDlgEdge::EdgeIndex' has a wrong offset!");
static_assert(offsetof(FDlgEdge, Conditions) == 0x000008, "Member 'FDlgEdge::Conditions' has a wrong offset!");
static_assert(offsetof(FDlgEdge, SpeakerState) == 0x000018, "Member 'FDlgEdge::SpeakerState' has a wrong offset!");
static_assert(offsetof(FDlgEdge, bIncludeInAllOptionListIfUnsatisfied) == 0x000020, "Member 'FDlgEdge::bIncludeInAllOptionListIfUnsatisfied' has a wrong offset!");
static_assert(offsetof(FDlgEdge, bForceShow) == 0x000021, "Member 'FDlgEdge::bForceShow' has a wrong offset!");
static_assert(offsetof(FDlgEdge, Text) == 0x000028, "Member 'FDlgEdge::Text' has a wrong offset!");
static_assert(offsetof(FDlgEdge, TextArguments) == 0x000040, "Member 'FDlgEdge::TextArguments' has a wrong offset!");

// ScriptStruct DlgSystem.DlgEdgeData
// 0x0070 (0x0070 - 0x0000)
struct FDlgEdgeData final
{
public:
	bool                                          bSatisfied;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_179B[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDlgEdge                               Edge;                                              // 0x0008(0x0068)(BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
};
static_assert(alignof(FDlgEdgeData) == 0x000008, "Wrong alignment on FDlgEdgeData");
static_assert(sizeof(FDlgEdgeData) == 0x000070, "Wrong size on FDlgEdgeData");
static_assert(offsetof(FDlgEdgeData, bSatisfied) == 0x000000, "Member 'FDlgEdgeData::bSatisfied' has a wrong offset!");
static_assert(offsetof(FDlgEdgeData, Edge) == 0x000008, "Member 'FDlgEdgeData::Edge' has a wrong offset!");

// ScriptStruct DlgSystem.DlgParticipantData
// 0x0460 (0x0460 - 0x0000)
struct FDlgParticipantData final
{
public:
	TSet<class FName>                             Conditions;                                        // 0x0000(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           CustomConditions;                                  // 0x0050(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             Events;                                            // 0x00A0(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           CustomEvents;                                      // 0x00F0(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class UClass*>                           CustomTextArguments;                               // 0x0140(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             IntVariableNames;                                  // 0x0190(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             FloatVariableNames;                                // 0x01E0(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             BoolVariableNames;                                 // 0x0230(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             NameVariableNames;                                 // 0x0280(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ClassIntVariableNames;                             // 0x02D0(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ClassFloatVariableNames;                           // 0x0320(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ClassBoolVariableNames;                            // 0x0370(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ClassNameVariableNames;                            // 0x03C0(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
	TSet<class FName>                             ClassTextVariableNames;                            // 0x0410(0x0050)(Edit, BlueprintVisible, EditConst, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgParticipantData) == 0x000008, "Wrong alignment on FDlgParticipantData");
static_assert(sizeof(FDlgParticipantData) == 0x000460, "Wrong size on FDlgParticipantData");
static_assert(offsetof(FDlgParticipantData, Conditions) == 0x000000, "Member 'FDlgParticipantData::Conditions' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, CustomConditions) == 0x000050, "Member 'FDlgParticipantData::CustomConditions' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, Events) == 0x0000A0, "Member 'FDlgParticipantData::Events' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, CustomEvents) == 0x0000F0, "Member 'FDlgParticipantData::CustomEvents' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, CustomTextArguments) == 0x000140, "Member 'FDlgParticipantData::CustomTextArguments' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, IntVariableNames) == 0x000190, "Member 'FDlgParticipantData::IntVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, FloatVariableNames) == 0x0001E0, "Member 'FDlgParticipantData::FloatVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, BoolVariableNames) == 0x000230, "Member 'FDlgParticipantData::BoolVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, NameVariableNames) == 0x000280, "Member 'FDlgParticipantData::NameVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, ClassIntVariableNames) == 0x0002D0, "Member 'FDlgParticipantData::ClassIntVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, ClassFloatVariableNames) == 0x000320, "Member 'FDlgParticipantData::ClassFloatVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, ClassBoolVariableNames) == 0x000370, "Member 'FDlgParticipantData::ClassBoolVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, ClassNameVariableNames) == 0x0003C0, "Member 'FDlgParticipantData::ClassNameVariableNames' has a wrong offset!");
static_assert(offsetof(FDlgParticipantData, ClassTextVariableNames) == 0x000410, "Member 'FDlgParticipantData::ClassTextVariableNames' has a wrong offset!");

// ScriptStruct DlgSystem.DlgEvent
// 0x0030 (0x0030 - 0x0000)
struct FDlgEvent final
{
public:
	class FName                                   ParticipantName;                                   // 0x0000(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgEventType                                 EventType;                                         // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179C[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   EventName;                                         // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         IntValue;                                          // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         FloatValue;                                        // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   NameValue;                                         // 0x001C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bDelta;                                            // 0x0024(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bValue;                                            // 0x0025(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179D[0x2];                                     // 0x0026(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UDlgEventCustom*                        CustomEvent;                                       // 0x0028(0x0008)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgEvent) == 0x000008, "Wrong alignment on FDlgEvent");
static_assert(sizeof(FDlgEvent) == 0x000030, "Wrong size on FDlgEvent");
static_assert(offsetof(FDlgEvent, ParticipantName) == 0x000000, "Member 'FDlgEvent::ParticipantName' has a wrong offset!");
static_assert(offsetof(FDlgEvent, EventType) == 0x000008, "Member 'FDlgEvent::EventType' has a wrong offset!");
static_assert(offsetof(FDlgEvent, EventName) == 0x00000C, "Member 'FDlgEvent::EventName' has a wrong offset!");
static_assert(offsetof(FDlgEvent, IntValue) == 0x000014, "Member 'FDlgEvent::IntValue' has a wrong offset!");
static_assert(offsetof(FDlgEvent, FloatValue) == 0x000018, "Member 'FDlgEvent::FloatValue' has a wrong offset!");
static_assert(offsetof(FDlgEvent, NameValue) == 0x00001C, "Member 'FDlgEvent::NameValue' has a wrong offset!");
static_assert(offsetof(FDlgEvent, bDelta) == 0x000024, "Member 'FDlgEvent::bDelta' has a wrong offset!");
static_assert(offsetof(FDlgEvent, bValue) == 0x000025, "Member 'FDlgEvent::bValue' has a wrong offset!");
static_assert(offsetof(FDlgEvent, CustomEvent) == 0x000028, "Member 'FDlgEvent::CustomEvent' has a wrong offset!");

// ScriptStruct DlgSystem.DlgClassAndObject
// 0x0010 (0x0010 - 0x0000)
struct FDlgClassAndObject final
{
public:
	class UClass*                                 Class;                                             // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                Object;                                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgClassAndObject) == 0x000008, "Wrong alignment on FDlgClassAndObject");
static_assert(sizeof(FDlgClassAndObject) == 0x000010, "Wrong size on FDlgClassAndObject");
static_assert(offsetof(FDlgClassAndObject, Class) == 0x000000, "Member 'FDlgClassAndObject::Class' has a wrong offset!");
static_assert(offsetof(FDlgClassAndObject, Object) == 0x000008, "Member 'FDlgClassAndObject::Object' has a wrong offset!");

// ScriptStruct DlgSystem.DlgIntroduction
// 0x0014 (0x0014 - 0x0000)
struct FDlgIntroduction final
{
public:
	class FName                                   IntroductionID;                                    // 0x0000(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         IntroduceDuration;                                 // 0x0008(0x0004)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              IntroductionPosition;                              // 0x000C(0x0008)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgIntroduction) == 0x000004, "Wrong alignment on FDlgIntroduction");
static_assert(sizeof(FDlgIntroduction) == 0x000014, "Wrong size on FDlgIntroduction");
static_assert(offsetof(FDlgIntroduction, IntroductionID) == 0x000000, "Member 'FDlgIntroduction::IntroductionID' has a wrong offset!");
static_assert(offsetof(FDlgIntroduction, IntroduceDuration) == 0x000008, "Member 'FDlgIntroduction::IntroduceDuration' has a wrong offset!");
static_assert(offsetof(FDlgIntroduction, IntroductionPosition) == 0x00000C, "Member 'FDlgIntroduction::IntroductionPosition' has a wrong offset!");

// ScriptStruct DlgSystem.DlgTestStructPrimitives
// 0x01B0 (0x01B0 - 0x0000)
struct FDlgTestStructPrimitives final
{
public:
	uint8                                         Pad_179E[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         Integer32;                                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_179F[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	int64                                         Integer64;                                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bBoolean;                                          // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EDlgTestEnum                                  Enum;                                              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17A0[0x2];                                     // 0x001A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         Float;                                             // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   Name;                                              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 String;                                            // 0x0028(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 EmptyString;                                       // 0x0038(0x0010)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                   Text;                                              // 0x0048(0x0018)(NativeAccessSpecifierPublic)
	struct FColor                                 Color;                                             // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                           LinearColor;                                       // 0x0064(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17A1[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FDateTime                              DateTime;                                          // 0x0078(0x0008)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                              IntPoint;                                          // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Vector3;                                           // 0x0088(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                              Vector2;                                           // 0x0094(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17A2[0x4];                                     // 0x009C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector4                               Vector4;                                           // 0x00A0(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotator;                                           // 0x00B0(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_17A3[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMatrix                                Matrix;                                            // 0x00C0(0x0040)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                             Transform;                                         // 0x0100(0x0030)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FGuid                                  Guid;                                              // 0x0130(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                 Class;                                             // 0x0140(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EmptyObjectInitialized;                            // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                EmptyObjectInitializedReference;                   // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             ConstTexture2D;                                    // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                             Texture2DReference;                                // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgTestObjectPrimitivesBase*           ObjectPrimitivesBase;                              // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgTestObjectPrimitives_ChildA*        ObjectPrimitivesChildA;                            // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgTestObjectPrimitivesBase*           ObjectSwitch;                                      // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgTestObjectPrimitivesBase*           ObjectPrimitivesPolymorphismChildA;                // 0x0180(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgTestObjectPrimitivesBase*           ObjectPrimitivesPolymorphismChildB;                // 0x0188(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgTestObjectPrimitives_GrandChildA_Of_ChildA* ObjectPrimitivesGrandChildA;                       // 0x0190(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgTestObjectPrimitivesBase*           ObjectPrimitivesPolymorphismBaseGrandChildA;       // 0x0198(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDlgTestObjectPrimitives_ChildA*        ObjectPrimitivesPolymorphismChildGrandChildA;      // 0x01A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_17A4[0x8];                                     // 0x01A8(0x0008)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(FDlgTestStructPrimitives) == 0x000010, "Wrong alignment on FDlgTestStructPrimitives");
static_assert(sizeof(FDlgTestStructPrimitives) == 0x0001B0, "Wrong size on FDlgTestStructPrimitives");
static_assert(offsetof(FDlgTestStructPrimitives, Integer32) == 0x000008, "Member 'FDlgTestStructPrimitives::Integer32' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Integer64) == 0x000010, "Member 'FDlgTestStructPrimitives::Integer64' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, bBoolean) == 0x000018, "Member 'FDlgTestStructPrimitives::bBoolean' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Enum) == 0x000019, "Member 'FDlgTestStructPrimitives::Enum' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Float) == 0x00001C, "Member 'FDlgTestStructPrimitives::Float' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Name) == 0x000020, "Member 'FDlgTestStructPrimitives::Name' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, String) == 0x000028, "Member 'FDlgTestStructPrimitives::String' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, EmptyString) == 0x000038, "Member 'FDlgTestStructPrimitives::EmptyString' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Text) == 0x000048, "Member 'FDlgTestStructPrimitives::Text' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Color) == 0x000060, "Member 'FDlgTestStructPrimitives::Color' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, LinearColor) == 0x000064, "Member 'FDlgTestStructPrimitives::LinearColor' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, DateTime) == 0x000078, "Member 'FDlgTestStructPrimitives::DateTime' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, IntPoint) == 0x000080, "Member 'FDlgTestStructPrimitives::IntPoint' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Vector3) == 0x000088, "Member 'FDlgTestStructPrimitives::Vector3' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Vector2) == 0x000094, "Member 'FDlgTestStructPrimitives::Vector2' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Vector4) == 0x0000A0, "Member 'FDlgTestStructPrimitives::Vector4' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Rotator) == 0x0000B0, "Member 'FDlgTestStructPrimitives::Rotator' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Matrix) == 0x0000C0, "Member 'FDlgTestStructPrimitives::Matrix' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Transform) == 0x000100, "Member 'FDlgTestStructPrimitives::Transform' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Guid) == 0x000130, "Member 'FDlgTestStructPrimitives::Guid' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Class) == 0x000140, "Member 'FDlgTestStructPrimitives::Class' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, EmptyObjectInitialized) == 0x000148, "Member 'FDlgTestStructPrimitives::EmptyObjectInitialized' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, EmptyObjectInitializedReference) == 0x000150, "Member 'FDlgTestStructPrimitives::EmptyObjectInitializedReference' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, ConstTexture2D) == 0x000158, "Member 'FDlgTestStructPrimitives::ConstTexture2D' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, Texture2DReference) == 0x000160, "Member 'FDlgTestStructPrimitives::Texture2DReference' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, ObjectPrimitivesBase) == 0x000168, "Member 'FDlgTestStructPrimitives::ObjectPrimitivesBase' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, ObjectPrimitivesChildA) == 0x000170, "Member 'FDlgTestStructPrimitives::ObjectPrimitivesChildA' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, ObjectSwitch) == 0x000178, "Member 'FDlgTestStructPrimitives::ObjectSwitch' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, ObjectPrimitivesPolymorphismChildA) == 0x000180, "Member 'FDlgTestStructPrimitives::ObjectPrimitivesPolymorphismChildA' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, ObjectPrimitivesPolymorphismChildB) == 0x000188, "Member 'FDlgTestStructPrimitives::ObjectPrimitivesPolymorphismChildB' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, ObjectPrimitivesGrandChildA) == 0x000190, "Member 'FDlgTestStructPrimitives::ObjectPrimitivesGrandChildA' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, ObjectPrimitivesPolymorphismBaseGrandChildA) == 0x000198, "Member 'FDlgTestStructPrimitives::ObjectPrimitivesPolymorphismBaseGrandChildA' has a wrong offset!");
static_assert(offsetof(FDlgTestStructPrimitives, ObjectPrimitivesPolymorphismChildGrandChildA) == 0x0001A0, "Member 'FDlgTestStructPrimitives::ObjectPrimitivesPolymorphismChildGrandChildA' has a wrong offset!");

// ScriptStruct DlgSystem.DlgTestMapPrimitive
// 0x04B8 (0x04B8 - 0x0000)
struct FDlgTestMapPrimitive final
{
public:
	uint8                                         Pad_17A5[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<int32, int32>                            EmptyMap;                                          // 0x0008(0x0050)(NativeAccessSpecifierPublic)
	TMap<int32, int32>                            Int32ToInt32Map;                                   // 0x0058(0x0050)(NativeAccessSpecifierPublic)
	TMap<int64, int64>                            Int64ToInt64Map;                                   // 0x00A8(0x0050)(NativeAccessSpecifierPublic)
	TMap<int32, class FString>                    Int32ToStringMap;                                  // 0x00F8(0x0050)(NativeAccessSpecifierPublic)
	TMap<int32, class FName>                      Int32ToNameMap;                                    // 0x0148(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, int32>                    StringToInt32Map;                                  // 0x0198(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, class FString>            StringToStringMap;                                 // 0x01E8(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, int32>                      NameToInt32Map;                                    // 0x0238(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, class FName>                NameToNameMap;                                     // 0x0288(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, float>                    StringToFloatMap;                                  // 0x02D8(0x0050)(NativeAccessSpecifierPublic)
	TMap<int32, float>                            Int32ToFloatMap;                                   // 0x0328(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FName, struct FColor>              NameToColorMap;                                    // 0x0378(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, class UDlgTestObjectPrimitivesBase*> ObjectConstantNullMap;                             // 0x03C8(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, class UDlgTestObjectPrimitivesBase*> ObjectFrequentsNullsMap;                           // 0x0418(0x0050)(NativeAccessSpecifierPublic)
	TMap<class FString, class UDlgTestObjectPrimitivesBase*> ObjectPrimitivesAllMap;                            // 0x0468(0x0050)(NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgTestMapPrimitive) == 0x000008, "Wrong alignment on FDlgTestMapPrimitive");
static_assert(sizeof(FDlgTestMapPrimitive) == 0x0004B8, "Wrong size on FDlgTestMapPrimitive");
static_assert(offsetof(FDlgTestMapPrimitive, EmptyMap) == 0x000008, "Member 'FDlgTestMapPrimitive::EmptyMap' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, Int32ToInt32Map) == 0x000058, "Member 'FDlgTestMapPrimitive::Int32ToInt32Map' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, Int64ToInt64Map) == 0x0000A8, "Member 'FDlgTestMapPrimitive::Int64ToInt64Map' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, Int32ToStringMap) == 0x0000F8, "Member 'FDlgTestMapPrimitive::Int32ToStringMap' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, Int32ToNameMap) == 0x000148, "Member 'FDlgTestMapPrimitive::Int32ToNameMap' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, StringToInt32Map) == 0x000198, "Member 'FDlgTestMapPrimitive::StringToInt32Map' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, StringToStringMap) == 0x0001E8, "Member 'FDlgTestMapPrimitive::StringToStringMap' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, NameToInt32Map) == 0x000238, "Member 'FDlgTestMapPrimitive::NameToInt32Map' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, NameToNameMap) == 0x000288, "Member 'FDlgTestMapPrimitive::NameToNameMap' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, StringToFloatMap) == 0x0002D8, "Member 'FDlgTestMapPrimitive::StringToFloatMap' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, Int32ToFloatMap) == 0x000328, "Member 'FDlgTestMapPrimitive::Int32ToFloatMap' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, NameToColorMap) == 0x000378, "Member 'FDlgTestMapPrimitive::NameToColorMap' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, ObjectConstantNullMap) == 0x0003C8, "Member 'FDlgTestMapPrimitive::ObjectConstantNullMap' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, ObjectFrequentsNullsMap) == 0x000418, "Member 'FDlgTestMapPrimitive::ObjectFrequentsNullsMap' has a wrong offset!");
static_assert(offsetof(FDlgTestMapPrimitive, ObjectPrimitivesAllMap) == 0x000468, "Member 'FDlgTestMapPrimitive::ObjectPrimitivesAllMap' has a wrong offset!");

// ScriptStruct DlgSystem.DlgTestArrayPrimitive
// 0x00A8 (0x00A8 - 0x0000)
struct FDlgTestArrayPrimitive final
{
public:
	uint8                                         Pad_17A6[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<int32>                                 EmptyArray;                                        // 0x0008(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Num1_Array;                                        // 0x0018(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                 Int32Array;                                        // 0x0028(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int64>                                 Int64Array;                                        // 0x0038(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<bool>                                  BoolArray;                                         // 0x0048(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<float>                                 FloatArray;                                        // 0x0058(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<EDlgTestEnum>                          EnumArray;                                         // 0x0068(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                           NameArray;                                         // 0x0078(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FString>                         StringArray;                                       // 0x0088(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UDlgTestObjectPrimitivesBase*>   ObjectArrayConstantNulls;                          // 0x0098(0x0010)(ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FDlgTestArrayPrimitive) == 0x000008, "Wrong alignment on FDlgTestArrayPrimitive");
static_assert(sizeof(FDlgTestArrayPrimitive) == 0x0000A8, "Wrong size on FDlgTestArrayPrimitive");
static_assert(offsetof(FDlgTestArrayPrimitive, EmptyArray) == 0x000008, "Member 'FDlgTestArrayPrimitive::EmptyArray' has a wrong offset!");
static_assert(offsetof(FDlgTestArrayPrimitive, Num1_Array) == 0x000018, "Member 'FDlgTestArrayPrimitive::Num1_Array' has a wrong offset!");
static_assert(offsetof(FDlgTestArrayPrimitive, Int32Array) == 0x000028, "Member 'FDlgTestArrayPrimitive::Int32Array' has a wrong offset!");
static_assert(offsetof(FDlgTestArrayPrimitive, Int64Array) == 0x000038, "Member 'FDlgTestArrayPrimitive::Int64Array' has a wrong offset!");
static_assert(offsetof(FDlgTestArrayPrimitive, BoolArray) == 0x000048, "Member 'FDlgTestArrayPrimitive::BoolArray' has a wrong offset!");
static_assert(offsetof(FDlgTestArrayPrimitive, FloatArray) == 0x000058, "Member 'FDlgTestArrayPrimitive::FloatArray' has a wrong offset!");
static_assert(offsetof(FDlgTestArrayPrimitive, EnumArray) == 0x000068, "Member 'FDlgTestArrayPrimitive::EnumArray' has a wrong offset!");
static_assert(offsetof(FDlgTestArrayPrimitive, NameArray) == 0x000078, "Member 'FDlgTestArrayPrimitive::NameArray' has a wrong offset!");
static_assert(offsetof(FDlgTestArrayPrimitive, StringArray) == 0x000088, "Member 'FDlgTestArrayPrimitive::StringArray' has a wrong offset!");
static_assert(offsetof(FDlgTestArrayPrimitive, ObjectArrayConstantNulls) == 0x000098, "Member 'FDlgTestArrayPrimitive::ObjectArrayConstantNulls' has a wrong offset!");

// ScriptStruct DlgSystem.DlgTestSetPrimitive
// 0x0238 (0x0238 - 0x0000)
struct FDlgTestSetPrimitive final
{
public:
	uint8                                         Pad_17A7[0x8];                                     // 0x0000(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	TSet<int32>                                   EmptySet;                                          // 0x0008(0x0050)(NativeAccessSpecifierPublic)
	TSet<int32>                                   Num1_Set;                                          // 0x0058(0x0050)(NativeAccessSpecifierPublic)
	TSet<int32>                                   Int32Set;                                          // 0x00A8(0x0050)(NativeAccessSpecifierPublic)
