#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_hair_71_AB

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass f_hair_71_AB.f_hair_71_AB_C
// 0x3AF0 (0x3ED0 - 0x03E0)
class UF_hair_71_AB_C final : public UHottaHairAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x03E8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x0418(0x00E8)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x0500(0x0320)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0820(0x0020)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x0840(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x0B60(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x0E80(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x11A0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x14C0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x17E0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x1B00(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x1E20(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x2140(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x2460(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x2780(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x2AA0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x2DC0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x30E0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x3400(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x3720(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x3A40(0x0320)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x3D60(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x3E00(0x0080)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x3E80(0x0020)()
	struct FKawaiiPhysicsSettings                 Physics_Settings;                                  // 0x3EA0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_0;                                // 0x3EB8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

public:
	void ExecuteUbergraph_f_hair_71_AB(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"f_hair_71_AB_C">();
	}
	static class UF_hair_71_AB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_hair_71_AB_C>();
	}
};
static_assert(alignof(UF_hair_71_AB_C) == 0x000010, "Wrong alignment on UF_hair_71_AB_C");
static_assert(sizeof(UF_hair_71_AB_C) == 0x003ED0, "Wrong size on UF_hair_71_AB_C");
static_assert(offsetof(UF_hair_71_AB_C, UberGraphFrame) == 0x0003E0, "Member 'UF_hair_71_AB_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_Root) == 0x0003E8, "Member 'UF_hair_71_AB_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_BlendSpacePlayer) == 0x000418, "Member 'UF_hair_71_AB_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_17) == 0x000500, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_LocalToComponentSpace) == 0x000820, "Member 'UF_hair_71_AB_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_16) == 0x000840, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_15) == 0x000B60, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_14) == 0x000E80, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_13) == 0x0011A0, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_12) == 0x0014C0, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_11) == 0x0017E0, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_10) == 0x001B00, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_9) == 0x001E20, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_8) == 0x002140, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_7) == 0x002460, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_6) == 0x002780, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_5) == 0x002AA0, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_4) == 0x002DC0, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_3) == 0x0030E0, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_2) == 0x003400, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics_1) == 0x003720, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_KawaiiPhysics) == 0x003A40, "Member 'UF_hair_71_AB_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_BlendListByBool) == 0x003D60, "Member 'UF_hair_71_AB_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_SequencePlayer) == 0x003E00, "Member 'UF_hair_71_AB_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, AnimGraphNode_ComponentToLocalSpace) == 0x003E80, "Member 'UF_hair_71_AB_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, Physics_Settings) == 0x003EA0, "Member 'UF_hair_71_AB_C::Physics_Settings' has a wrong offset!");
static_assert(offsetof(UF_hair_71_AB_C, Physics_Settings_0) == 0x003EB8, "Member 'UF_hair_71_AB_C::Physics_Settings_0' has a wrong offset!");

}

