#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_mimicry_fashion_04_hair_AB

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass f_mimicry_fashion_04_hair_AB.f_mimicry_fashion_04_hair_AB_C
// 0x4540 (0x4920 - 0x03E0)
class UF_mimicry_fashion_04_hair_AB_C final : public UHottaHairAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x03E8(0x00E8)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x04D0(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x04F0(0x0020)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_1;                   // 0x0510(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x05B0(0x0080)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_19;                    // 0x0630(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_18;                    // 0x0950(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_17;                    // 0x0C70(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_16;                    // 0x0F90(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_15;                    // 0x12B0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_14;                    // 0x15D0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_13;                    // 0x18F0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_12;                    // 0x1C10(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_11;                    // 0x1F30(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_10;                    // 0x2250(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_9;                     // 0x2570(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_8;                     // 0x2890(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_7;                     // 0x2BB0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_6;                     // 0x2ED0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_5;                     // 0x31F0(0x0320)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x3510(0x0030)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_4;                     // 0x3540(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_3;                     // 0x3860(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_2;                     // 0x3B80(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_1;                     // 0x3EA0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics;                       // 0x41C0(0x0320)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose;                      // 0x44E0(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool;                     // 0x4638(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_1;                     // 0x46D8(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose;                       // 0x4700(0x0028)()
	struct FAnimNode_HottaBonesModify             AnimGraphNode_HottaBonesModify;                    // 0x4728(0x0100)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x4828(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x4848(0x0020)()
	struct FKawaiiPhysicsSettings                 Physics_Settings;                                  // 0x4868(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_0;                                // 0x4880(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_1;                                // 0x4898(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_2;                                // 0x48B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_3;                                // 0x48C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_4;                                // 0x48E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FKawaiiPhysicsSettings                 Physics_Settings_5;                                // 0x48F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	float                                         Dummy_Bone_Length;                                 // 0x4910(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_f_mimicry_fashion_04_hair_AB(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"f_mimicry_fashion_04_hair_AB_C">();
	}
	static class UF_mimicry_fashion_04_hair_AB_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_mimicry_fashion_04_hair_AB_C>();
	}
};
static_assert(alignof(UF_mimicry_fashion_04_hair_AB_C) == 0x000010, "Wrong alignment on UF_mimicry_fashion_04_hair_AB_C");
static_assert(sizeof(UF_mimicry_fashion_04_hair_AB_C) == 0x004920, "Wrong size on UF_mimicry_fashion_04_hair_AB_C");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, UberGraphFrame) == 0x0003E0, "Member 'UF_mimicry_fashion_04_hair_AB_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_BlendSpacePlayer) == 0x0003E8, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_LocalToComponentSpace_1) == 0x0004D0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_LocalToComponentSpace_1' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_ComponentToLocalSpace_1) == 0x0004F0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_ComponentToLocalSpace_1' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_BlendListByBool_1) == 0x000510, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_BlendListByBool_1' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_SequencePlayer) == 0x0005B0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_19) == 0x000630, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_19' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_18) == 0x000950, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_18' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_17) == 0x000C70, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_17' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_16) == 0x000F90, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_16' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_15) == 0x0012B0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_15' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_14) == 0x0015D0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_14' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_13) == 0x0018F0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_13' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_12) == 0x001C10, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_12' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_11) == 0x001F30, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_11' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_10) == 0x002250, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_10' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_9) == 0x002570, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_9' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_8) == 0x002890, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_8' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_7) == 0x002BB0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_7' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_6) == 0x002ED0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_6' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_5) == 0x0031F0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_5' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_Root) == 0x003510, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_4) == 0x003540, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_4' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_3) == 0x003860, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_3' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_2) == 0x003B80, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_2' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics_1) == 0x003EA0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics_1' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_KawaiiPhysics) == 0x0041C0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_KawaiiPhysics' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_SaveCachedPose) == 0x0044E0, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_SaveCachedPose' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_BlendListByBool) == 0x004638, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_BlendListByBool' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_UseCachedPose_1) == 0x0046D8, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_UseCachedPose_1' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_UseCachedPose) == 0x004700, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_UseCachedPose' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_HottaBonesModify) == 0x004728, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_HottaBonesModify' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_LocalToComponentSpace) == 0x004828, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, AnimGraphNode_ComponentToLocalSpace) == 0x004848, "Member 'UF_mimicry_fashion_04_hair_AB_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, Physics_Settings) == 0x004868, "Member 'UF_mimicry_fashion_04_hair_AB_C::Physics_Settings' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, Physics_Settings_0) == 0x004880, "Member 'UF_mimicry_fashion_04_hair_AB_C::Physics_Settings_0' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, Physics_Settings_1) == 0x004898, "Member 'UF_mimicry_fashion_04_hair_AB_C::Physics_Settings_1' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, Physics_Settings_2) == 0x0048B0, "Member 'UF_mimicry_fashion_04_hair_AB_C::Physics_Settings_2' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, Physics_Settings_3) == 0x0048C8, "Member 'UF_mimicry_fashion_04_hair_AB_C::Physics_Settings_3' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, Physics_Settings_4) == 0x0048E0, "Member 'UF_mimicry_fashion_04_hair_AB_C::Physics_Settings_4' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, Physics_Settings_5) == 0x0048F8, "Member 'UF_mimicry_fashion_04_hair_AB_C::Physics_Settings_5' has a wrong offset!");
static_assert(offsetof(UF_mimicry_fashion_04_hair_AB_C, Dummy_Bone_Length) == 0x004910, "Member 'UF_mimicry_fashion_04_hair_AB_C::Dummy_Bone_Length' has a wrong offset!");

}

