#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_Player_SuperEnergyRopeSubAnimGraph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_Player_SuperEnergyRopeSubAnimGraph.F_Player_SuperEnergyRopeSubAnimGraph_C
// 0x0490 (0x0760 - 0x02D0)
class UF_Player_SuperEnergyRopeSubAnimGraph_C final : public UQRSLSuperEnergyRopeAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02D8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_3;                  // 0x0308(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_2;                  // 0x03F0(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_1;                  // 0x04D8(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer;                    // 0x05C0(0x00E8)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum;                     // 0x06A8(0x00B0)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void ExecuteUbergraph_F_Player_SuperEnergyRopeSubAnimGraph(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_Player_SuperEnergyRopeSubAnimGraph_C">();
	}
	static class UF_Player_SuperEnergyRopeSubAnimGraph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_Player_SuperEnergyRopeSubAnimGraph_C>();
	}
};
static_assert(alignof(UF_Player_SuperEnergyRopeSubAnimGraph_C) == 0x000010, "Wrong alignment on UF_Player_SuperEnergyRopeSubAnimGraph_C");
static_assert(sizeof(UF_Player_SuperEnergyRopeSubAnimGraph_C) == 0x000760, "Wrong size on UF_Player_SuperEnergyRopeSubAnimGraph_C");
static_assert(offsetof(UF_Player_SuperEnergyRopeSubAnimGraph_C, UberGraphFrame) == 0x0002D0, "Member 'UF_Player_SuperEnergyRopeSubAnimGraph_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_Player_SuperEnergyRopeSubAnimGraph_C, AnimGraphNode_Root) == 0x0002D8, "Member 'UF_Player_SuperEnergyRopeSubAnimGraph_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_Player_SuperEnergyRopeSubAnimGraph_C, AnimGraphNode_BlendSpacePlayer_3) == 0x000308, "Member 'UF_Player_SuperEnergyRopeSubAnimGraph_C::AnimGraphNode_BlendSpacePlayer_3' has a wrong offset!");
static_assert(offsetof(UF_Player_SuperEnergyRopeSubAnimGraph_C, AnimGraphNode_BlendSpacePlayer_2) == 0x0003F0, "Member 'UF_Player_SuperEnergyRopeSubAnimGraph_C::AnimGraphNode_BlendSpacePlayer_2' has a wrong offset!");
static_assert(offsetof(UF_Player_SuperEnergyRopeSubAnimGraph_C, AnimGraphNode_BlendSpacePlayer_1) == 0x0004D8, "Member 'UF_Player_SuperEnergyRopeSubAnimGraph_C::AnimGraphNode_BlendSpacePlayer_1' has a wrong offset!");
static_assert(offsetof(UF_Player_SuperEnergyRopeSubAnimGraph_C, AnimGraphNode_BlendSpacePlayer) == 0x0005C0, "Member 'UF_Player_SuperEnergyRopeSubAnimGraph_C::AnimGraphNode_BlendSpacePlayer' has a wrong offset!");
static_assert(offsetof(UF_Player_SuperEnergyRopeSubAnimGraph_C, AnimGraphNode_BlendListByEnum) == 0x0006A8, "Member 'UF_Player_SuperEnergyRopeSubAnimGraph_C::AnimGraphNode_BlendListByEnum' has a wrong offset!");

}

