#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_Player_QingGongSubAnimGraph

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass F_Player_QingGongSubAnimGraph.F_Player_QingGongSubAnimGraph_C
// 0x0390 (0x0670 - 0x02E0)
class UF_Player_QingGongSubAnimGraph_C final : public UQRSLQingGongAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02E0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02E8(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_4;                  // 0x0318(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_3;                  // 0x0340(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_2;                  // 0x0368(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_1;                  // 0x0390(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult;                    // 0x03B8(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_1;                    // 0x03E0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_2;                       // 0x0460(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x0490(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_1;                       // 0x0510(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0540(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0570(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0620(0x0048)()

public:
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_F_Player_QingGongSubAnimGraph_AnimGraphNode_TransitionResult_C8C750BA4ECDD95DE12FA68EF218D816();
	void ExecuteUbergraph_F_Player_QingGongSubAnimGraph(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"F_Player_QingGongSubAnimGraph_C">();
	}
	static class UF_Player_QingGongSubAnimGraph_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UF_Player_QingGongSubAnimGraph_C>();
	}
};
static_assert(alignof(UF_Player_QingGongSubAnimGraph_C) == 0x000010, "Wrong alignment on UF_Player_QingGongSubAnimGraph_C");
static_assert(sizeof(UF_Player_QingGongSubAnimGraph_C) == 0x000670, "Wrong size on UF_Player_QingGongSubAnimGraph_C");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, UberGraphFrame) == 0x0002E0, "Member 'UF_Player_QingGongSubAnimGraph_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_Root) == 0x0002E8, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_TransitionResult_4) == 0x000318, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_TransitionResult_4' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_TransitionResult_3) == 0x000340, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_TransitionResult_3' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_TransitionResult_2) == 0x000368, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_TransitionResult_2' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_TransitionResult_1) == 0x000390, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_TransitionResult_1' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_TransitionResult) == 0x0003B8, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_TransitionResult' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_SequencePlayer_1) == 0x0003E0, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_SequencePlayer_1' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_StateResult_2) == 0x000460, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_StateResult_2' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_SequencePlayer) == 0x000490, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_StateResult_1) == 0x000510, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_StateResult_1' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_StateResult) == 0x000540, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_StateMachine) == 0x000570, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UF_Player_QingGongSubAnimGraph_C, AnimGraphNode_Slot) == 0x000620, "Member 'UF_Player_QingGongSubAnimGraph_C::AnimGraphNode_Slot' has a wrong offset!");

}

