#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: F_player_Skeleton_AB_UI

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function f_player_Skeleton_AB_UI.f_player_Skeleton_AB_UI_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct F_player_Skeleton_AB_UI_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(F_player_Skeleton_AB_UI_C_AnimGraph) == 0x000008, "Wrong alignment on F_player_Skeleton_AB_UI_C_AnimGraph");
static_assert(sizeof(F_player_Skeleton_AB_UI_C_AnimGraph) == 0x000010, "Wrong size on F_player_Skeleton_AB_UI_C_AnimGraph");
static_assert(offsetof(F_player_Skeleton_AB_UI_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'F_player_Skeleton_AB_UI_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function f_player_Skeleton_AB_UI.f_player_Skeleton_AB_UI_C.ExecuteUbergraph_f_player_Skeleton_AB_UI
// 0x0004 (0x0004 - 0x0000)
struct F_player_Skeleton_AB_UI_C_ExecuteUbergraph_f_player_Skeleton_AB_UI final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(F_player_Skeleton_AB_UI_C_ExecuteUbergraph_f_player_Skeleton_AB_UI) == 0x000004, "Wrong alignment on F_player_Skeleton_AB_UI_C_ExecuteUbergraph_f_player_Skeleton_AB_UI");
static_assert(sizeof(F_player_Skeleton_AB_UI_C_ExecuteUbergraph_f_player_Skeleton_AB_UI) == 0x000004, "Wrong size on F_player_Skeleton_AB_UI_C_ExecuteUbergraph_f_player_Skeleton_AB_UI");
static_assert(offsetof(F_player_Skeleton_AB_UI_C_ExecuteUbergraph_f_player_Skeleton_AB_UI, EntryPoint) == 0x000000, "Member 'F_player_Skeleton_AB_UI_C_ExecuteUbergraph_f_player_Skeleton_AB_UI::EntryPoint' has a wrong offset!");

}

