#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Female_player

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function female_player.female_player_C.SpawnDynamicSand
// 0x01B0 (0x01B0 - 0x0000)
struct Female_player_C_SpawnDynamicSand final
{
public:
	class UStaticMeshComponent*                   FootPrint;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         ___object_Variable;                                // 0x0008(0x0010)(ConstParm, ReferenceParm)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0018(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55AD[0xC];                                     // 0x0024(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_MakeTransform_ReturnValue;                // 0x0030(0x0030)(IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue;             // 0x0060(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55AE[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Add_VectorVector_ReturnValue_1;           // 0x0078(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55AF[0x4];                                     // 0x0084(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_FootPrintDynamicIntancity_C*        CallFunc_FinishSpawningActor_ReturnValue;          // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_LineTraceSingle_OutHit;                   // 0x0090(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          CallFunc_LineTraceSingle_ReturnValue;              // 0x011C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bBlockingHit;              // 0x011D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BreakHitResult_bInitialOverlap;           // 0x011E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B0[0x1];                                     // 0x011F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_BreakHitResult_Time;                      // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakHitResult_Distance;                  // 0x0124(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Location;                  // 0x0128(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactPoint;               // 0x0134(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_Normal;                    // 0x0140(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_ImpactNormal;              // 0x014C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPhysicalMaterial*                      CallFunc_BreakHitResult_PhysMat;                   // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_BreakHitResult_HitActor;                  // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    CallFunc_BreakHitResult_HitComponent;              // 0x0168(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_BreakHitResult_HitBoneName;               // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_HitItem;                   // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_BreakHitResult_FaceIndex;                 // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceStart;                // 0x0180(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_BreakHitResult_TraceEnd;                  // 0x018C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Dot_VectorVector_ReturnValue;             // 0x0198(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x019C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Lerp_ReturnValue;                         // 0x01A0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Female_player_C_SpawnDynamicSand) == 0x000010, "Wrong alignment on Female_player_C_SpawnDynamicSand");
static_assert(sizeof(Female_player_C_SpawnDynamicSand) == 0x0001B0, "Wrong size on Female_player_C_SpawnDynamicSand");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, FootPrint) == 0x000000, "Member 'Female_player_C_SpawnDynamicSand::FootPrint' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, ___object_Variable) == 0x000008, "Member 'Female_player_C_SpawnDynamicSand::___object_Variable' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000018, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_MakeTransform_ReturnValue) == 0x000030, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_MakeTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_Add_VectorVector_ReturnValue) == 0x000060, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_Add_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000070, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_Add_VectorVector_ReturnValue_1) == 0x000078, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_Add_VectorVector_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_FinishSpawningActor_ReturnValue) == 0x000088, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_LineTraceSingle_OutHit) == 0x000090, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_LineTraceSingle_OutHit' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_LineTraceSingle_ReturnValue) == 0x00011C, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_LineTraceSingle_ReturnValue' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_bBlockingHit) == 0x00011D, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_bBlockingHit' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_bInitialOverlap) == 0x00011E, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_bInitialOverlap' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_Time) == 0x000120, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_Time' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_Distance) == 0x000124, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_Distance' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_Location) == 0x000128, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_Location' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_ImpactPoint) == 0x000134, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_ImpactPoint' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_Normal) == 0x000140, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_Normal' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_ImpactNormal) == 0x00014C, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_ImpactNormal' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_PhysMat) == 0x000158, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_PhysMat' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_HitActor) == 0x000160, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_HitActor' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_HitComponent) == 0x000168, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_HitComponent' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_HitBoneName) == 0x000170, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_HitBoneName' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_HitItem) == 0x000178, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_HitItem' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_FaceIndex) == 0x00017C, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_FaceIndex' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_TraceStart) == 0x000180, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_TraceStart' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_BreakHitResult_TraceEnd) == 0x00018C, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_BreakHitResult_TraceEnd' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_Dot_VectorVector_ReturnValue) == 0x000198, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_Dot_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00019C, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Female_player_C_SpawnDynamicSand, CallFunc_Lerp_ReturnValue) == 0x0001A0, "Member 'Female_player_C_SpawnDynamicSand::CallFunc_Lerp_ReturnValue' has a wrong offset!");

// Function female_player.female_player_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct Female_player_C_ReceiveTick final
{
public:
	float                                         Param_DeltaSeconds;                                // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Female_player_C_ReceiveTick) == 0x000004, "Wrong alignment on Female_player_C_ReceiveTick");
static_assert(sizeof(Female_player_C_ReceiveTick) == 0x000004, "Wrong size on Female_player_C_ReceiveTick");
static_assert(offsetof(Female_player_C_ReceiveTick, Param_DeltaSeconds) == 0x000000, "Member 'Female_player_C_ReceiveTick::Param_DeltaSeconds' has a wrong offset!");

// Function female_player.female_player_C.ExecuteUbergraph_female_player
// 0x0008 (0x0008 - 0x0000)
struct Female_player_C_ExecuteUbergraph_female_player final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Female_player_C_ExecuteUbergraph_female_player) == 0x000004, "Wrong alignment on Female_player_C_ExecuteUbergraph_female_player");
static_assert(sizeof(Female_player_C_ExecuteUbergraph_female_player) == 0x000008, "Wrong size on Female_player_C_ExecuteUbergraph_female_player");
static_assert(offsetof(Female_player_C_ExecuteUbergraph_female_player, EntryPoint) == 0x000000, "Member 'Female_player_C_ExecuteUbergraph_female_player::EntryPoint' has a wrong offset!");
static_assert(offsetof(Female_player_C_ExecuteUbergraph_female_player, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'Female_player_C_ExecuteUbergraph_female_player::K2Node_Event_DeltaSeconds' has a wrong offset!");

}

