#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPA_MarkRobt_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FPA_Base_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FPA_MarkRobt_BP.FPA_MarkRobt_BP_C
// 0x0020 (0x02C8 - 0x02A8)
class AFPA_MarkRobt_BP_C final : public AFPA_Base_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_FPA_MarkRobt_BP_C;                  // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_Opacity_End_AE6E75E64E3B1801EAB00EA6B2477279; // 0x02B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_Opacity_Start_AE6E75E64E3B1801EAB00EA6B2477279; // 0x02B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_AE6E75E64E3B1801EAB00EA6B2477279; // 0x02B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B4[0x7];                                     // 0x02B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x02C0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void ExecuteUbergraph_FPA_MarkRobt_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FPA_MarkRobt_BP_C">();
	}
	static class AFPA_MarkRobt_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFPA_MarkRobt_BP_C>();
	}
};
static_assert(alignof(AFPA_MarkRobt_BP_C) == 0x000008, "Wrong alignment on AFPA_MarkRobt_BP_C");
static_assert(sizeof(AFPA_MarkRobt_BP_C) == 0x0002C8, "Wrong size on AFPA_MarkRobt_BP_C");
static_assert(offsetof(AFPA_MarkRobt_BP_C, UberGraphFrame_FPA_MarkRobt_BP_C) == 0x0002A8, "Member 'AFPA_MarkRobt_BP_C::UberGraphFrame_FPA_MarkRobt_BP_C' has a wrong offset!");
static_assert(offsetof(AFPA_MarkRobt_BP_C, Timeline_0_Opacity_End_AE6E75E64E3B1801EAB00EA6B2477279) == 0x0002B0, "Member 'AFPA_MarkRobt_BP_C::Timeline_0_Opacity_End_AE6E75E64E3B1801EAB00EA6B2477279' has a wrong offset!");
static_assert(offsetof(AFPA_MarkRobt_BP_C, Timeline_0_Opacity_Start_AE6E75E64E3B1801EAB00EA6B2477279) == 0x0002B4, "Member 'AFPA_MarkRobt_BP_C::Timeline_0_Opacity_Start_AE6E75E64E3B1801EAB00EA6B2477279' has a wrong offset!");
static_assert(offsetof(AFPA_MarkRobt_BP_C, Timeline_0__Direction_AE6E75E64E3B1801EAB00EA6B2477279) == 0x0002B8, "Member 'AFPA_MarkRobt_BP_C::Timeline_0__Direction_AE6E75E64E3B1801EAB00EA6B2477279' has a wrong offset!");
static_assert(offsetof(AFPA_MarkRobt_BP_C, Timeline_0) == 0x0002C0, "Member 'AFPA_MarkRobt_BP_C::Timeline_0' has a wrong offset!");

}

