#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPA_Snow_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FPA_Base_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FPA_Snow_BP.FPA_Snow_BP_C
// 0x0018 (0x02C0 - 0x02A8)
class AFPA_Snow_BP_C final : public AFPA_Base_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_FPA_Snow_BP_C;                      // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USilentCheckComponent*                  SilentCheck;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               P_Interaction_Dust004;                             // 0x02B8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_FPA_Snow_BP(int32 EntryPoint);
	void ReMaintainAndFade();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FPA_Snow_BP_C">();
	}
	static class AFPA_Snow_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFPA_Snow_BP_C>();
	}
};
static_assert(alignof(AFPA_Snow_BP_C) == 0x000008, "Wrong alignment on AFPA_Snow_BP_C");
static_assert(sizeof(AFPA_Snow_BP_C) == 0x0002C0, "Wrong size on AFPA_Snow_BP_C");
static_assert(offsetof(AFPA_Snow_BP_C, UberGraphFrame_FPA_Snow_BP_C) == 0x0002A8, "Member 'AFPA_Snow_BP_C::UberGraphFrame_FPA_Snow_BP_C' has a wrong offset!");
static_assert(offsetof(AFPA_Snow_BP_C, SilentCheck) == 0x0002B0, "Member 'AFPA_Snow_BP_C::SilentCheck' has a wrong offset!");
static_assert(offsetof(AFPA_Snow_BP_C, P_Interaction_Dust004) == 0x0002B8, "Member 'AFPA_Snow_BP_C::P_Interaction_Dust004' has a wrong offset!");

}

