#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPA_Base_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function FPA_Base_BP.FPA_Base_BP_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct FPA_Base_BP_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPA_Base_BP_C_ReceiveTick) == 0x000004, "Wrong alignment on FPA_Base_BP_C_ReceiveTick");
static_assert(sizeof(FPA_Base_BP_C_ReceiveTick) == 0x000004, "Wrong size on FPA_Base_BP_C_ReceiveTick");
static_assert(offsetof(FPA_Base_BP_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'FPA_Base_BP_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function FPA_Base_BP.FPA_Base_BP_C.ExecuteUbergraph_FPA_Base_BP
// 0x0058 (0x0058 - 0x0000)
struct FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	class UMaterialInterface*                     CallFunc_GetMaterial_ReturnValue;                  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0038(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue_1;        // 0x0040(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5813[0x3];                                     // 0x004D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP) == 0x000008, "Wrong alignment on FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP");
static_assert(sizeof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP) == 0x000058, "Wrong size on FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, EntryPoint) == 0x000000, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, K2Node_Event_DeltaSeconds) == 0x000004, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, CallFunc_GetMaterial_ReturnValue) == 0x000028, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::CallFunc_GetMaterial_ReturnValue' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, CallFunc_CreateDynamicMaterialInstance_ReturnValue) == 0x000030, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::CallFunc_CreateDynamicMaterialInstance_ReturnValue' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000038, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, CallFunc_K2_SetTimerDelegate_ReturnValue_1) == 0x000040, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::CallFunc_K2_SetTimerDelegate_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue) == 0x000048, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::CallFunc_K2_GetTimerElapsedTimeHandle_ReturnValue' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, CallFunc_Greater_FloatFloat_ReturnValue) == 0x00004C, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, CallFunc_Divide_FloatFloat_ReturnValue) == 0x000050, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000054, "Member 'FPA_Base_BP_C_ExecuteUbergraph_FPA_Base_BP::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");

}

