#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPA_Imitation3_Ice

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FPA_Base_BP_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass FPA_Imitation3_Ice.FPA_Imitation3_Ice_C
// 0x0028 (0x02D0 - 0x02A8)
class AFPA_Imitation3_Ice_C final : public AFPA_Base_BP_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_FPA_Imitation3_Ice_C;               // 0x02A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USilentCheckComponent*                  SilentCheck;                                       // 0x02B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ProcessMaterialEffect_Opacity_End_7AA77F0E43CAC760B56D70BCBCD7A884; // 0x02B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_ProcessMaterialEffect_Opacity_Start_7AA77F0E43CAC760B56D70BCBCD7A884; // 0x02BC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_ProcessMaterialEffect__Direction_7AA77F0E43CAC760B56D70BCBCD7A884; // 0x02C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_55B3[0x7];                                     // 0x02C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_ProcessMaterialEffect;                    // 0x02C8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Timeline_ProcessMaterialEffect__FinishedFunc();
	void Timeline_ProcessMaterialEffect__UpdateFunc();
	void ReceiveBeginPlay();
	void ProcessMaterialEffect();
	void ExecuteUbergraph_FPA_Imitation3_Ice(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"FPA_Imitation3_Ice_C">();
	}
	static class AFPA_Imitation3_Ice_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFPA_Imitation3_Ice_C>();
	}
};
static_assert(alignof(AFPA_Imitation3_Ice_C) == 0x000008, "Wrong alignment on AFPA_Imitation3_Ice_C");
static_assert(sizeof(AFPA_Imitation3_Ice_C) == 0x0002D0, "Wrong size on AFPA_Imitation3_Ice_C");
static_assert(offsetof(AFPA_Imitation3_Ice_C, UberGraphFrame_FPA_Imitation3_Ice_C) == 0x0002A8, "Member 'AFPA_Imitation3_Ice_C::UberGraphFrame_FPA_Imitation3_Ice_C' has a wrong offset!");
static_assert(offsetof(AFPA_Imitation3_Ice_C, SilentCheck) == 0x0002B0, "Member 'AFPA_Imitation3_Ice_C::SilentCheck' has a wrong offset!");
static_assert(offsetof(AFPA_Imitation3_Ice_C, Timeline_ProcessMaterialEffect_Opacity_End_7AA77F0E43CAC760B56D70BCBCD7A884) == 0x0002B8, "Member 'AFPA_Imitation3_Ice_C::Timeline_ProcessMaterialEffect_Opacity_End_7AA77F0E43CAC760B56D70BCBCD7A884' has a wrong offset!");
static_assert(offsetof(AFPA_Imitation3_Ice_C, Timeline_ProcessMaterialEffect_Opacity_Start_7AA77F0E43CAC760B56D70BCBCD7A884) == 0x0002BC, "Member 'AFPA_Imitation3_Ice_C::Timeline_ProcessMaterialEffect_Opacity_Start_7AA77F0E43CAC760B56D70BCBCD7A884' has a wrong offset!");
static_assert(offsetof(AFPA_Imitation3_Ice_C, Timeline_ProcessMaterialEffect__Direction_7AA77F0E43CAC760B56D70BCBCD7A884) == 0x0002C0, "Member 'AFPA_Imitation3_Ice_C::Timeline_ProcessMaterialEffect__Direction_7AA77F0E43CAC760B56D70BCBCD7A884' has a wrong offset!");
static_assert(offsetof(AFPA_Imitation3_Ice_C, Timeline_ProcessMaterialEffect) == 0x0002C8, "Member 'AFPA_Imitation3_Ice_C::Timeline_ProcessMaterialEffect' has a wrong offset!");

}

