#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: FPlayer_WeaponMountSubAnim

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function FPlayer_WeaponMountSubAnim.FPlayer_WeaponMountSubAnim_C.AnimGraph
// 0x0010 (0x0010 - 0x0000)
struct FPlayer_WeaponMountSubAnim_C_AnimGraph final
{
public:
	struct FPoseLink                              Param_AnimGraph;                                   // 0x0000(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(FPlayer_WeaponMountSubAnim_C_AnimGraph) == 0x000008, "Wrong alignment on FPlayer_WeaponMountSubAnim_C_AnimGraph");
static_assert(sizeof(FPlayer_WeaponMountSubAnim_C_AnimGraph) == 0x000010, "Wrong size on FPlayer_WeaponMountSubAnim_C_AnimGraph");
static_assert(offsetof(FPlayer_WeaponMountSubAnim_C_AnimGraph, Param_AnimGraph) == 0x000000, "Member 'FPlayer_WeaponMountSubAnim_C_AnimGraph::Param_AnimGraph' has a wrong offset!");

// Function FPlayer_WeaponMountSubAnim.FPlayer_WeaponMountSubAnim_C.BlueprintUpdateAnimation
// 0x0004 (0x0004 - 0x0000)
struct FPlayer_WeaponMountSubAnim_C_BlueprintUpdateAnimation final
{
public:
	float                                         DeltaTimeX;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPlayer_WeaponMountSubAnim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong alignment on FPlayer_WeaponMountSubAnim_C_BlueprintUpdateAnimation");
static_assert(sizeof(FPlayer_WeaponMountSubAnim_C_BlueprintUpdateAnimation) == 0x000004, "Wrong size on FPlayer_WeaponMountSubAnim_C_BlueprintUpdateAnimation");
static_assert(offsetof(FPlayer_WeaponMountSubAnim_C_BlueprintUpdateAnimation, DeltaTimeX) == 0x000000, "Member 'FPlayer_WeaponMountSubAnim_C_BlueprintUpdateAnimation::DeltaTimeX' has a wrong offset!");

// Function FPlayer_WeaponMountSubAnim.FPlayer_WeaponMountSubAnim_C.ExecuteUbergraph_FPlayer_WeaponMountSubAnim
// 0x0098 (0x0098 - 0x0000)
struct FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_DeltaTimeX;                           // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APawn*                                  CallFunc_TryGetPawnOwner_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C59[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHottaBreakStateRequest                K2Node_MakeStruct_HottaBreakStateRequest;          // 0x0020(0x0058)()
	struct FHottaStateOperationResult             CallFunc_BreakState_ReturnValue;                   // 0x0078(0x0018)()
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim) == 0x000008, "Wrong alignment on FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim");
static_assert(sizeof(FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim) == 0x000098, "Wrong size on FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim");
static_assert(offsetof(FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim, EntryPoint) == 0x000000, "Member 'FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim::EntryPoint' has a wrong offset!");
static_assert(offsetof(FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim, K2Node_Event_DeltaTimeX) == 0x000004, "Member 'FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim::K2Node_Event_DeltaTimeX' has a wrong offset!");
static_assert(offsetof(FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim, CallFunc_TryGetPawnOwner_ReturnValue) == 0x000008, "Member 'FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim::CallFunc_TryGetPawnOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000010, "Member 'FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim, K2Node_MakeStruct_HottaBreakStateRequest) == 0x000020, "Member 'FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim::K2Node_MakeStruct_HottaBreakStateRequest' has a wrong offset!");
static_assert(offsetof(FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim, CallFunc_BreakState_ReturnValue) == 0x000078, "Member 'FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim::CallFunc_BreakState_ReturnValue' has a wrong offset!");
static_assert(offsetof(FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim, CallFunc_BooleanAND_ReturnValue) == 0x000090, "Member 'FPlayer_WeaponMountSubAnim_C_ExecuteUbergraph_FPlayer_WeaponMountSubAnim::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

