#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Artifact_SR_004

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Artifact_SR_004.GA_Artifact_SR_004_C.K2_CanActivateAbility
// 0x0080 (0x0080 - 0x0000)
struct GA_Artifact_SR_004_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0048(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5823[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUnderWater_ReturnValue;                 // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Artifact_SR_004_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Artifact_SR_004_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Artifact_SR_004_C_K2_CanActivateAbility) == 0x000080, "Wrong size on GA_Artifact_SR_004_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Artifact_SR_004_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Artifact_SR_004_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Artifact_SR_004_C_K2_CanActivateAbility, RelevantTags) == 0x000048, "Member 'GA_Artifact_SR_004_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Artifact_SR_004_C_K2_CanActivateAbility, ReturnValue) == 0x000068, "Member 'GA_Artifact_SR_004_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Artifact_SR_004_C_K2_CanActivateAbility, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000070, "Member 'GA_Artifact_SR_004_C_K2_CanActivateAbility::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(GA_Artifact_SR_004_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'GA_Artifact_SR_004_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Artifact_SR_004_C_K2_CanActivateAbility, CallFunc_IsUnderWater_ReturnValue) == 0x000079, "Member 'GA_Artifact_SR_004_C_K2_CanActivateAbility::CallFunc_IsUnderWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Artifact_SR_004_C_K2_CanActivateAbility, CallFunc_Not_PreBool_ReturnValue) == 0x00007A, "Member 'GA_Artifact_SR_004_C_K2_CanActivateAbility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

