#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_Asuka_RevengeEnd

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_Asuka_RevengeEnd.GA_Asuka_RevengeEnd_C.ExecuteUbergraph_GA_Asuka_RevengeEnd
// 0x0020 (0x0020 - 0x0000)
struct GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_56C9[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAuthorityRole_ReturnValue;              // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd) == 0x000008, "Wrong alignment on GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd");
static_assert(sizeof(GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd) == 0x000020, "Wrong size on GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd, EntryPoint) == 0x000000, "Member 'GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000008, "Member 'GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd, K2Node_DynamicCast_AsHotta_Character) == 0x000010, "Member 'GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd, CallFunc_IsAuthorityRole_ReturnValue) == 0x000019, "Member 'GA_Asuka_RevengeEnd_C_ExecuteUbergraph_GA_Asuka_RevengeEnd::CallFunc_IsAuthorityRole_ReturnValue' has a wrong offset!");

// Function GA_Asuka_RevengeEnd.GA_Asuka_RevengeEnd_C.K2_CanActivateAbility
// 0x0080 (0x0080 - 0x0000)
struct GA_Asuka_RevengeEnd_C_K2_CanActivateAbility final
{
public:
	struct FGameplayAbilityActorInfo              ActorInfo;                                         // 0x0000(0x0048)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FGameplayTagContainer                  RelevantTags;                                      // 0x0048(0x0020)(Parm, OutParm)
	bool                                          ReturnValue;                                       // 0x0068(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_56CA[0x7];                                     // 0x0069(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMirrorCharacter_ReturnValue;            // 0x0079(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x007A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_Asuka_RevengeEnd_C_K2_CanActivateAbility) == 0x000008, "Wrong alignment on GA_Asuka_RevengeEnd_C_K2_CanActivateAbility");
static_assert(sizeof(GA_Asuka_RevengeEnd_C_K2_CanActivateAbility) == 0x000080, "Wrong size on GA_Asuka_RevengeEnd_C_K2_CanActivateAbility");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_K2_CanActivateAbility, ActorInfo) == 0x000000, "Member 'GA_Asuka_RevengeEnd_C_K2_CanActivateAbility::ActorInfo' has a wrong offset!");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_K2_CanActivateAbility, RelevantTags) == 0x000048, "Member 'GA_Asuka_RevengeEnd_C_K2_CanActivateAbility::RelevantTags' has a wrong offset!");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_K2_CanActivateAbility, ReturnValue) == 0x000068, "Member 'GA_Asuka_RevengeEnd_C_K2_CanActivateAbility::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_K2_CanActivateAbility, K2Node_DynamicCast_AsHotta_Character) == 0x000070, "Member 'GA_Asuka_RevengeEnd_C_K2_CanActivateAbility::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_K2_CanActivateAbility, K2Node_DynamicCast_bSuccess) == 0x000078, "Member 'GA_Asuka_RevengeEnd_C_K2_CanActivateAbility::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_K2_CanActivateAbility, CallFunc_IsMirrorCharacter_ReturnValue) == 0x000079, "Member 'GA_Asuka_RevengeEnd_C_K2_CanActivateAbility::CallFunc_IsMirrorCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_Asuka_RevengeEnd_C_K2_CanActivateAbility, CallFunc_Not_PreBool_ReturnValue) == 0x00007A, "Member 'GA_Asuka_RevengeEnd_C_K2_CanActivateAbility::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

