#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_EvadeMeleeBase

#include "Basic.hpp"

#include "GA_HottaSkillBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_EvadeMeleeBase.GA_EvadeMeleeBase_C
// 0x0020 (0x0D00 - 0x0CE0)
class UGA_EvadeMeleeBase_C : public UGA_HottaSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_EvadeMeleeBase_C;                // 0x0CE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   AttributeModifierFailedSection;                    // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaAbilityTask_JumpSection*          Async_Task;                                        // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_EvadeMeleeBase(int32 EntryPoint);
	void K2_TriggerJumpSection(class FName JumpSectionName);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnTriggerNextSection_57ECC1AC49B45853AB850892A344A3FF(class FName NextSectionName);
	void OnCompleted_99B5133B48860667A150559D397F8141(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnBlendOut_99B5133B48860667A150559D397F8141(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnInterrupted_99B5133B48860667A150559D397F8141(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCancelled_99B5133B48860667A150559D397F8141(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void EventReceived_99B5133B48860667A150559D397F8141(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	class FName K2_GetCustomStartSection(class AHottaPlayerCharacter* Player, class UAnimMontage* Montage);
	void GetDiffYawAngle(const struct FRotator& Start, const struct FRotator& End, float* ResultDiff);
	void FailCheckConsumeFun();
	void TriggerMontageEvent(const struct FGameplayTag& ContainerTag, const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_EvadeMeleeBase_C">();
	}
	static class UGA_EvadeMeleeBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_EvadeMeleeBase_C>();
	}
};
static_assert(alignof(UGA_EvadeMeleeBase_C) == 0x000010, "Wrong alignment on UGA_EvadeMeleeBase_C");
static_assert(sizeof(UGA_EvadeMeleeBase_C) == 0x000D00, "Wrong size on UGA_EvadeMeleeBase_C");
static_assert(offsetof(UGA_EvadeMeleeBase_C, UberGraphFrame_GA_EvadeMeleeBase_C) == 0x000CE0, "Member 'UGA_EvadeMeleeBase_C::UberGraphFrame_GA_EvadeMeleeBase_C' has a wrong offset!");
static_assert(offsetof(UGA_EvadeMeleeBase_C, AttributeModifierFailedSection) == 0x000CE8, "Member 'UGA_EvadeMeleeBase_C::AttributeModifierFailedSection' has a wrong offset!");
static_assert(offsetof(UGA_EvadeMeleeBase_C, Async_Task) == 0x000CF0, "Member 'UGA_EvadeMeleeBase_C::Async_Task' has a wrong offset!");

}

