#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_EvadeMeleeBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.ExecuteUbergraph_GA_EvadeMeleeBase
// 0x09B0 (0x09B0 - 0x0000)
struct GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_9;                     // 0x0004(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5629[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_9;                    // 0x0010(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate;              // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_8;                     // 0x00D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_8;                    // 0x00D8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0188(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_7;                     // 0x0198(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_7;                    // 0x01A0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0250(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_6;                     // 0x0260(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_6;                    // 0x0268(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0318(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_5;                     // 0x0328(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_5;                    // 0x0330(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x03E0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     ___struct_Variable;                                // 0x03F0(0x00B0)()
	struct FGameplayTag                           ___struct_Variable_1;                              // 0x04A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NextSectionName;                // 0x04A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NextSectionName)>  K2Node_CreateDelegate_OutputDelegate_5;            // 0x04B0(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x04C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaAbilityTask_JumpSection*          CallFunc_HottaWaitConditionJumpSection_ReturnValue; // 0x04C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x04D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_562A[0x3];                                     // 0x04D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_4;                     // 0x04D4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_562B[0x4];                                     // 0x04DC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_4;                    // 0x04E0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0590(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_3;                     // 0x05A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_3;                    // 0x05A8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0658(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_2;                     // 0x0668(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_2;                    // 0x0670(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0720(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_1;                     // 0x0730(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_1;                    // 0x0738(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x07E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x07F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x0800(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x08B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     ___struct_Variable_2;                              // 0x08C0(0x00B0)()
	struct FGameplayTag                           ___struct_Variable_3;                              // 0x0970(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0979(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_562C[0x2];                                     // 0x097A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSkillStartSectionName_ReturnValue;     // 0x097C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_562D[0x4];                                     // 0x0984(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaSkillTask_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue;   // 0x0988(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0990(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0994(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0995(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_562E[0x2];                                     // 0x0996(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_JumpSectionName;                      // 0x0998(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaSkillTask_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1; // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase");
static_assert(sizeof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase) == 0x0009B0, "Wrong size on GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, EntryPoint) == 0x000000, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventTag_9) == 0x000004, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventTag_9' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventData_9) == 0x000010, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventData_9' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate) == 0x0000C0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventTag_8) == 0x0000D0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventTag_8' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventData_8) == 0x0000D8, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventData_8' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000188, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventTag_7) == 0x000198, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventTag_7' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventData_7) == 0x0001A0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventData_7' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000250, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventTag_6) == 0x000260, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventTag_6' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventData_6) == 0x000268, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventData_6' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x000318, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventTag_5) == 0x000328, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventTag_5' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventData_5) == 0x000330, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventData_5' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003E0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, ___struct_Variable) == 0x0003F0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, ___struct_Variable_1) == 0x0004A0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_NextSectionName) == 0x0004A8, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_NextSectionName' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x0004B0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, ___name_Variable) == 0x0004C0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::___name_Variable' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, CallFunc_HottaWaitConditionJumpSection_ReturnValue) == 0x0004C8, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::CallFunc_HottaWaitConditionJumpSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, CallFunc_IsValid_ReturnValue) == 0x0004D0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventTag_4) == 0x0004D4, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventTag_4' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventData_4) == 0x0004E0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventData_4' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate_6) == 0x000590, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventTag_3) == 0x0005A0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventTag_3' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventData_3) == 0x0005A8, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventData_3' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate_7) == 0x000658, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventTag_2) == 0x000668, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventTag_2' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventData_2) == 0x000670, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventData_2' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate_8) == 0x000720, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventTag_1) == 0x000730, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventTag_1' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventData_1) == 0x000738, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventData_1' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate_9) == 0x0007E8, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventTag) == 0x0007F8, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CustomEvent_EventData) == 0x000800, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_CreateDelegate_OutputDelegate_10) == 0x0008B0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, ___struct_Variable_2) == 0x0008C0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, ___struct_Variable_3) == 0x000970, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, CallFunc_K2_CommitAbility_ReturnValue) == 0x000978, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_Event_bWasCancelled) == 0x000979, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, CallFunc_GetSkillStartSectionName_ReturnValue) == 0x00097C, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::CallFunc_GetSkillStartSectionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, CallFunc_PlayMontageAndWaitForEvent_ReturnValue) == 0x000988, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::CallFunc_PlayMontageAndWaitForEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, CallFunc_Map_Length_ReturnValue) == 0x000990, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, CallFunc_Greater_IntInt_ReturnValue) == 0x000994, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, CallFunc_IsValid_ReturnValue_1) == 0x000995, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, K2Node_Event_JumpSectionName) == 0x000998, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::K2Node_Event_JumpSectionName' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1) == 0x0009A0, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase, CallFunc_IsValid_ReturnValue_2) == 0x0009A8, "Member 'GA_EvadeMeleeBase_C_ExecuteUbergraph_GA_EvadeMeleeBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.K2_TriggerJumpSection
// 0x0008 (0x0008 - 0x0000)
struct GA_EvadeMeleeBase_C_K2_TriggerJumpSection final
{
public:
	class FName                                   JumpSectionName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_EvadeMeleeBase_C_K2_TriggerJumpSection) == 0x000004, "Wrong alignment on GA_EvadeMeleeBase_C_K2_TriggerJumpSection");
static_assert(sizeof(GA_EvadeMeleeBase_C_K2_TriggerJumpSection) == 0x000008, "Wrong size on GA_EvadeMeleeBase_C_K2_TriggerJumpSection");
static_assert(offsetof(GA_EvadeMeleeBase_C_K2_TriggerJumpSection, JumpSectionName) == 0x000000, "Member 'GA_EvadeMeleeBase_C_K2_TriggerJumpSection::JumpSectionName' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_EvadeMeleeBase_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_EvadeMeleeBase_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_EvadeMeleeBase_C_K2_OnEndAbility");
static_assert(sizeof(GA_EvadeMeleeBase_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_EvadeMeleeBase_C_K2_OnEndAbility");
static_assert(offsetof(GA_EvadeMeleeBase_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_EvadeMeleeBase_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EvadeMeleeBase_C_OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E");
static_assert(sizeof(GA_EvadeMeleeBase_C_OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E) == 0x0000B8, "Wrong size on GA_EvadeMeleeBase_C_OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E, EventTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E::EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_OnCompleted_DBFA41A54A9C03190FCB22BFBFF26D8E::EventData' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EvadeMeleeBase_C_OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E");
static_assert(sizeof(GA_EvadeMeleeBase_C_OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E) == 0x0000B8, "Wrong size on GA_EvadeMeleeBase_C_OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E, EventTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E::EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_OnBlendOut_DBFA41A54A9C03190FCB22BFBFF26D8E::EventData' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EvadeMeleeBase_C_OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E");
static_assert(sizeof(GA_EvadeMeleeBase_C_OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E) == 0x0000B8, "Wrong size on GA_EvadeMeleeBase_C_OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E, EventTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E::EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_OnInterrupted_DBFA41A54A9C03190FCB22BFBFF26D8E::EventData' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EvadeMeleeBase_C_OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E");
static_assert(sizeof(GA_EvadeMeleeBase_C_OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E) == 0x0000B8, "Wrong size on GA_EvadeMeleeBase_C_OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E, EventTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E::EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_OnCancelled_DBFA41A54A9C03190FCB22BFBFF26D8E::EventData' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EvadeMeleeBase_C_EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E");
static_assert(sizeof(GA_EvadeMeleeBase_C_EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E) == 0x0000B8, "Wrong size on GA_EvadeMeleeBase_C_EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E");
static_assert(offsetof(GA_EvadeMeleeBase_C_EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E, EventTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E::EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_EventReceived_DBFA41A54A9C03190FCB22BFBFF26D8E::EventData' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.OnTriggerNextSection_57ECC1AC49B45853AB850892A344A3FF
// 0x0008 (0x0008 - 0x0000)
struct GA_EvadeMeleeBase_C_OnTriggerNextSection_57ECC1AC49B45853AB850892A344A3FF final
{
public:
	class FName                                   NextSectionName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_EvadeMeleeBase_C_OnTriggerNextSection_57ECC1AC49B45853AB850892A344A3FF) == 0x000004, "Wrong alignment on GA_EvadeMeleeBase_C_OnTriggerNextSection_57ECC1AC49B45853AB850892A344A3FF");
static_assert(sizeof(GA_EvadeMeleeBase_C_OnTriggerNextSection_57ECC1AC49B45853AB850892A344A3FF) == 0x000008, "Wrong size on GA_EvadeMeleeBase_C_OnTriggerNextSection_57ECC1AC49B45853AB850892A344A3FF");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnTriggerNextSection_57ECC1AC49B45853AB850892A344A3FF, NextSectionName) == 0x000000, "Member 'GA_EvadeMeleeBase_C_OnTriggerNextSection_57ECC1AC49B45853AB850892A344A3FF::NextSectionName' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.OnCompleted_99B5133B48860667A150559D397F8141
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EvadeMeleeBase_C_OnCompleted_99B5133B48860667A150559D397F8141 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_OnCompleted_99B5133B48860667A150559D397F8141) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_OnCompleted_99B5133B48860667A150559D397F8141");
static_assert(sizeof(GA_EvadeMeleeBase_C_OnCompleted_99B5133B48860667A150559D397F8141) == 0x0000B8, "Wrong size on GA_EvadeMeleeBase_C_OnCompleted_99B5133B48860667A150559D397F8141");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnCompleted_99B5133B48860667A150559D397F8141, EventTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_OnCompleted_99B5133B48860667A150559D397F8141::EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnCompleted_99B5133B48860667A150559D397F8141, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_OnCompleted_99B5133B48860667A150559D397F8141::EventData' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.OnBlendOut_99B5133B48860667A150559D397F8141
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EvadeMeleeBase_C_OnBlendOut_99B5133B48860667A150559D397F8141 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_OnBlendOut_99B5133B48860667A150559D397F8141) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_OnBlendOut_99B5133B48860667A150559D397F8141");
static_assert(sizeof(GA_EvadeMeleeBase_C_OnBlendOut_99B5133B48860667A150559D397F8141) == 0x0000B8, "Wrong size on GA_EvadeMeleeBase_C_OnBlendOut_99B5133B48860667A150559D397F8141");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnBlendOut_99B5133B48860667A150559D397F8141, EventTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_OnBlendOut_99B5133B48860667A150559D397F8141::EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnBlendOut_99B5133B48860667A150559D397F8141, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_OnBlendOut_99B5133B48860667A150559D397F8141::EventData' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.OnInterrupted_99B5133B48860667A150559D397F8141
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EvadeMeleeBase_C_OnInterrupted_99B5133B48860667A150559D397F8141 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_OnInterrupted_99B5133B48860667A150559D397F8141) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_OnInterrupted_99B5133B48860667A150559D397F8141");
static_assert(sizeof(GA_EvadeMeleeBase_C_OnInterrupted_99B5133B48860667A150559D397F8141) == 0x0000B8, "Wrong size on GA_EvadeMeleeBase_C_OnInterrupted_99B5133B48860667A150559D397F8141");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnInterrupted_99B5133B48860667A150559D397F8141, EventTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_OnInterrupted_99B5133B48860667A150559D397F8141::EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnInterrupted_99B5133B48860667A150559D397F8141, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_OnInterrupted_99B5133B48860667A150559D397F8141::EventData' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.OnCancelled_99B5133B48860667A150559D397F8141
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EvadeMeleeBase_C_OnCancelled_99B5133B48860667A150559D397F8141 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_OnCancelled_99B5133B48860667A150559D397F8141) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_OnCancelled_99B5133B48860667A150559D397F8141");
static_assert(sizeof(GA_EvadeMeleeBase_C_OnCancelled_99B5133B48860667A150559D397F8141) == 0x0000B8, "Wrong size on GA_EvadeMeleeBase_C_OnCancelled_99B5133B48860667A150559D397F8141");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnCancelled_99B5133B48860667A150559D397F8141, EventTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_OnCancelled_99B5133B48860667A150559D397F8141::EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_OnCancelled_99B5133B48860667A150559D397F8141, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_OnCancelled_99B5133B48860667A150559D397F8141::EventData' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.EventReceived_99B5133B48860667A150559D397F8141
// 0x00B8 (0x00B8 - 0x0000)
struct GA_EvadeMeleeBase_C_EventReceived_99B5133B48860667A150559D397F8141 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_EventReceived_99B5133B48860667A150559D397F8141) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_EventReceived_99B5133B48860667A150559D397F8141");
static_assert(sizeof(GA_EvadeMeleeBase_C_EventReceived_99B5133B48860667A150559D397F8141) == 0x0000B8, "Wrong size on GA_EvadeMeleeBase_C_EventReceived_99B5133B48860667A150559D397F8141");
static_assert(offsetof(GA_EvadeMeleeBase_C_EventReceived_99B5133B48860667A150559D397F8141, EventTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_EventReceived_99B5133B48860667A150559D397F8141::EventTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_EventReceived_99B5133B48860667A150559D397F8141, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_EventReceived_99B5133B48860667A150559D397F8141::EventData' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.K2_GetCustomStartSection
// 0x0028 (0x0028 - 0x0000)
struct GA_EvadeMeleeBase_C_K2_GetCustomStartSection final
{
public:
	class AHottaPlayerCharacter*                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         TempAngle;                                         // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_GetCustomEvadeSkillStartSection_ReturnValue; // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_EvadeMeleeBase_C_K2_GetCustomStartSection) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_K2_GetCustomStartSection");
static_assert(sizeof(GA_EvadeMeleeBase_C_K2_GetCustomStartSection) == 0x000028, "Wrong size on GA_EvadeMeleeBase_C_K2_GetCustomStartSection");
static_assert(offsetof(GA_EvadeMeleeBase_C_K2_GetCustomStartSection, Player) == 0x000000, "Member 'GA_EvadeMeleeBase_C_K2_GetCustomStartSection::Player' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_K2_GetCustomStartSection, Montage) == 0x000008, "Member 'GA_EvadeMeleeBase_C_K2_GetCustomStartSection::Montage' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_K2_GetCustomStartSection, ReturnValue) == 0x000010, "Member 'GA_EvadeMeleeBase_C_K2_GetCustomStartSection::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_K2_GetCustomStartSection, TempAngle) == 0x000018, "Member 'GA_EvadeMeleeBase_C_K2_GetCustomStartSection::TempAngle' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_K2_GetCustomStartSection, CallFunc_K2_GetCustomEvadeSkillStartSection_ReturnValue) == 0x00001C, "Member 'GA_EvadeMeleeBase_C_K2_GetCustomStartSection::CallFunc_K2_GetCustomEvadeSkillStartSection_ReturnValue' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.GetDiffYawAngle
// 0x003C (0x003C - 0x0000)
struct GA_EvadeMeleeBase_C_GetDiffYawAngle final
{
public:
	struct FRotator                               Start;                                             // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FRotator                               End;                                               // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         ResultDiff;                                        // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll;                        // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch;                       // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw;                         // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Roll_1;                      // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Pitch_1;                     // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakRotator_Yaw_1;                       // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_ClampAxis_ReturnValue;                    // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_EvadeMeleeBase_C_GetDiffYawAngle) == 0x000004, "Wrong alignment on GA_EvadeMeleeBase_C_GetDiffYawAngle");
static_assert(sizeof(GA_EvadeMeleeBase_C_GetDiffYawAngle) == 0x00003C, "Wrong size on GA_EvadeMeleeBase_C_GetDiffYawAngle");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, Start) == 0x000000, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::Start' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, End) == 0x00000C, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::End' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, ResultDiff) == 0x000018, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::ResultDiff' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, CallFunc_BreakRotator_Roll) == 0x00001C, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::CallFunc_BreakRotator_Roll' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, CallFunc_BreakRotator_Pitch) == 0x000020, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::CallFunc_BreakRotator_Pitch' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, CallFunc_BreakRotator_Yaw) == 0x000024, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::CallFunc_BreakRotator_Yaw' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, CallFunc_BreakRotator_Roll_1) == 0x000028, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::CallFunc_BreakRotator_Roll_1' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, CallFunc_BreakRotator_Pitch_1) == 0x00002C, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::CallFunc_BreakRotator_Pitch_1' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, CallFunc_BreakRotator_Yaw_1) == 0x000030, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::CallFunc_BreakRotator_Yaw_1' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000034, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_GetDiffYawAngle, CallFunc_ClampAxis_ReturnValue) == 0x000038, "Member 'GA_EvadeMeleeBase_C_GetDiffYawAngle::CallFunc_ClampAxis_ReturnValue' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.FailCheckConsumeFun
// 0x0001 (0x0001 - 0x0000)
struct GA_EvadeMeleeBase_C_FailCheckConsumeFun final
{
public:
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_EvadeMeleeBase_C_FailCheckConsumeFun) == 0x000001, "Wrong alignment on GA_EvadeMeleeBase_C_FailCheckConsumeFun");
static_assert(sizeof(GA_EvadeMeleeBase_C_FailCheckConsumeFun) == 0x000001, "Wrong size on GA_EvadeMeleeBase_C_FailCheckConsumeFun");
static_assert(offsetof(GA_EvadeMeleeBase_C_FailCheckConsumeFun, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000000, "Member 'GA_EvadeMeleeBase_C_FailCheckConsumeFun::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function GA_EvadeMeleeBase.GA_EvadeMeleeBase_C.TriggerMontageEvent
// 0x00D0 (0x00D0 - 0x0000)
struct GA_EvadeMeleeBase_C_TriggerMontageEvent final
{
public:
	struct FGameplayTag                           ContainerTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_K2_ApplyCheckAttributeModifiers_ReturnValue; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_562F[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyEffectContainer_ReturnValue;         // 0x00C0(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_EvadeMeleeBase_C_TriggerMontageEvent) == 0x000008, "Wrong alignment on GA_EvadeMeleeBase_C_TriggerMontageEvent");
static_assert(sizeof(GA_EvadeMeleeBase_C_TriggerMontageEvent) == 0x0000D0, "Wrong size on GA_EvadeMeleeBase_C_TriggerMontageEvent");
static_assert(offsetof(GA_EvadeMeleeBase_C_TriggerMontageEvent, ContainerTag) == 0x000000, "Member 'GA_EvadeMeleeBase_C_TriggerMontageEvent::ContainerTag' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_TriggerMontageEvent, EventData) == 0x000008, "Member 'GA_EvadeMeleeBase_C_TriggerMontageEvent::EventData' has a wrong offset!");
static_assert(offsetof(GA_EvadeMeleeBase_C_TriggerMontageEvent, CallFunc_K2_ApplyCheckAttributeModifiers_ReturnValue) == 0x0000B8, "Member 'GA_EvadeMeleeBase_C_TriggerMontageEvent::CallFunc_K2_ApplyCheckAttributeModifiers_ReturnValue' has a wrong offset!");
