#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_FPlayerMarkRobAimAttack

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function GA_FPlayerMarkRobAimAttack.GA_FPlayerMarkRobAimAttack_C.ExecuteUbergraph_GA_FPlayerMarkRobAimAttack
// 0x00A8 (0x00A8 - 0x0000)
struct GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_596C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHottaEnterStateRequest                K2Node_MakeStruct_HottaEnterStateRequest;          // 0x0008(0x0050)()
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_596D[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_596E[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character_1;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_596F[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHottaStateOperationResult             CallFunc_EnterState_ReturnValue;                   // 0x0090(0x0018)()
};
static_assert(alignof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack) == 0x000008, "Wrong alignment on GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack");
static_assert(sizeof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack) == 0x0000A8, "Wrong size on GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack, EntryPoint) == 0x000000, "Member 'GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack, K2Node_MakeStruct_HottaEnterStateRequest) == 0x000008, "Member 'GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack::K2Node_MakeStruct_HottaEnterStateRequest' has a wrong offset!");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack, K2Node_Event_bWasCancelled) == 0x000058, "Member 'GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000060, "Member 'GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000068, "Member 'GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack, K2Node_DynamicCast_bSuccess) == 0x000070, "Member 'GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000078, "Member 'GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack, K2Node_DynamicCast_AsHotta_Player_Character_1) == 0x000080, "Member 'GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack::K2Node_DynamicCast_AsHotta_Player_Character_1' has a wrong offset!");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack, K2Node_DynamicCast_bSuccess_1) == 0x000088, "Member 'GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack, CallFunc_EnterState_ReturnValue) == 0x000090, "Member 'GA_FPlayerMarkRobAimAttack_C_ExecuteUbergraph_GA_FPlayerMarkRobAimAttack::CallFunc_EnterState_ReturnValue' has a wrong offset!");

// Function GA_FPlayerMarkRobAimAttack.GA_FPlayerMarkRobAimAttack_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_FPlayerMarkRobAimAttack_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_FPlayerMarkRobAimAttack_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_FPlayerMarkRobAimAttack_C_K2_OnEndAbility");
static_assert(sizeof(GA_FPlayerMarkRobAimAttack_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_FPlayerMarkRobAimAttack_C_K2_OnEndAbility");
static_assert(offsetof(GA_FPlayerMarkRobAimAttack_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_FPlayerMarkRobAimAttack_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

}

