#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_FPlayerBowEvadeFireAttack_Level4

#include "Basic.hpp"


namespace SDK::Params
{

// Function GA_FPlayerBowEvadeFireAttack_Level4.GA_FPlayerBowEvadeFireAttack_Level4_C.K2_GetCustomStartSection
// 0x0020 (0x0020 - 0x0000)
struct GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection final
{
public:
	class AHottaPlayerCharacter*                  Player;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                           Montage;                                           // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_K2_GetCustomEvadeSkillStartSection_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection) == 0x000008, "Wrong alignment on GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection");
static_assert(sizeof(GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection) == 0x000020, "Wrong size on GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection");
static_assert(offsetof(GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection, Player) == 0x000000, "Member 'GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection::Player' has a wrong offset!");
static_assert(offsetof(GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection, Montage) == 0x000008, "Member 'GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection::Montage' has a wrong offset!");
static_assert(offsetof(GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection, ReturnValue) == 0x000010, "Member 'GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection::ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection, CallFunc_K2_GetCustomEvadeSkillStartSection_ReturnValue) == 0x000018, "Member 'GA_FPlayerBowEvadeFireAttack_Level4_C_K2_GetCustomStartSection::CallFunc_K2_GetCustomEvadeSkillStartSection_ReturnValue' has a wrong offset!");

}

