#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_HottaSkillBase

#include "Basic.hpp"

#include "DamageActorUseSpawnOffsetType_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_HottaSkillBase.GA_HottaSkillBase_C
// 0x00D0 (0x0CE0 - 0x0C10)
class UGA_HottaSkillBase_C : public UHottaSkill
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C10(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          NeedCheckFloor;                                    // 0x0C18(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          ForceSpawn;                                        // 0x0C19(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5603[0x2];                                     // 0x0C1A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CheckAngle;                                        // 0x0C1C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NoFindSpawnBySelfLocation;                         // 0x0C20(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5604[0x3];                                     // 0x0C21(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         PreLocationTime;                                   // 0x0C24(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillSpawnActorLocationType                  SpawnActorLocationType;                            // 0x0C28(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESkillSpawnActorRotatorType                   SpawnActorRotatorType;                             // 0x0C29(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5605[0x2];                                     // 0x0C2A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   SpawnAtSocket;                                     // 0x0C2C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseWeaponSocket;                                   // 0x0C34(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5606[0x3];                                     // 0x0C35(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   WeaponMeshTag;                                     // 0x0C38(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseCarrierSocket;                                  // 0x0C40(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsAim;                                             // 0x0C41(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseSelfFace;                                       // 0x0C42(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseSelfControllerFace;                             // 0x0C43(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          DebugLine;                                         // 0x0C44(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseSkillLockedLocation;                            // 0x0C45(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5607[0x2];                                     // 0x0C46(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FRotator                               FaceAngleDiff;                                     // 0x0C48(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                               AddRandomRotation;                                 // 0x0C54(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseArtifactSocket;                                 // 0x0C60(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	HottaFramework::EDamageActorUseSpawnOffsetType UseSpawnOffsetType;                                // 0x0C61(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsPet;                                             // 0x0C62(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	ESummonedAIAttackMode                         AttackMode;                                        // 0x0C63(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         SummonAILevel;                                     // 0x0C64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseTriggerActorLocation;                           // 0x0C68(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5608[0x3];                                     // 0x0C69(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                MoveToDirection;                                   // 0x0C6C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESummonAIAttachType                           Attach;                                            // 0x0C78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5609[0x3];                                     // 0x0C79(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   AttachSocket;                                      // 0x0C7C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_560A[0xC];                                     // 0x0C84(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             AttachOffset;                                      // 0x0C90(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          UseSelfMeshFace;                                   // 0x0CC0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_560B[0x3];                                     // 0x0CC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAttachArmParams                       AttachCharacterArmParams;                          // 0x0CC4(0x0014)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          NeedCheckWaterSurface;                             // 0x0CD8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_560C[0x3];                                     // 0x0CD9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         DownCheckDist;                                     // 0x0CDC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_HottaSkillBase(int32 EntryPoint);
	void K2_OnTriggerRootMotionJumpForceTask(const struct FSkillJumpForceTaskParam& JumpForceTask);
	void K2_OnTriggerRootMotionMoveToTargetTask(const struct FSkillMoveToActorTaskParam& MoveToActorTask);
	void K2_OnTriggerRootMotionMoveToForceTask(const struct FSkillMoveToForceTaskParam& MoveToForceTask);
	void K2_OnTriggerRootMotionConstantForceTask(const struct FSkillConstantForceTaskParam& ConstantForceTask);
	void OnFinish_9E90BEBC42BED540BAEA6B8BCE71355D();
	void OnLanded_9E90BEBC42BED540BAEA6B8BCE71355D();
	void OnFinished_932559324C00906DEC3C56BB090FD8C2(bool DestinationReached, bool TimedOut, const struct FVector& FinalTargetLocation);
	void OnTimedOut_630570AE4B07C3699838B398522B9CF3();
	void OnTimedOutAndDestinationReached_630570AE4B07C3699838B398522B9CF3();
	void OnFinish_548EA0DF4C5186913107A3A79D449735();
	void Apply_Damage_Actor_Trigger_Effect(const struct FGameplayTag& TriggerEventTag, const struct FGameplayEventData& TriggerEventData);
	void GetSpawnActorRotation(const struct FRotator& OffsetRotation, class AActor* TargetActor, struct FRotator* Rotation);
	void GetSpawnActorLocation(const struct FVector& OffsetVec, class AActor* TargetActor, struct FVector* Result, bool* bResult);
	void SpawnHottaActor(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void GetPreLocation(class AActor* TargetActor, struct FTransform* Result);
	void SpawnProjectile(const struct FGameplayTag& ContainerTag, const struct FGameplayEventData& EventData, bool SpawnHottaActor);
	void SpawnHottaCharacter(const struct FGameplayTag& ContainerTag, const struct FGameplayEventData& EventData);
	void SpawnRotatingActor(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void SpawnSummonAIActor(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void Trigger_Active_Cue_Tag_Fun(const struct FGameplayTag& CueTag);
	void TriggerExcuteCueTagFun(const struct FGameplayTag& CueTag, bool bServerTrigger);
	void SelectSpawnActorLocationType(ESkillSpawnActorLocationType* Result);
	void SelectSpawnActorRotatorType(ESkillSpawnActorRotatorType* NewParam);
	void PlayFFMpegVideo();
	void StopFFMpegVideo();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_HottaSkillBase_C">();
	}
	static class UGA_HottaSkillBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_HottaSkillBase_C>();
	}
};
static_assert(alignof(UGA_HottaSkillBase_C) == 0x000010, "Wrong alignment on UGA_HottaSkillBase_C");
static_assert(sizeof(UGA_HottaSkillBase_C) == 0x000CE0, "Wrong size on UGA_HottaSkillBase_C");
static_assert(offsetof(UGA_HottaSkillBase_C, UberGraphFrame) == 0x000C10, "Member 'UGA_HottaSkillBase_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, NeedCheckFloor) == 0x000C18, "Member 'UGA_HottaSkillBase_C::NeedCheckFloor' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, ForceSpawn) == 0x000C19, "Member 'UGA_HottaSkillBase_C::ForceSpawn' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, CheckAngle) == 0x000C1C, "Member 'UGA_HottaSkillBase_C::CheckAngle' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, NoFindSpawnBySelfLocation) == 0x000C20, "Member 'UGA_HottaSkillBase_C::NoFindSpawnBySelfLocation' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, PreLocationTime) == 0x000C24, "Member 'UGA_HottaSkillBase_C::PreLocationTime' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, SpawnActorLocationType) == 0x000C28, "Member 'UGA_HottaSkillBase_C::SpawnActorLocationType' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, SpawnActorRotatorType) == 0x000C29, "Member 'UGA_HottaSkillBase_C::SpawnActorRotatorType' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, SpawnAtSocket) == 0x000C2C, "Member 'UGA_HottaSkillBase_C::SpawnAtSocket' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, UseWeaponSocket) == 0x000C34, "Member 'UGA_HottaSkillBase_C::UseWeaponSocket' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, WeaponMeshTag) == 0x000C38, "Member 'UGA_HottaSkillBase_C::WeaponMeshTag' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, UseCarrierSocket) == 0x000C40, "Member 'UGA_HottaSkillBase_C::UseCarrierSocket' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, IsAim) == 0x000C41, "Member 'UGA_HottaSkillBase_C::IsAim' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, UseSelfFace) == 0x000C42, "Member 'UGA_HottaSkillBase_C::UseSelfFace' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, UseSelfControllerFace) == 0x000C43, "Member 'UGA_HottaSkillBase_C::UseSelfControllerFace' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, DebugLine) == 0x000C44, "Member 'UGA_HottaSkillBase_C::DebugLine' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, UseSkillLockedLocation) == 0x000C45, "Member 'UGA_HottaSkillBase_C::UseSkillLockedLocation' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, FaceAngleDiff) == 0x000C48, "Member 'UGA_HottaSkillBase_C::FaceAngleDiff' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, AddRandomRotation) == 0x000C54, "Member 'UGA_HottaSkillBase_C::AddRandomRotation' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, UseArtifactSocket) == 0x000C60, "Member 'UGA_HottaSkillBase_C::UseArtifactSocket' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, UseSpawnOffsetType) == 0x000C61, "Member 'UGA_HottaSkillBase_C::UseSpawnOffsetType' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, IsPet) == 0x000C62, "Member 'UGA_HottaSkillBase_C::IsPet' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, AttackMode) == 0x000C63, "Member 'UGA_HottaSkillBase_C::AttackMode' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, SummonAILevel) == 0x000C64, "Member 'UGA_HottaSkillBase_C::SummonAILevel' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, UseTriggerActorLocation) == 0x000C68, "Member 'UGA_HottaSkillBase_C::UseTriggerActorLocation' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, MoveToDirection) == 0x000C6C, "Member 'UGA_HottaSkillBase_C::MoveToDirection' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, Attach) == 0x000C78, "Member 'UGA_HottaSkillBase_C::Attach' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, AttachSocket) == 0x000C7C, "Member 'UGA_HottaSkillBase_C::AttachSocket' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, AttachOffset) == 0x000C90, "Member 'UGA_HottaSkillBase_C::AttachOffset' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, UseSelfMeshFace) == 0x000CC0, "Member 'UGA_HottaSkillBase_C::UseSelfMeshFace' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, AttachCharacterArmParams) == 0x000CC4, "Member 'UGA_HottaSkillBase_C::AttachCharacterArmParams' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, NeedCheckWaterSurface) == 0x000CD8, "Member 'UGA_HottaSkillBase_C::NeedCheckWaterSurface' has a wrong offset!");
static_assert(offsetof(UGA_HottaSkillBase_C, DownCheckDist) == 0x000CDC, "Member 'UGA_HottaSkillBase_C::DownCheckDist' has a wrong offset!");

}

