#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_MeleeBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_MeleeBase.GA_MeleeBase_C.ExecuteUbergraph_GA_MeleeBase
// 0x0A00 (0x0A00 - 0x0000)
struct GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetHoldSection_ReturnValue;               // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_8;                     // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_564E[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_8;                    // 0x0028(0x00B0)()
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_7;                     // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_7;                    // 0x00E0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_6;                     // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_6;                    // 0x01A8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_5;                     // 0x0268(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_5;                    // 0x0270(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0320(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     ___struct_Variable;                                // 0x0330(0x00B0)()
	struct FGameplayTag                           ___struct_Variable_1;                              // 0x03E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x03E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAuto;                          // 0x03EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_564F[0x3];                                     // 0x03ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld, bool bAuto)>   K2Node_CreateDelegate_OutputDelegate_4;            // 0x03F0(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          ___bool_Variable;                                  // 0x0400(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5650[0x3];                                     // 0x0401(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ___float_Variable;                                 // 0x0404(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0408(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5651[0x7];                                     // 0x0409(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaWaitInputReleaseTask*             CallFunc_HottaWaitInputRelease_ReturnValue;        // 0x0410(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0418(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5652[0x3];                                     // 0x0419(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class FName NextSectionName)>  K2Node_CreateDelegate_OutputDelegate_5;            // 0x041C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_NextSectionName;                // 0x042C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ___name_Variable;                                  // 0x0434(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5653[0x4];                                     // 0x043C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaAbilityTask_JumpSection*          CallFunc_HottaWaitConditionJumpSection_ReturnValue; // 0x0440(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0448(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5654[0x3];                                     // 0x0449(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x044C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_4;                     // 0x045C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5655[0x4];                                     // 0x0464(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_4;                    // 0x0468(0x00B0)()
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_3;                     // 0x0518(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_3;                    // 0x0520(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x05D0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_2;                     // 0x05E0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_2;                    // 0x05E8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0698(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_1;                     // 0x06A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_1;                    // 0x06B0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0760(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x0770(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x0778(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0828(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     ___struct_Variable_2;                              // 0x0838(0x00B0)()
	struct FGameplayTag                           ___struct_Variable_3;                              // 0x08E8(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x08F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5656[0x7];                                     // 0x08F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaSkillTask_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue;   // 0x08F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0900(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0901(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0902(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BlueprintCommitCheck_ReturnValue;         // 0x0903(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0904(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue_1;           // 0x0905(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5657[0x2];                                     // 0x0906(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_9;                     // 0x0908(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_9;                    // 0x0910(0x00B0)()
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x09C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5658[0x3];                                     // 0x09C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSkillStartSectionName_ReturnValue;     // 0x09C4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x09CC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x09D0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5659[0x3];                                     // 0x09D1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x09D4(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_Event_JumpSectionName;                      // 0x09E4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_565A[0x4];                                     // 0x09EC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaSkillTask_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1; // 0x09F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x09F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase) == 0x000008, "Wrong alignment on GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase");
static_assert(sizeof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase) == 0x000A00, "Wrong size on GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, EntryPoint) == 0x000000, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_GetHoldSection_ReturnValue) == 0x000004, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_GetHoldSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventTag_8) == 0x00001C, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventTag_8' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventData_8) == 0x000028, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventData_8' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventTag_7) == 0x0000D8, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventTag_7' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventData_7) == 0x0000E0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventData_7' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000190, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventTag_6) == 0x0001A0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventTag_6' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventData_6) == 0x0001A8, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventData_6' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000258, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventTag_5) == 0x000268, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventTag_5' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventData_5) == 0x000270, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventData_5' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x000320, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, ___struct_Variable) == 0x000330, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, ___struct_Variable_1) == 0x0003E0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_TimeHeld) == 0x0003E8, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_bAuto) == 0x0003EC, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_bAuto' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003F0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, ___bool_Variable) == 0x000400, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::___bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, ___float_Variable) == 0x000404, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::___float_Variable' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_Not_PreBool_ReturnValue) == 0x000408, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_HottaWaitInputRelease_ReturnValue) == 0x000410, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_HottaWaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_IsValid_ReturnValue) == 0x000418, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x00041C, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_NextSectionName) == 0x00042C, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_NextSectionName' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, ___name_Variable) == 0x000434, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::___name_Variable' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_HottaWaitConditionJumpSection_ReturnValue) == 0x000440, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_HottaWaitConditionJumpSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_IsValid_ReturnValue_1) == 0x000448, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_6) == 0x00044C, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventTag_4) == 0x00045C, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventTag_4' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventData_4) == 0x000468, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventData_4' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventTag_3) == 0x000518, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventTag_3' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventData_3) == 0x000520, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventData_3' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_7) == 0x0005D0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventTag_2) == 0x0005E0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventTag_2' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventData_2) == 0x0005E8, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventData_2' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_8) == 0x000698, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventTag_1) == 0x0006A8, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventTag_1' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventData_1) == 0x0006B0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventData_1' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_9) == 0x000760, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventTag) == 0x000770, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventData) == 0x000778, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_10) == 0x000828, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, ___struct_Variable_2) == 0x000838, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, ___struct_Variable_3) == 0x0008E8, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0008F0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_PlayMontageAndWaitForEvent_ReturnValue) == 0x0008F8, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_PlayMontageAndWaitForEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_Not_PreBool_ReturnValue_1) == 0x000900, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_IsValid_ReturnValue_2) == 0x000901, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_K2_CommitAbility_ReturnValue) == 0x000902, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_BlueprintCommitCheck_ReturnValue) == 0x000903, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_BlueprintCommitCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000904, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_K2_CommitAbility_ReturnValue_1) == 0x000905, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_K2_CommitAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventTag_9) == 0x000908, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventTag_9' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CustomEvent_EventData_9) == 0x000910, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CustomEvent_EventData_9' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x0009C0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_GetSkillStartSectionName_ReturnValue) == 0x0009C4, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_GetSkillStartSectionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_Map_Length_ReturnValue) == 0x0009CC, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_Greater_IntInt_ReturnValue) == 0x0009D0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_CreateDelegate_OutputDelegate_11) == 0x0009D4, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, K2Node_Event_JumpSectionName) == 0x0009E4, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::K2Node_Event_JumpSectionName' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1) == 0x0009F0, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase, CallFunc_IsValid_ReturnValue_3) == 0x0009F8, "Member 'GA_MeleeBase_C_ExecuteUbergraph_GA_MeleeBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.K2_TriggerJumpSection
// 0x0008 (0x0008 - 0x0000)
struct GA_MeleeBase_C_K2_TriggerJumpSection final
{
public:
	class FName                                   JumpSectionName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MeleeBase_C_K2_TriggerJumpSection) == 0x000004, "Wrong alignment on GA_MeleeBase_C_K2_TriggerJumpSection");
static_assert(sizeof(GA_MeleeBase_C_K2_TriggerJumpSection) == 0x000008, "Wrong size on GA_MeleeBase_C_K2_TriggerJumpSection");
static_assert(offsetof(GA_MeleeBase_C_K2_TriggerJumpSection, JumpSectionName) == 0x000000, "Member 'GA_MeleeBase_C_K2_TriggerJumpSection::JumpSectionName' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.OnCompleted_6B9DADB041F597767DE29FBECF116D2D
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MeleeBase_C_OnCompleted_6B9DADB041F597767DE29FBECF116D2D final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MeleeBase_C_OnCompleted_6B9DADB041F597767DE29FBECF116D2D) == 0x000008, "Wrong alignment on GA_MeleeBase_C_OnCompleted_6B9DADB041F597767DE29FBECF116D2D");
static_assert(sizeof(GA_MeleeBase_C_OnCompleted_6B9DADB041F597767DE29FBECF116D2D) == 0x0000B8, "Wrong size on GA_MeleeBase_C_OnCompleted_6B9DADB041F597767DE29FBECF116D2D");
static_assert(offsetof(GA_MeleeBase_C_OnCompleted_6B9DADB041F597767DE29FBECF116D2D, EventTag) == 0x000000, "Member 'GA_MeleeBase_C_OnCompleted_6B9DADB041F597767DE29FBECF116D2D::EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_OnCompleted_6B9DADB041F597767DE29FBECF116D2D, EventData) == 0x000008, "Member 'GA_MeleeBase_C_OnCompleted_6B9DADB041F597767DE29FBECF116D2D::EventData' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.OnBlendOut_6B9DADB041F597767DE29FBECF116D2D
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MeleeBase_C_OnBlendOut_6B9DADB041F597767DE29FBECF116D2D final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MeleeBase_C_OnBlendOut_6B9DADB041F597767DE29FBECF116D2D) == 0x000008, "Wrong alignment on GA_MeleeBase_C_OnBlendOut_6B9DADB041F597767DE29FBECF116D2D");
static_assert(sizeof(GA_MeleeBase_C_OnBlendOut_6B9DADB041F597767DE29FBECF116D2D) == 0x0000B8, "Wrong size on GA_MeleeBase_C_OnBlendOut_6B9DADB041F597767DE29FBECF116D2D");
static_assert(offsetof(GA_MeleeBase_C_OnBlendOut_6B9DADB041F597767DE29FBECF116D2D, EventTag) == 0x000000, "Member 'GA_MeleeBase_C_OnBlendOut_6B9DADB041F597767DE29FBECF116D2D::EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_OnBlendOut_6B9DADB041F597767DE29FBECF116D2D, EventData) == 0x000008, "Member 'GA_MeleeBase_C_OnBlendOut_6B9DADB041F597767DE29FBECF116D2D::EventData' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.OnInterrupted_6B9DADB041F597767DE29FBECF116D2D
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MeleeBase_C_OnInterrupted_6B9DADB041F597767DE29FBECF116D2D final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MeleeBase_C_OnInterrupted_6B9DADB041F597767DE29FBECF116D2D) == 0x000008, "Wrong alignment on GA_MeleeBase_C_OnInterrupted_6B9DADB041F597767DE29FBECF116D2D");
static_assert(sizeof(GA_MeleeBase_C_OnInterrupted_6B9DADB041F597767DE29FBECF116D2D) == 0x0000B8, "Wrong size on GA_MeleeBase_C_OnInterrupted_6B9DADB041F597767DE29FBECF116D2D");
static_assert(offsetof(GA_MeleeBase_C_OnInterrupted_6B9DADB041F597767DE29FBECF116D2D, EventTag) == 0x000000, "Member 'GA_MeleeBase_C_OnInterrupted_6B9DADB041F597767DE29FBECF116D2D::EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_OnInterrupted_6B9DADB041F597767DE29FBECF116D2D, EventData) == 0x000008, "Member 'GA_MeleeBase_C_OnInterrupted_6B9DADB041F597767DE29FBECF116D2D::EventData' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.OnCancelled_6B9DADB041F597767DE29FBECF116D2D
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MeleeBase_C_OnCancelled_6B9DADB041F597767DE29FBECF116D2D final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MeleeBase_C_OnCancelled_6B9DADB041F597767DE29FBECF116D2D) == 0x000008, "Wrong alignment on GA_MeleeBase_C_OnCancelled_6B9DADB041F597767DE29FBECF116D2D");
static_assert(sizeof(GA_MeleeBase_C_OnCancelled_6B9DADB041F597767DE29FBECF116D2D) == 0x0000B8, "Wrong size on GA_MeleeBase_C_OnCancelled_6B9DADB041F597767DE29FBECF116D2D");
static_assert(offsetof(GA_MeleeBase_C_OnCancelled_6B9DADB041F597767DE29FBECF116D2D, EventTag) == 0x000000, "Member 'GA_MeleeBase_C_OnCancelled_6B9DADB041F597767DE29FBECF116D2D::EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_OnCancelled_6B9DADB041F597767DE29FBECF116D2D, EventData) == 0x000008, "Member 'GA_MeleeBase_C_OnCancelled_6B9DADB041F597767DE29FBECF116D2D::EventData' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.EventReceived_6B9DADB041F597767DE29FBECF116D2D
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MeleeBase_C_EventReceived_6B9DADB041F597767DE29FBECF116D2D final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MeleeBase_C_EventReceived_6B9DADB041F597767DE29FBECF116D2D) == 0x000008, "Wrong alignment on GA_MeleeBase_C_EventReceived_6B9DADB041F597767DE29FBECF116D2D");
static_assert(sizeof(GA_MeleeBase_C_EventReceived_6B9DADB041F597767DE29FBECF116D2D) == 0x0000B8, "Wrong size on GA_MeleeBase_C_EventReceived_6B9DADB041F597767DE29FBECF116D2D");
static_assert(offsetof(GA_MeleeBase_C_EventReceived_6B9DADB041F597767DE29FBECF116D2D, EventTag) == 0x000000, "Member 'GA_MeleeBase_C_EventReceived_6B9DADB041F597767DE29FBECF116D2D::EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_EventReceived_6B9DADB041F597767DE29FBECF116D2D, EventData) == 0x000008, "Member 'GA_MeleeBase_C_EventReceived_6B9DADB041F597767DE29FBECF116D2D::EventData' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.OnTriggerNextSection_083A7EA8447456953A6F0D85D4492C34
// 0x0008 (0x0008 - 0x0000)
struct GA_MeleeBase_C_OnTriggerNextSection_083A7EA8447456953A6F0D85D4492C34 final
{
public:
	class FName                                   NextSectionName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_MeleeBase_C_OnTriggerNextSection_083A7EA8447456953A6F0D85D4492C34) == 0x000004, "Wrong alignment on GA_MeleeBase_C_OnTriggerNextSection_083A7EA8447456953A6F0D85D4492C34");
static_assert(sizeof(GA_MeleeBase_C_OnTriggerNextSection_083A7EA8447456953A6F0D85D4492C34) == 0x000008, "Wrong size on GA_MeleeBase_C_OnTriggerNextSection_083A7EA8447456953A6F0D85D4492C34");
static_assert(offsetof(GA_MeleeBase_C_OnTriggerNextSection_083A7EA8447456953A6F0D85D4492C34, NextSectionName) == 0x000000, "Member 'GA_MeleeBase_C_OnTriggerNextSection_083A7EA8447456953A6F0D85D4492C34::NextSectionName' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.OnRelease_86AB8D4C4FC2DA9EFBC5E8AE3C40769C
// 0x0008 (0x0008 - 0x0000)
struct GA_MeleeBase_C_OnRelease_86AB8D4C4FC2DA9EFBC5E8AE3C40769C final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAuto;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_MeleeBase_C_OnRelease_86AB8D4C4FC2DA9EFBC5E8AE3C40769C) == 0x000004, "Wrong alignment on GA_MeleeBase_C_OnRelease_86AB8D4C4FC2DA9EFBC5E8AE3C40769C");
static_assert(sizeof(GA_MeleeBase_C_OnRelease_86AB8D4C4FC2DA9EFBC5E8AE3C40769C) == 0x000008, "Wrong size on GA_MeleeBase_C_OnRelease_86AB8D4C4FC2DA9EFBC5E8AE3C40769C");
static_assert(offsetof(GA_MeleeBase_C_OnRelease_86AB8D4C4FC2DA9EFBC5E8AE3C40769C, TimeHeld) == 0x000000, "Member 'GA_MeleeBase_C_OnRelease_86AB8D4C4FC2DA9EFBC5E8AE3C40769C::TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_OnRelease_86AB8D4C4FC2DA9EFBC5E8AE3C40769C, bAuto) == 0x000004, "Member 'GA_MeleeBase_C_OnRelease_86AB8D4C4FC2DA9EFBC5E8AE3C40769C::bAuto' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.OnCompleted_0B203062449BD26DFF4FD78DFD131D80
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MeleeBase_C_OnCompleted_0B203062449BD26DFF4FD78DFD131D80 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MeleeBase_C_OnCompleted_0B203062449BD26DFF4FD78DFD131D80) == 0x000008, "Wrong alignment on GA_MeleeBase_C_OnCompleted_0B203062449BD26DFF4FD78DFD131D80");
static_assert(sizeof(GA_MeleeBase_C_OnCompleted_0B203062449BD26DFF4FD78DFD131D80) == 0x0000B8, "Wrong size on GA_MeleeBase_C_OnCompleted_0B203062449BD26DFF4FD78DFD131D80");
static_assert(offsetof(GA_MeleeBase_C_OnCompleted_0B203062449BD26DFF4FD78DFD131D80, EventTag) == 0x000000, "Member 'GA_MeleeBase_C_OnCompleted_0B203062449BD26DFF4FD78DFD131D80::EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_OnCompleted_0B203062449BD26DFF4FD78DFD131D80, EventData) == 0x000008, "Member 'GA_MeleeBase_C_OnCompleted_0B203062449BD26DFF4FD78DFD131D80::EventData' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.OnBlendOut_0B203062449BD26DFF4FD78DFD131D80
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MeleeBase_C_OnBlendOut_0B203062449BD26DFF4FD78DFD131D80 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MeleeBase_C_OnBlendOut_0B203062449BD26DFF4FD78DFD131D80) == 0x000008, "Wrong alignment on GA_MeleeBase_C_OnBlendOut_0B203062449BD26DFF4FD78DFD131D80");
static_assert(sizeof(GA_MeleeBase_C_OnBlendOut_0B203062449BD26DFF4FD78DFD131D80) == 0x0000B8, "Wrong size on GA_MeleeBase_C_OnBlendOut_0B203062449BD26DFF4FD78DFD131D80");
static_assert(offsetof(GA_MeleeBase_C_OnBlendOut_0B203062449BD26DFF4FD78DFD131D80, EventTag) == 0x000000, "Member 'GA_MeleeBase_C_OnBlendOut_0B203062449BD26DFF4FD78DFD131D80::EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_OnBlendOut_0B203062449BD26DFF4FD78DFD131D80, EventData) == 0x000008, "Member 'GA_MeleeBase_C_OnBlendOut_0B203062449BD26DFF4FD78DFD131D80::EventData' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.OnInterrupted_0B203062449BD26DFF4FD78DFD131D80
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MeleeBase_C_OnInterrupted_0B203062449BD26DFF4FD78DFD131D80 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MeleeBase_C_OnInterrupted_0B203062449BD26DFF4FD78DFD131D80) == 0x000008, "Wrong alignment on GA_MeleeBase_C_OnInterrupted_0B203062449BD26DFF4FD78DFD131D80");
static_assert(sizeof(GA_MeleeBase_C_OnInterrupted_0B203062449BD26DFF4FD78DFD131D80) == 0x0000B8, "Wrong size on GA_MeleeBase_C_OnInterrupted_0B203062449BD26DFF4FD78DFD131D80");
static_assert(offsetof(GA_MeleeBase_C_OnInterrupted_0B203062449BD26DFF4FD78DFD131D80, EventTag) == 0x000000, "Member 'GA_MeleeBase_C_OnInterrupted_0B203062449BD26DFF4FD78DFD131D80::EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_OnInterrupted_0B203062449BD26DFF4FD78DFD131D80, EventData) == 0x000008, "Member 'GA_MeleeBase_C_OnInterrupted_0B203062449BD26DFF4FD78DFD131D80::EventData' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.OnCancelled_0B203062449BD26DFF4FD78DFD131D80
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MeleeBase_C_OnCancelled_0B203062449BD26DFF4FD78DFD131D80 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MeleeBase_C_OnCancelled_0B203062449BD26DFF4FD78DFD131D80) == 0x000008, "Wrong alignment on GA_MeleeBase_C_OnCancelled_0B203062449BD26DFF4FD78DFD131D80");
static_assert(sizeof(GA_MeleeBase_C_OnCancelled_0B203062449BD26DFF4FD78DFD131D80) == 0x0000B8, "Wrong size on GA_MeleeBase_C_OnCancelled_0B203062449BD26DFF4FD78DFD131D80");
static_assert(offsetof(GA_MeleeBase_C_OnCancelled_0B203062449BD26DFF4FD78DFD131D80, EventTag) == 0x000000, "Member 'GA_MeleeBase_C_OnCancelled_0B203062449BD26DFF4FD78DFD131D80::EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_OnCancelled_0B203062449BD26DFF4FD78DFD131D80, EventData) == 0x000008, "Member 'GA_MeleeBase_C_OnCancelled_0B203062449BD26DFF4FD78DFD131D80::EventData' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.EventReceived_0B203062449BD26DFF4FD78DFD131D80
// 0x00B8 (0x00B8 - 0x0000)
struct GA_MeleeBase_C_EventReceived_0B203062449BD26DFF4FD78DFD131D80 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_MeleeBase_C_EventReceived_0B203062449BD26DFF4FD78DFD131D80) == 0x000008, "Wrong alignment on GA_MeleeBase_C_EventReceived_0B203062449BD26DFF4FD78DFD131D80");
static_assert(sizeof(GA_MeleeBase_C_EventReceived_0B203062449BD26DFF4FD78DFD131D80) == 0x0000B8, "Wrong size on GA_MeleeBase_C_EventReceived_0B203062449BD26DFF4FD78DFD131D80");
static_assert(offsetof(GA_MeleeBase_C_EventReceived_0B203062449BD26DFF4FD78DFD131D80, EventTag) == 0x000000, "Member 'GA_MeleeBase_C_EventReceived_0B203062449BD26DFF4FD78DFD131D80::EventTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_EventReceived_0B203062449BD26DFF4FD78DFD131D80, EventData) == 0x000008, "Member 'GA_MeleeBase_C_EventReceived_0B203062449BD26DFF4FD78DFD131D80::EventData' has a wrong offset!");

// Function GA_MeleeBase.GA_MeleeBase_C.TriggerMontageEvent
// 0x00D0 (0x00D0 - 0x0000)
struct GA_MeleeBase_C_TriggerMontageEvent final
{
public:
	struct FGameplayTag                           ContainerTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_K2_ApplyCheckAttributeModifiers_ReturnValue; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_565B[0x6];                                     // 0x00BA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyEffectContainer_ReturnValue;         // 0x00C0(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_MeleeBase_C_TriggerMontageEvent) == 0x000008, "Wrong alignment on GA_MeleeBase_C_TriggerMontageEvent");
static_assert(sizeof(GA_MeleeBase_C_TriggerMontageEvent) == 0x0000D0, "Wrong size on GA_MeleeBase_C_TriggerMontageEvent");
static_assert(offsetof(GA_MeleeBase_C_TriggerMontageEvent, ContainerTag) == 0x000000, "Member 'GA_MeleeBase_C_TriggerMontageEvent::ContainerTag' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_TriggerMontageEvent, EventData) == 0x000008, "Member 'GA_MeleeBase_C_TriggerMontageEvent::EventData' has a wrong offset!");
static_assert(offsetof(GA_MeleeBase_C_TriggerMontageEvent, CallFunc_K2_ApplyCheckAttributeModifiers_ReturnValue) == 0x0000B8, "Member 'GA_MeleeBase_C_TriggerMontageEvent::CallFunc_K2_ApplyCheckAttributeModifiers_ReturnValue' has a wrong offset!");
