#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpawnProjectileBase_Bow

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "GameplayAbilities_structs.hpp"
#include "Engine_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function GA_SpawnProjectileBase_Bow.GA_SpawnProjectileBase_Bow_C.ExecuteUbergraph_GA_SpawnProjectileBase_Bow
// 0x0B98 (0x0B98 - 0x0000)
struct GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NextSectionName;                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NextSectionName)>  K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B67[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaAbilityTask_JumpSection*          CallFunc_HottaWaitConditionJumpSection_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B68[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(bool IsAmming, const struct FVector& PlayerLocation, const struct FVector& AimmingLocation)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_CustomEvent_IsAmming_1;                     // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B69[0x3];                                     // 0x0045(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_PlayerLocation_1;               // 0x0048(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_AimmingLocation_1;              // 0x0054(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_IsAmming;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6A[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                K2Node_CustomEvent_PlayerLocation;                 // 0x0064(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_CustomEvent_AimmingLocation;                // 0x0070(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool IsAmming, const struct FVector& PlayerLocation, const struct FVector& AimmingLocation)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x007C(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                ___struct_Variable;                                // 0x008C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                ___struct_Variable_1;                              // 0x0098(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x00A4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6B[0x3];                                     // 0x00A5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaAbilityTask_AimmingChange*        CallFunc_HottaAimingChangeTask_ReturnValue;        // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6C[0x3];                                     // 0x00B1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_9;                     // 0x00B4(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B6D[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_9;                    // 0x00C0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0170(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_8;                     // 0x0180(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_8;                    // 0x0188(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0238(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_7;                     // 0x0248(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_7;                    // 0x0250(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0300(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_6;                     // 0x0310(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_6;                    // 0x0318(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x03C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_5;                     // 0x03D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_5;                    // 0x03E0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0490(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     ___struct_Variable_2;                              // 0x04A0(0x00B0)()
	struct FGameplayTag                           ___struct_Variable_3;                              // 0x0550(0x0008)(NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeWaited;                     // 0x0558(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(float TimeWaited)>             K2Node_CreateDelegate_OutputDelegate_8;            // 0x055C(0x0010)(ZeroConstructor, NoDestructor)
	float                                         ___float_Variable;                                 // 0x056C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaWaitInputPressTask*               CallFunc_HottaWaitInputPress_ReturnValue;          // 0x0570(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0578(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B6E[0x3];                                     // 0x0579(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x057C(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_4;                     // 0x058C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B6F[0x4];                                     // 0x0594(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_4;                    // 0x0598(0x00B0)()
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_3;                     // 0x0648(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_3;                    // 0x0650(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x0700(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_2;                     // 0x0710(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_2;                    // 0x0718(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_11;           // 0x07C8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_1;                     // 0x07D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_1;                    // 0x07E0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_12;           // 0x0890(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x08A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x08A8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_13;           // 0x0958(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     ___struct_Variable_4;                              // 0x0968(0x00B0)()
	struct FGameplayTag                           ___struct_Variable_5;                              // 0x0A18(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_TriggerTag;                     // 0x0A20(0x0008)(NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& TriggerTag)> K2Node_CreateDelegate_OutputDelegate_14;           // 0x0A28(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           ___struct_Variable_6;                              // 0x0A38(0x0008)(NoDestructor, HasGetValueTypeHash)
	class UHottaAbilityTask_WaitDelay*            CallFunc_HottaWaitDelay_ReturnValue;               // 0x0A40(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x0A48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EMovementMode                                 K2Node_CustomEvent_NewMovementMode;                // 0x0A49(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B70[0x2];                                     // 0x0A4A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(EMovementMode NewMovementMode)> K2Node_CreateDelegate_OutputDelegate_15;           // 0x0A4C(0x0010)(ZeroConstructor, NoDestructor)
	EMovementMode                                 ___byte_Variable;                                  // 0x0A5C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1B71[0x3];                                     // 0x0A5D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UAbilityTask_WaitMovementModeChange*    CallFunc_CreateWaitMovementModeChange_ReturnValue; // 0x0A60(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0A68(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0A69(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B72[0x6];                                     // 0x0A6A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UGameplayAbility*                       K2Node_CustomEvent_ActivatedAbility;               // 0x0A70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UGameplayAbility* ActivatedAbility)> K2Node_CreateDelegate_OutputDelegate_16;           // 0x0A78(0x0010)(ZeroConstructor, NoDestructor)
	class UGameplayAbility*                       ___object_Variable;                                // 0x0A88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilityTask_WaitAbilityActivate*       CallFunc_WaitForAbilityActivate_ReturnValue;       // 0x0A90(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x0A98(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B73[0x7];                                     // 0x0A99(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaSkill*                            K2Node_DynamicCast_AsHotta_Skill;                  // 0x0AA0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0AA8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B74[0x7];                                     // 0x0AA9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaWaitInputReleaseTask*             CallFunc_HottaWaitInputRelease_ReturnValue;        // 0x0AB0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x0AB8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_7;                    // 0x0AB9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B75[0x2];                                     // 0x0ABA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ___float_Variable_1;                               // 0x0ABC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_1;                                // 0x0AC0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B76[0x3];                                     // 0x0AC1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0AC4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_GetSkillStartSectionName_ReturnValue;     // 0x0AC8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0AD0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B77[0x7];                                     // 0x0AD1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaSkillTask_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue;   // 0x0AD8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_8;                    // 0x0AE0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0AE1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CurrentMontage_IsPlaying_ReturnValue;     // 0x0AE2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B78[0x5];                                     // 0x0AE3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaWaitInputReleaseTask*             CallFunc_HottaWaitInputRelease_ReturnValue_1;      // 0x0AE8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_9;                    // 0x0AF0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B79[0x3];                                     // 0x0AF1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_JumpSectionName;                      // 0x0AF4(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_CustomEvent_TimeHeld_1;                     // 0x0AFC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAuto_1;                        // 0x0B00(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B7A[0x7];                                     // 0x0B01(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaSkillTask_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1; // 0x0B08(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_10;                   // 0x0B10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CurrentMontage_IsPlaying_ReturnValue_1;   // 0x0B11(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B7B[0x2];                                     // 0x0B12(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld, bool bAuto)>   K2Node_CreateDelegate_OutputDelegate_17;           // 0x0B14(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_11;                   // 0x0B24(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B7C[0x3];                                     // 0x0B25(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue;  // 0x0B28(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x0B30(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B7D[0x7];                                     // 0x0B31(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0B38(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0B40(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B7E[0x3];                                     // 0x0B41(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         ___float_Variable_2;                               // 0x0B44(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_2;                                // 0x0B48(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B7F[0x3];                                     // 0x0B49(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x0B4C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAuto;                          // 0x0B50(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClientOrStandalone_ReturnValue;         // 0x0B51(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B80[0x2];                                     // 0x0B52(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld, bool bAuto)>   K2Node_CreateDelegate_OutputDelegate_18;           // 0x0B54(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_1B81[0x4];                                     // 0x0B64(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_1; // 0x0B68(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character_1;     // 0x0B70(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0B78(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsInAssistAniming_ReturnValue;         // 0x0B79(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B82[0x6];                                     // 0x0B7A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwningActorFromActorInfo_ReturnValue_2; // 0x0B80(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character_2;     // 0x0B88(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0B90(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClientOrStandalone_ReturnValue_1;       // 0x0B91(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetIsInAssistAniming_ReturnValue_1;       // 0x0B92(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClientOrStandalone_ReturnValue_2;       // 0x0B93(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow) == 0x000008, "Wrong alignment on GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow");
static_assert(sizeof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow) == 0x000B98, "Wrong size on GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, EntryPoint) == 0x000000, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_NextSectionName) == 0x000004, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_NextSectionName' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___name_Variable) == 0x00001C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___name_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_HottaWaitConditionJumpSection_ReturnValue) == 0x000028, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_HottaWaitConditionJumpSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_IsAmming_1) == 0x000044, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_IsAmming_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_PlayerLocation_1) == 0x000048, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_PlayerLocation_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_AimmingLocation_1) == 0x000054, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_AimmingLocation_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_IsAmming) == 0x000060, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_IsAmming' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_PlayerLocation) == 0x000064, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_PlayerLocation' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_AimmingLocation) == 0x000070, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_AimmingLocation' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_2) == 0x00007C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___struct_Variable) == 0x00008C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___struct_Variable_1) == 0x000098, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___bool_Variable) == 0x0000A4, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_HottaAimingChangeTask_ReturnValue) == 0x0000A8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_HottaAimingChangeTask_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_1) == 0x0000B0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventTag_9) == 0x0000B4, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventTag_9' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventData_9) == 0x0000C0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventData_9' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_3) == 0x000170, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventTag_8) == 0x000180, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventTag_8' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventData_8) == 0x000188, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventData_8' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_4) == 0x000238, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventTag_7) == 0x000248, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventTag_7' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventData_7) == 0x000250, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventData_7' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_5) == 0x000300, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventTag_6) == 0x000310, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventTag_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventData_6) == 0x000318, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventData_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_6) == 0x0003C8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventTag_5) == 0x0003D8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventTag_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventData_5) == 0x0003E0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventData_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_7) == 0x000490, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___struct_Variable_2) == 0x0004A0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___struct_Variable_3) == 0x000550, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_TimeWaited) == 0x000558, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_TimeWaited' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_8) == 0x00055C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___float_Variable) == 0x00056C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___float_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_HottaWaitInputPress_ReturnValue) == 0x000570, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_HottaWaitInputPress_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_2) == 0x000578, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_9) == 0x00057C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventTag_4) == 0x00058C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventTag_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventData_4) == 0x000598, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventData_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventTag_3) == 0x000648, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventTag_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventData_3) == 0x000650, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventData_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_10) == 0x000700, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventTag_2) == 0x000710, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventTag_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventData_2) == 0x000718, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventData_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_11) == 0x0007C8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventTag_1) == 0x0007D8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventTag_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventData_1) == 0x0007E0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventData_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_12) == 0x000890, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_12' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventTag) == 0x0008A0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_EventData) == 0x0008A8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_13) == 0x000958, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_13' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___struct_Variable_4) == 0x000968, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___struct_Variable_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___struct_Variable_5) == 0x000A18, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___struct_Variable_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_TriggerTag) == 0x000A20, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_TriggerTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_14) == 0x000A28, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_14' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___struct_Variable_6) == 0x000A38, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___struct_Variable_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_HottaWaitDelay_ReturnValue) == 0x000A40, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_HottaWaitDelay_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_3) == 0x000A48, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_NewMovementMode) == 0x000A49, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_NewMovementMode' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_15) == 0x000A4C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_15' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___byte_Variable) == 0x000A5C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___byte_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_CreateWaitMovementModeChange_ReturnValue) == 0x000A60, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_CreateWaitMovementModeChange_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_4) == 0x000A68, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000A69, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_ActivatedAbility) == 0x000A70, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_ActivatedAbility' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_16) == 0x000A78, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_16' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___object_Variable) == 0x000A88, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___object_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_WaitForAbilityActivate_ReturnValue) == 0x000A90, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_WaitForAbilityActivate_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_5) == 0x000A98, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_DynamicCast_AsHotta_Skill) == 0x000AA0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_DynamicCast_AsHotta_Skill' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_DynamicCast_bSuccess) == 0x000AA8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_HottaWaitInputRelease_ReturnValue) == 0x000AB0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_HottaWaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_6) == 0x000AB8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_7) == 0x000AB9, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_7' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___float_Variable_1) == 0x000ABC, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___float_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___bool_Variable_1) == 0x000AC0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_Map_Length_ReturnValue) == 0x000AC4, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_GetSkillStartSectionName_ReturnValue) == 0x000AC8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_GetSkillStartSectionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_Greater_IntInt_ReturnValue) == 0x000AD0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_PlayMontageAndWaitForEvent_ReturnValue) == 0x000AD8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_PlayMontageAndWaitForEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_8) == 0x000AE0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_8' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_K2_CommitAbility_ReturnValue) == 0x000AE1, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_CurrentMontage_IsPlaying_ReturnValue) == 0x000AE2, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_CurrentMontage_IsPlaying_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_HottaWaitInputRelease_ReturnValue_1) == 0x000AE8, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_HottaWaitInputRelease_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_9) == 0x000AF0, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_9' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_Event_JumpSectionName) == 0x000AF4, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_Event_JumpSectionName' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_TimeHeld_1) == 0x000AFC, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_TimeHeld_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_bAuto_1) == 0x000B00, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_bAuto_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1) == 0x000B08, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_10) == 0x000B10, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_10' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_CurrentMontage_IsPlaying_ReturnValue_1) == 0x000B11, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_CurrentMontage_IsPlaying_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_17) == 0x000B14, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_17' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsValid_ReturnValue_11) == 0x000B24, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsValid_ReturnValue_11' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_GetOwningActorFromActorInfo_ReturnValue) == 0x000B28, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_GetOwningActorFromActorInfo_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_Event_bWasCancelled) == 0x000B30, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000B38, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_DynamicCast_bSuccess_1) == 0x000B40, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___float_Variable_2) == 0x000B44, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___float_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, ___bool_Variable_2) == 0x000B48, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::___bool_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_TimeHeld) == 0x000B4C, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CustomEvent_bAuto) == 0x000B50, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CustomEvent_bAuto' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsClientOrStandalone_ReturnValue) == 0x000B51, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsClientOrStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_CreateDelegate_OutputDelegate_18) == 0x000B54, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_CreateDelegate_OutputDelegate_18' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_GetOwningActorFromActorInfo_ReturnValue_1) == 0x000B68, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_GetOwningActorFromActorInfo_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_DynamicCast_AsHotta_Player_Character_1) == 0x000B70, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_DynamicCast_AsHotta_Player_Character_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_DynamicCast_bSuccess_2) == 0x000B78, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_GetIsInAssistAniming_ReturnValue) == 0x000B79, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_GetIsInAssistAniming_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_GetOwningActorFromActorInfo_ReturnValue_2) == 0x000B80, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_GetOwningActorFromActorInfo_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_DynamicCast_AsHotta_Player_Character_2) == 0x000B88, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_DynamicCast_AsHotta_Player_Character_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, K2Node_DynamicCast_bSuccess_3) == 0x000B90, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsClientOrStandalone_ReturnValue_1) == 0x000B91, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsClientOrStandalone_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_GetIsInAssistAniming_ReturnValue_1) == 0x000B92, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_GetIsInAssistAniming_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow, CallFunc_IsClientOrStandalone_ReturnValue_2) == 0x000B93, "Member 'GA_SpawnProjectileBase_Bow_C_ExecuteUbergraph_GA_SpawnProjectileBase_Bow::CallFunc_IsClientOrStandalone_ReturnValue_2' has a wrong offset!");

// Function GA_SpawnProjectileBase_Bow.GA_SpawnProjectileBase_Bow_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_SpawnProjectileBase_Bow_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpawnProjectileBase_Bow_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_SpawnProjectileBase_Bow_C_K2_OnEndAbility");
static_assert(sizeof(GA_SpawnProjectileBase_Bow_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_SpawnProjectileBase_Bow_C_K2_OnEndAbility");
static_assert(offsetof(GA_SpawnProjectileBase_Bow_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_SpawnProjectileBase_Bow_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_SpawnProjectileBase_Bow.GA_SpawnProjectileBase_Bow_C.K2_TriggerJumpSection
// 0x0008 (0x0008 - 0x0000)
