#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpawnDamageActorBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.ExecuteUbergraph_GA_SpawnDamageActorBase
// 0x09F8 (0x09F8 - 0x0000)
struct GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NextSectionName;                // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NextSectionName)>  K2Node_CreateDelegate_OutputDelegate;              // 0x000C(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58E2[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaAbilityTask_JumpSection*          CallFunc_HottaWaitConditionJumpSection_ReturnValue; // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58E3[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_9;                     // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_58E4[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_9;                    // 0x0050(0x00B0)()
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_8;                     // 0x0100(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_8;                    // 0x0108(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x01B8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_7;                     // 0x01C8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_7;                    // 0x01D0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0280(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_6;                     // 0x0290(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_6;                    // 0x0298(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x0348(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_5;                     // 0x0358(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_5;                    // 0x0360(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0410(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     ___struct_Variable;                                // 0x0420(0x00B0)()
	struct FGameplayTag                           ___struct_Variable_1;                              // 0x04D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_4;                     // 0x04D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_4;                    // 0x04E0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0590(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_3;                     // 0x05A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_3;                    // 0x05A8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x0658(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_2;                     // 0x0668(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_2;                    // 0x0670(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x0720(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_1;                     // 0x0730(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_1;                    // 0x0738(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x07E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x07F8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x0800(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_10;           // 0x08B0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     ___struct_Variable_2;                              // 0x08C0(0x00B0)()
	struct FGameplayTag                           ___struct_Variable_3;                              // 0x0970(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BlueprintCommitCheck_ReturnValue;         // 0x0979(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x097A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x097B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue_1;           // 0x097C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x097D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x097E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58E5[0x1];                                     // 0x097F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_JumpSectionName;                      // 0x0980(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0988(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x098C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58E6[0x3];                                     // 0x098D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaSkillTask_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue;   // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0998(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58E7[0x7];                                     // 0x0999(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaWaitInputReleaseTask*             CallFunc_HottaWaitInputRelease_ReturnValue;        // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58E8[0x3];                                     // 0x09A9(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSkillStartSectionName_ReturnValue;     // 0x09AC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ___float_Variable;                                 // 0x09B4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaSkillTask_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1; // 0x09B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x09C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x09C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x09C2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_3;        // 0x09C3(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         K2Node_CustomEvent_TimeHeld;                       // 0x09C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAuto;                          // 0x09C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_4;        // 0x09C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58E9[0x2];                                     // 0x09CA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(float TimeHeld, bool bAuto)>   K2Node_CreateDelegate_OutputDelegate_11;           // 0x09CC(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x09DC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bWasCancelled;                        // 0x09DD(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_CheckNeedUseInputReleaseTask_Return;      // 0x09DE(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58EA[0x1];                                     // 0x09DF(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetHoldSection_ReturnValue;               // 0x09E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x09E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x09E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58EB[0x2];                                     // 0x09EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetHoldSection_ReturnValue_1;             // 0x09EC(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCommit;                        // 0x09F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase");
static_assert(sizeof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase) == 0x0009F8, "Wrong size on GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, EntryPoint) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_NextSectionName) == 0x000004, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_NextSectionName' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate) == 0x00000C, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, ___name_Variable) == 0x00001C, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::___name_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_HottaWaitConditionJumpSection_ReturnValue) == 0x000028, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_HottaWaitConditionJumpSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_IsValid_ReturnValue) == 0x000030, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000034, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventTag_9) == 0x000044, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventTag_9' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventData_9) == 0x000050, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventData_9' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventTag_8) == 0x000100, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventTag_8' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventData_8) == 0x000108, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventData_8' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x0001B8, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventTag_7) == 0x0001C8, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventTag_7' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventData_7) == 0x0001D0, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventData_7' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x000280, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventTag_6) == 0x000290, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventTag_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventData_6) == 0x000298, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventData_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x000348, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventTag_5) == 0x000358, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventTag_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventData_5) == 0x000360, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventData_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x000410, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, ___struct_Variable) == 0x000420, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, ___struct_Variable_1) == 0x0004D0, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventTag_4) == 0x0004D8, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventTag_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventData_4) == 0x0004E0, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventData_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_6) == 0x000590, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventTag_3) == 0x0005A0, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventTag_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventData_3) == 0x0005A8, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventData_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_7) == 0x000658, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventTag_2) == 0x000668, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventTag_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventData_2) == 0x000670, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventData_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_8) == 0x000720, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventTag_1) == 0x000730, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventTag_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventData_1) == 0x000738, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventData_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_9) == 0x0007E8, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventTag) == 0x0007F8, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_EventData) == 0x000800, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_10) == 0x0008B0, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, ___struct_Variable_2) == 0x0008C0, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, ___struct_Variable_3) == 0x000970, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_K2_CommitAbility_ReturnValue) == 0x000978, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_BlueprintCommitCheck_ReturnValue) == 0x000979, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_BlueprintCommitCheck_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x00097A, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_Not_PreBool_ReturnValue) == 0x00097B, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_K2_CommitAbility_ReturnValue_1) == 0x00097C, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_K2_CommitAbility_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x00097D, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_EqualEqual_ByteByte_ReturnValue_2) == 0x00097E, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_EqualEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_Event_JumpSectionName) == 0x000980, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_Event_JumpSectionName' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_Map_Length_ReturnValue) == 0x000988, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_Greater_IntInt_ReturnValue) == 0x00098C, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_PlayMontageAndWaitForEvent_ReturnValue) == 0x000990, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_PlayMontageAndWaitForEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_IsValid_ReturnValue_1) == 0x000998, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_HottaWaitInputRelease_ReturnValue) == 0x0009A0, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_HottaWaitInputRelease_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_IsValid_ReturnValue_2) == 0x0009A8, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_GetSkillStartSectionName_ReturnValue) == 0x0009AC, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_GetSkillStartSectionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, ___float_Variable) == 0x0009B4, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::___float_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1) == 0x0009B8, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, ___bool_Variable) == 0x0009C0, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::___bool_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_Not_PreBool_ReturnValue_1) == 0x0009C1, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_IsValid_ReturnValue_3) == 0x0009C2, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_IsValid_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_EqualEqual_ByteByte_ReturnValue_3) == 0x0009C3, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_EqualEqual_ByteByte_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_TimeHeld) == 0x0009C4, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_bAuto) == 0x0009C8, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_bAuto' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_EqualEqual_ByteByte_ReturnValue_4) == 0x0009C9, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_EqualEqual_ByteByte_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CreateDelegate_OutputDelegate_11) == 0x0009CC, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CreateDelegate_OutputDelegate_11' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_BooleanOR_ReturnValue) == 0x0009DC, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_Event_bWasCancelled) == 0x0009DD, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_Event_bWasCancelled' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_CheckNeedUseInputReleaseTask_Return) == 0x0009DE, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_CheckNeedUseInputReleaseTask_Return' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_GetHoldSection_ReturnValue) == 0x0009E0, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_GetHoldSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_Not_PreBool_ReturnValue_2) == 0x0009E8, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_BooleanOR_ReturnValue_1) == 0x0009E9, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, CallFunc_GetHoldSection_ReturnValue_1) == 0x0009EC, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::CallFunc_GetHoldSection_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase, K2Node_CustomEvent_bCommit) == 0x0009F4, "Member 'GA_SpawnDamageActorBase_C_ExecuteUbergraph_GA_SpawnDamageActorBase::K2Node_CustomEvent_bCommit' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.AfterCommitAbilityEvent
// 0x0001 (0x0001 - 0x0000)
struct GA_SpawnDamageActorBase_C_AfterCommitAbilityEvent final
{
public:
	bool                                          bCommit;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_AfterCommitAbilityEvent) == 0x000001, "Wrong alignment on GA_SpawnDamageActorBase_C_AfterCommitAbilityEvent");
static_assert(sizeof(GA_SpawnDamageActorBase_C_AfterCommitAbilityEvent) == 0x000001, "Wrong size on GA_SpawnDamageActorBase_C_AfterCommitAbilityEvent");
static_assert(offsetof(GA_SpawnDamageActorBase_C_AfterCommitAbilityEvent, bCommit) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_AfterCommitAbilityEvent::bCommit' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.K2_OnEndAbility
// 0x0001 (0x0001 - 0x0000)
struct GA_SpawnDamageActorBase_C_K2_OnEndAbility final
{
public:
	bool                                          bWasCancelled;                                     // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_K2_OnEndAbility) == 0x000001, "Wrong alignment on GA_SpawnDamageActorBase_C_K2_OnEndAbility");
static_assert(sizeof(GA_SpawnDamageActorBase_C_K2_OnEndAbility) == 0x000001, "Wrong size on GA_SpawnDamageActorBase_C_K2_OnEndAbility");
static_assert(offsetof(GA_SpawnDamageActorBase_C_K2_OnEndAbility, bWasCancelled) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_K2_OnEndAbility::bWasCancelled' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.K2_TriggerJumpSection
// 0x0008 (0x0008 - 0x0000)
struct GA_SpawnDamageActorBase_C_K2_TriggerJumpSection final
{
public:
	class FName                                   JumpSectionName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_K2_TriggerJumpSection) == 0x000004, "Wrong alignment on GA_SpawnDamageActorBase_C_K2_TriggerJumpSection");
static_assert(sizeof(GA_SpawnDamageActorBase_C_K2_TriggerJumpSection) == 0x000008, "Wrong size on GA_SpawnDamageActorBase_C_K2_TriggerJumpSection");
static_assert(offsetof(GA_SpawnDamageActorBase_C_K2_TriggerJumpSection, JumpSectionName) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_K2_TriggerJumpSection::JumpSectionName' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.OnCompleted_BBD44C30403383B392603D97D6025A48
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnDamageActorBase_C_OnCompleted_BBD44C30403383B392603D97D6025A48 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_OnCompleted_BBD44C30403383B392603D97D6025A48) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_OnCompleted_BBD44C30403383B392603D97D6025A48");
static_assert(sizeof(GA_SpawnDamageActorBase_C_OnCompleted_BBD44C30403383B392603D97D6025A48) == 0x0000B8, "Wrong size on GA_SpawnDamageActorBase_C_OnCompleted_BBD44C30403383B392603D97D6025A48");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnCompleted_BBD44C30403383B392603D97D6025A48, EventTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_OnCompleted_BBD44C30403383B392603D97D6025A48::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnCompleted_BBD44C30403383B392603D97D6025A48, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_OnCompleted_BBD44C30403383B392603D97D6025A48::EventData' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.OnBlendOut_BBD44C30403383B392603D97D6025A48
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnDamageActorBase_C_OnBlendOut_BBD44C30403383B392603D97D6025A48 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_OnBlendOut_BBD44C30403383B392603D97D6025A48) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_OnBlendOut_BBD44C30403383B392603D97D6025A48");
static_assert(sizeof(GA_SpawnDamageActorBase_C_OnBlendOut_BBD44C30403383B392603D97D6025A48) == 0x0000B8, "Wrong size on GA_SpawnDamageActorBase_C_OnBlendOut_BBD44C30403383B392603D97D6025A48");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnBlendOut_BBD44C30403383B392603D97D6025A48, EventTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_OnBlendOut_BBD44C30403383B392603D97D6025A48::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnBlendOut_BBD44C30403383B392603D97D6025A48, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_OnBlendOut_BBD44C30403383B392603D97D6025A48::EventData' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.OnInterrupted_BBD44C30403383B392603D97D6025A48
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnDamageActorBase_C_OnInterrupted_BBD44C30403383B392603D97D6025A48 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_OnInterrupted_BBD44C30403383B392603D97D6025A48) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_OnInterrupted_BBD44C30403383B392603D97D6025A48");
static_assert(sizeof(GA_SpawnDamageActorBase_C_OnInterrupted_BBD44C30403383B392603D97D6025A48) == 0x0000B8, "Wrong size on GA_SpawnDamageActorBase_C_OnInterrupted_BBD44C30403383B392603D97D6025A48");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnInterrupted_BBD44C30403383B392603D97D6025A48, EventTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_OnInterrupted_BBD44C30403383B392603D97D6025A48::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnInterrupted_BBD44C30403383B392603D97D6025A48, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_OnInterrupted_BBD44C30403383B392603D97D6025A48::EventData' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.OnCancelled_BBD44C30403383B392603D97D6025A48
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnDamageActorBase_C_OnCancelled_BBD44C30403383B392603D97D6025A48 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_OnCancelled_BBD44C30403383B392603D97D6025A48) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_OnCancelled_BBD44C30403383B392603D97D6025A48");
static_assert(sizeof(GA_SpawnDamageActorBase_C_OnCancelled_BBD44C30403383B392603D97D6025A48) == 0x0000B8, "Wrong size on GA_SpawnDamageActorBase_C_OnCancelled_BBD44C30403383B392603D97D6025A48");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnCancelled_BBD44C30403383B392603D97D6025A48, EventTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_OnCancelled_BBD44C30403383B392603D97D6025A48::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnCancelled_BBD44C30403383B392603D97D6025A48, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_OnCancelled_BBD44C30403383B392603D97D6025A48::EventData' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.EventReceived_BBD44C30403383B392603D97D6025A48
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnDamageActorBase_C_EventReceived_BBD44C30403383B392603D97D6025A48 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_EventReceived_BBD44C30403383B392603D97D6025A48) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_EventReceived_BBD44C30403383B392603D97D6025A48");
static_assert(sizeof(GA_SpawnDamageActorBase_C_EventReceived_BBD44C30403383B392603D97D6025A48) == 0x0000B8, "Wrong size on GA_SpawnDamageActorBase_C_EventReceived_BBD44C30403383B392603D97D6025A48");
static_assert(offsetof(GA_SpawnDamageActorBase_C_EventReceived_BBD44C30403383B392603D97D6025A48, EventTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_EventReceived_BBD44C30403383B392603D97D6025A48::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_EventReceived_BBD44C30403383B392603D97D6025A48, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_EventReceived_BBD44C30403383B392603D97D6025A48::EventData' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.OnCompleted_8D5F5A1C486D7457E4C4018946DF9359
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnDamageActorBase_C_OnCompleted_8D5F5A1C486D7457E4C4018946DF9359 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_OnCompleted_8D5F5A1C486D7457E4C4018946DF9359) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_OnCompleted_8D5F5A1C486D7457E4C4018946DF9359");
static_assert(sizeof(GA_SpawnDamageActorBase_C_OnCompleted_8D5F5A1C486D7457E4C4018946DF9359) == 0x0000B8, "Wrong size on GA_SpawnDamageActorBase_C_OnCompleted_8D5F5A1C486D7457E4C4018946DF9359");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnCompleted_8D5F5A1C486D7457E4C4018946DF9359, EventTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_OnCompleted_8D5F5A1C486D7457E4C4018946DF9359::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnCompleted_8D5F5A1C486D7457E4C4018946DF9359, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_OnCompleted_8D5F5A1C486D7457E4C4018946DF9359::EventData' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnDamageActorBase_C_OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359");
static_assert(sizeof(GA_SpawnDamageActorBase_C_OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359) == 0x0000B8, "Wrong size on GA_SpawnDamageActorBase_C_OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359, EventTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359::EventData' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnDamageActorBase_C_OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359");
static_assert(sizeof(GA_SpawnDamageActorBase_C_OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359) == 0x0000B8, "Wrong size on GA_SpawnDamageActorBase_C_OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359, EventTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359::EventData' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.OnCancelled_8D5F5A1C486D7457E4C4018946DF9359
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnDamageActorBase_C_OnCancelled_8D5F5A1C486D7457E4C4018946DF9359 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_OnCancelled_8D5F5A1C486D7457E4C4018946DF9359) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_OnCancelled_8D5F5A1C486D7457E4C4018946DF9359");
static_assert(sizeof(GA_SpawnDamageActorBase_C_OnCancelled_8D5F5A1C486D7457E4C4018946DF9359) == 0x0000B8, "Wrong size on GA_SpawnDamageActorBase_C_OnCancelled_8D5F5A1C486D7457E4C4018946DF9359");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnCancelled_8D5F5A1C486D7457E4C4018946DF9359, EventTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_OnCancelled_8D5F5A1C486D7457E4C4018946DF9359::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnCancelled_8D5F5A1C486D7457E4C4018946DF9359, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_OnCancelled_8D5F5A1C486D7457E4C4018946DF9359::EventData' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.EventReceived_8D5F5A1C486D7457E4C4018946DF9359
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnDamageActorBase_C_EventReceived_8D5F5A1C486D7457E4C4018946DF9359 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_EventReceived_8D5F5A1C486D7457E4C4018946DF9359) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_EventReceived_8D5F5A1C486D7457E4C4018946DF9359");
static_assert(sizeof(GA_SpawnDamageActorBase_C_EventReceived_8D5F5A1C486D7457E4C4018946DF9359) == 0x0000B8, "Wrong size on GA_SpawnDamageActorBase_C_EventReceived_8D5F5A1C486D7457E4C4018946DF9359");
static_assert(offsetof(GA_SpawnDamageActorBase_C_EventReceived_8D5F5A1C486D7457E4C4018946DF9359, EventTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_EventReceived_8D5F5A1C486D7457E4C4018946DF9359::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_EventReceived_8D5F5A1C486D7457E4C4018946DF9359, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_EventReceived_8D5F5A1C486D7457E4C4018946DF9359::EventData' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.OnTriggerNextSection_DF0FCD8E4E56B1CEE54E0DB72E9CA8AE
// 0x0008 (0x0008 - 0x0000)
struct GA_SpawnDamageActorBase_C_OnTriggerNextSection_DF0FCD8E4E56B1CEE54E0DB72E9CA8AE final
{
public:
	class FName                                   NextSectionName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_OnTriggerNextSection_DF0FCD8E4E56B1CEE54E0DB72E9CA8AE) == 0x000004, "Wrong alignment on GA_SpawnDamageActorBase_C_OnTriggerNextSection_DF0FCD8E4E56B1CEE54E0DB72E9CA8AE");
static_assert(sizeof(GA_SpawnDamageActorBase_C_OnTriggerNextSection_DF0FCD8E4E56B1CEE54E0DB72E9CA8AE) == 0x000008, "Wrong size on GA_SpawnDamageActorBase_C_OnTriggerNextSection_DF0FCD8E4E56B1CEE54E0DB72E9CA8AE");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnTriggerNextSection_DF0FCD8E4E56B1CEE54E0DB72E9CA8AE, NextSectionName) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_OnTriggerNextSection_DF0FCD8E4E56B1CEE54E0DB72E9CA8AE::NextSectionName' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03
// 0x0008 (0x0008 - 0x0000)
struct GA_SpawnDamageActorBase_C_OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03 final
{
public:
	float                                         TimeHeld;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bAuto;                                             // 0x0004(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03) == 0x000004, "Wrong alignment on GA_SpawnDamageActorBase_C_OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03");
static_assert(sizeof(GA_SpawnDamageActorBase_C_OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03) == 0x000008, "Wrong size on GA_SpawnDamageActorBase_C_OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03, TimeHeld) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03::TimeHeld' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03, bAuto) == 0x000004, "Member 'GA_SpawnDamageActorBase_C_OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03::bAuto' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.TriggerMontageEvent
// 0x00D0 (0x00D0 - 0x0000)
struct GA_SpawnDamageActorBase_C_TriggerMontageEvent final
{
public:
	struct FGameplayTag                           ContainerTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	bool                                          CallFunc_K2_ApplyCheckAttributeModifiers_ReturnValue; // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58EC[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyEffectContainer_ReturnValue;         // 0x00C0(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_TriggerMontageEvent) == 0x000008, "Wrong alignment on GA_SpawnDamageActorBase_C_TriggerMontageEvent");
static_assert(sizeof(GA_SpawnDamageActorBase_C_TriggerMontageEvent) == 0x0000D0, "Wrong size on GA_SpawnDamageActorBase_C_TriggerMontageEvent");
static_assert(offsetof(GA_SpawnDamageActorBase_C_TriggerMontageEvent, ContainerTag) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_TriggerMontageEvent::ContainerTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_TriggerMontageEvent, EventData) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_TriggerMontageEvent::EventData' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_TriggerMontageEvent, CallFunc_K2_ApplyCheckAttributeModifiers_ReturnValue) == 0x0000B8, "Member 'GA_SpawnDamageActorBase_C_TriggerMontageEvent::CallFunc_K2_ApplyCheckAttributeModifiers_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_TriggerMontageEvent, CallFunc_ApplyEffectContainer_ReturnValue) == 0x0000C0, "Member 'GA_SpawnDamageActorBase_C_TriggerMontageEvent::CallFunc_ApplyEffectContainer_ReturnValue' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.CheckNeedUseInputReleaseTask
// 0x0001 (0x0001 - 0x0000)
struct GA_SpawnDamageActorBase_C_CheckNeedUseInputReleaseTask final
{
public:
	bool                                          Return;                                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_CheckNeedUseInputReleaseTask) == 0x000001, "Wrong alignment on GA_SpawnDamageActorBase_C_CheckNeedUseInputReleaseTask");
static_assert(sizeof(GA_SpawnDamageActorBase_C_CheckNeedUseInputReleaseTask) == 0x000001, "Wrong size on GA_SpawnDamageActorBase_C_CheckNeedUseInputReleaseTask");
static_assert(offsetof(GA_SpawnDamageActorBase_C_CheckNeedUseInputReleaseTask, Return) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_CheckNeedUseInputReleaseTask::Return' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.FailCheckConsumeFun
// 0x0001 (0x0001 - 0x0000)
struct GA_SpawnDamageActorBase_C_FailCheckConsumeFun final
{
public:
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_FailCheckConsumeFun) == 0x000001, "Wrong alignment on GA_SpawnDamageActorBase_C_FailCheckConsumeFun");
static_assert(sizeof(GA_SpawnDamageActorBase_C_FailCheckConsumeFun) == 0x000001, "Wrong size on GA_SpawnDamageActorBase_C_FailCheckConsumeFun");
static_assert(offsetof(GA_SpawnDamageActorBase_C_FailCheckConsumeFun, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_FailCheckConsumeFun::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");

// Function GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C.CheckAkComp
// 0x0010 (0x0010 - 0x0000)
struct GA_SpawnDamageActorBase_C_CheckAkComp final
{
public:
	class FName                                   SectionName;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CheckSection;                                      // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SpawnDamageActorBase_C_CheckAkComp) == 0x000004, "Wrong alignment on GA_SpawnDamageActorBase_C_CheckAkComp");
static_assert(sizeof(GA_SpawnDamageActorBase_C_CheckAkComp) == 0x000010, "Wrong size on GA_SpawnDamageActorBase_C_CheckAkComp");
static_assert(offsetof(GA_SpawnDamageActorBase_C_CheckAkComp, SectionName) == 0x000000, "Member 'GA_SpawnDamageActorBase_C_CheckAkComp::SectionName' has a wrong offset!");
static_assert(offsetof(GA_SpawnDamageActorBase_C_CheckAkComp, CheckSection) == 0x000008, "Member 'GA_SpawnDamageActorBase_C_CheckAkComp::CheckSection' has a wrong offset!");

}

