#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpawnProjectileBase

#include "Basic.hpp"

#include "GA_HottaSkillBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SpawnProjectileBase.GA_SpawnProjectileBase_C
// 0x0010 (0x0CF0 - 0x0CE0)
class UGA_SpawnProjectileBase_C : public UGA_HottaSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_SpawnProjectileBase_C;           // 0x0CE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                          TriggerSpawnHottaActor;                            // 0x0CE8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          TriggerSpawnOnlyServerHottaActor;                  // 0x0CE9(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_SpawnProjectileBase(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void AimmingTaskChangeEvent(bool bAimming);
	void AfterCommitAbilityEvent(bool bCommit);
	void K2_ActivateAbility();
	void K2_TriggerJumpSection(class FName JumpSectionName);
	void OnRelease_720D8A0947002AC8F1880EB8351769B2(float TimeHeld, bool bAuto);
	void OnCompleted_96D5317C4775A544448D9085B4B2FB41(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnBlendOut_96D5317C4775A544448D9085B4B2FB41(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnInterrupted_96D5317C4775A544448D9085B4B2FB41(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCancelled_96D5317C4775A544448D9085B4B2FB41(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void EventReceived_96D5317C4775A544448D9085B4B2FB41(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCompleted_0CFB37974EE73114C9020FABD6B43AF3(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnBlendOut_0CFB37974EE73114C9020FABD6B43AF3(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnInterrupted_0CFB37974EE73114C9020FABD6B43AF3(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCancelled_0CFB37974EE73114C9020FABD6B43AF3(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void EventReceived_0CFB37974EE73114C9020FABD6B43AF3(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnIsAimming_0B0B3E9D4673CBFA7F868D875A356F4E(bool IsAmming, const struct FVector& PlayerLocation, const struct FVector& AimmingLocation);
	void ReceiveLocationInfo_0B0B3E9D4673CBFA7F868D875A356F4E(bool IsAmming, const struct FVector& PlayerLocation, const struct FVector& AimmingLocation);
	void OnChange_A167C14A4A8C9CDB1410138B28EB6A11(EMovementMode NewMovementMode);
	void OnTriggerNextSection_660A4D5247F785EA32CC7795FAF53557(class FName NextSectionName);
	void OnRelease_B7AA61AE4A3B19FB04ACF39B56CB00F9(float TimeHeld, bool bAuto);
	void OnRelease_CBAE303145C90FB7B19D318A73BA5C4C(float TimeHeld, bool bAuto);
	void PlayBowShootAinim();
	void PlayCarrierAim();
	void EnterAimmingState();
	void LeaveAimmingState();
	void TriggerMontageEvent(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	bool AfterAimmingNeedTriggerReleaseTask();
	void AfterAimmingForceSetStartSectionName();
	void PressHoldNeedEnterAimming(bool* Result);
	void WaitButtonReleaseToLeaveAimming(bool* Result);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SpawnProjectileBase_C">();
	}
	static class UGA_SpawnProjectileBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SpawnProjectileBase_C>();
	}
};
static_assert(alignof(UGA_SpawnProjectileBase_C) == 0x000010, "Wrong alignment on UGA_SpawnProjectileBase_C");
static_assert(sizeof(UGA_SpawnProjectileBase_C) == 0x000CF0, "Wrong size on UGA_SpawnProjectileBase_C");
static_assert(offsetof(UGA_SpawnProjectileBase_C, UberGraphFrame_GA_SpawnProjectileBase_C) == 0x000CE0, "Member 'UGA_SpawnProjectileBase_C::UberGraphFrame_GA_SpawnProjectileBase_C' has a wrong offset!");
static_assert(offsetof(UGA_SpawnProjectileBase_C, TriggerSpawnHottaActor) == 0x000CE8, "Member 'UGA_SpawnProjectileBase_C::TriggerSpawnHottaActor' has a wrong offset!");
static_assert(offsetof(UGA_SpawnProjectileBase_C, TriggerSpawnOnlyServerHottaActor) == 0x000CE9, "Member 'UGA_SpawnProjectileBase_C::TriggerSpawnOnlyServerHottaActor' has a wrong offset!");

}

