#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpawnRepeatingProjectileBase

#include "Basic.hpp"

#include "GA_HottaSkillBase_classes.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SpawnRepeatingProjectileBase.GA_SpawnRepeatingProjectileBase_C
// 0x0020 (0x0D00 - 0x0CE0)
class UGA_SpawnRepeatingProjectileBase_C : public UGA_HottaSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_SpawnRepeatingProjectileBase_C;  // 0x0CE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTag                           RepeatingTriggerTag;                               // 0x0CE8(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           TriggerCueTag;                                     // 0x0CF0(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	bool                                          bIsExcutedCue;                                     // 0x0CF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_SpawnRepeatingProjectileBase(int32 EntryPoint);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_ActivateAbility();
	void OnIsAimming_2AB4690C4F07DD7284175196DD1F2478(bool IsAmming, const struct FVector& PlayerLocation, const struct FVector& AimmingLocation);
	void ReceiveLocationInfo_2AB4690C4F07DD7284175196DD1F2478(bool IsAmming, const struct FVector& PlayerLocation, const struct FVector& AimmingLocation);
	void OnPress_284EC1DB4FE02D43A6810894505AD54D(float TimeWaited);
	void OnRelease_92607856474BAD52E47535827D47AD45(float TimeHeld, bool bAuto);
	void OnCompleted_0DBA7B154F4CDF808A282AA76394B1F9(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnBlendOut_0DBA7B154F4CDF808A282AA76394B1F9(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnInterrupted_0DBA7B154F4CDF808A282AA76394B1F9(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCancelled_0DBA7B154F4CDF808A282AA76394B1F9(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void EventReceived_0DBA7B154F4CDF808A282AA76394B1F9(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SpawnRepeatingProjectileBase_C">();
	}
	static class UGA_SpawnRepeatingProjectileBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SpawnRepeatingProjectileBase_C>();
	}
};
static_assert(alignof(UGA_SpawnRepeatingProjectileBase_C) == 0x000010, "Wrong alignment on UGA_SpawnRepeatingProjectileBase_C");
static_assert(sizeof(UGA_SpawnRepeatingProjectileBase_C) == 0x000D00, "Wrong size on UGA_SpawnRepeatingProjectileBase_C");
static_assert(offsetof(UGA_SpawnRepeatingProjectileBase_C, UberGraphFrame_GA_SpawnRepeatingProjectileBase_C) == 0x000CE0, "Member 'UGA_SpawnRepeatingProjectileBase_C::UberGraphFrame_GA_SpawnRepeatingProjectileBase_C' has a wrong offset!");
static_assert(offsetof(UGA_SpawnRepeatingProjectileBase_C, RepeatingTriggerTag) == 0x000CE8, "Member 'UGA_SpawnRepeatingProjectileBase_C::RepeatingTriggerTag' has a wrong offset!");
static_assert(offsetof(UGA_SpawnRepeatingProjectileBase_C, TriggerCueTag) == 0x000CF0, "Member 'UGA_SpawnRepeatingProjectileBase_C::TriggerCueTag' has a wrong offset!");
static_assert(offsetof(UGA_SpawnRepeatingProjectileBase_C, bIsExcutedCue) == 0x000CF8, "Member 'UGA_SpawnRepeatingProjectileBase_C::bIsExcutedCue' has a wrong offset!");

}

