#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpawnHottaActorBase

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.ExecuteUbergraph_GA_SpawnHottaActorBase
// 0x09B0 (0x09B0 - 0x0000)
struct GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Map_Length_ReturnValue;                   // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5824[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_9;                     // 0x001C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5825[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_9;                    // 0x0028(0x00B0)()
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_8;                     // 0x00D8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_8;                    // 0x00E0(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0190(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_7;                     // 0x01A0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_7;                    // 0x01A8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0258(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_6;                     // 0x0268(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_6;                    // 0x0270(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x0320(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_5;                     // 0x0330(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_5;                    // 0x0338(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_4;            // 0x03E8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     ___struct_Variable;                                // 0x03F8(0x00B0)()
	struct FGameplayTag                           ___struct_Variable_1;                              // 0x04A8(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_4;                     // 0x04B0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_4;                    // 0x04B8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_5;            // 0x0568(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_3;                     // 0x0578(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_3;                    // 0x0580(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_6;            // 0x0630(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_2;                     // 0x0640(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_2;                    // 0x0648(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_7;            // 0x06F8(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag_1;                     // 0x0708(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData_1;                    // 0x0710(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_8;            // 0x07C0(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayTag                           K2Node_CustomEvent_EventTag;                       // 0x07D0(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     K2Node_CustomEvent_EventData;                      // 0x07D8(0x00B0)()
	TDelegate<void(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData)> K2Node_CreateDelegate_OutputDelegate_9;            // 0x0888(0x0010)(ZeroConstructor, NoDestructor)
	struct FGameplayEventData                     ___struct_Variable_2;                              // 0x0898(0x00B0)()
	struct FGameplayTag                           ___struct_Variable_3;                              // 0x0948(0x0008)(NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_NextSectionName;                // 0x0950(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName NextSectionName)>  K2Node_CreateDelegate_OutputDelegate_10;           // 0x0958(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   ___name_Variable;                                  // 0x0968(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaAbilityTask_JumpSection*          CallFunc_HottaWaitConditionJumpSection_ReturnValue; // 0x0970(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0978(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CommitAbility_ReturnValue;             // 0x0979(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5826[0x2];                                     // 0x097A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_GetSkillStartSectionName_ReturnValue;     // 0x097C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_JumpSectionName;                      // 0x0984(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5827[0x4];                                     // 0x098C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaSkillTask_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue;   // 0x0990(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0998(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5828[0x7];                                     // 0x0999(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaSkillTask_PlayMontageAndWaitForEvent* CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1; // 0x09A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x09A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase");
static_assert(sizeof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase) == 0x0009B0, "Wrong size on GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, EntryPoint) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::EntryPoint' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, CallFunc_Map_Length_ReturnValue) == 0x000004, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::CallFunc_Map_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, CallFunc_Greater_IntInt_ReturnValue) == 0x000018, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventTag_9) == 0x00001C, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventTag_9' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventData_9) == 0x000028, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventData_9' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventTag_8) == 0x0000D8, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventTag_8' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventData_8) == 0x0000E0, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventData_8' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate_1) == 0x000190, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventTag_7) == 0x0001A0, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventTag_7' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventData_7) == 0x0001A8, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventData_7' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate_2) == 0x000258, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventTag_6) == 0x000268, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventTag_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventData_6) == 0x000270, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventData_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate_3) == 0x000320, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventTag_5) == 0x000330, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventTag_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventData_5) == 0x000338, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventData_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate_4) == 0x0003E8, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, ___struct_Variable) == 0x0003F8, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::___struct_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, ___struct_Variable_1) == 0x0004A8, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventTag_4) == 0x0004B0, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventTag_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventData_4) == 0x0004B8, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventData_4' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate_5) == 0x000568, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate_5' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventTag_3) == 0x000578, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventTag_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventData_3) == 0x000580, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventData_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate_6) == 0x000630, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate_6' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventTag_2) == 0x000640, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventTag_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventData_2) == 0x000648, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventData_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate_7) == 0x0006F8, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate_7' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventTag_1) == 0x000708, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventTag_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventData_1) == 0x000710, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventData_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate_8) == 0x0007C0, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate_8' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventTag) == 0x0007D0, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_EventData) == 0x0007D8, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_EventData' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate_9) == 0x000888, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate_9' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, ___struct_Variable_2) == 0x000898, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, ___struct_Variable_3) == 0x000948, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CustomEvent_NextSectionName) == 0x000950, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CustomEvent_NextSectionName' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_CreateDelegate_OutputDelegate_10) == 0x000958, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_CreateDelegate_OutputDelegate_10' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, ___name_Variable) == 0x000968, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::___name_Variable' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, CallFunc_HottaWaitConditionJumpSection_ReturnValue) == 0x000970, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::CallFunc_HottaWaitConditionJumpSection_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, CallFunc_IsValid_ReturnValue) == 0x000978, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, CallFunc_K2_CommitAbility_ReturnValue) == 0x000979, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::CallFunc_K2_CommitAbility_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, CallFunc_GetSkillStartSectionName_ReturnValue) == 0x00097C, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::CallFunc_GetSkillStartSectionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, K2Node_Event_JumpSectionName) == 0x000984, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::K2Node_Event_JumpSectionName' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, CallFunc_PlayMontageAndWaitForEvent_ReturnValue) == 0x000990, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::CallFunc_PlayMontageAndWaitForEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, CallFunc_IsValid_ReturnValue_1) == 0x000998, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1) == 0x0009A0, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::CallFunc_PlayMontageAndWaitForEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase, CallFunc_IsValid_ReturnValue_2) == 0x0009A8, "Member 'GA_SpawnHottaActorBase_C_ExecuteUbergraph_GA_SpawnHottaActorBase::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.K2_TriggerJumpSection
// 0x0008 (0x0008 - 0x0000)
struct GA_SpawnHottaActorBase_C_K2_TriggerJumpSection final
{
public:
	class FName                                   JumpSectionName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_K2_TriggerJumpSection) == 0x000004, "Wrong alignment on GA_SpawnHottaActorBase_C_K2_TriggerJumpSection");
static_assert(sizeof(GA_SpawnHottaActorBase_C_K2_TriggerJumpSection) == 0x000008, "Wrong size on GA_SpawnHottaActorBase_C_K2_TriggerJumpSection");
static_assert(offsetof(GA_SpawnHottaActorBase_C_K2_TriggerJumpSection, JumpSectionName) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_K2_TriggerJumpSection::JumpSectionName' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.OnTriggerNextSection_6DC6CBF04B1F669FCEE71899D75EFD41
// 0x0008 (0x0008 - 0x0000)
struct GA_SpawnHottaActorBase_C_OnTriggerNextSection_6DC6CBF04B1F669FCEE71899D75EFD41 final
{
public:
	class FName                                   NextSectionName;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_OnTriggerNextSection_6DC6CBF04B1F669FCEE71899D75EFD41) == 0x000004, "Wrong alignment on GA_SpawnHottaActorBase_C_OnTriggerNextSection_6DC6CBF04B1F669FCEE71899D75EFD41");
static_assert(sizeof(GA_SpawnHottaActorBase_C_OnTriggerNextSection_6DC6CBF04B1F669FCEE71899D75EFD41) == 0x000008, "Wrong size on GA_SpawnHottaActorBase_C_OnTriggerNextSection_6DC6CBF04B1F669FCEE71899D75EFD41");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnTriggerNextSection_6DC6CBF04B1F669FCEE71899D75EFD41, NextSectionName) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_OnTriggerNextSection_6DC6CBF04B1F669FCEE71899D75EFD41::NextSectionName' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.OnCompleted_C9329E844FB909621C9C28842E08F25A
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnHottaActorBase_C_OnCompleted_C9329E844FB909621C9C28842E08F25A final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_OnCompleted_C9329E844FB909621C9C28842E08F25A) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_OnCompleted_C9329E844FB909621C9C28842E08F25A");
static_assert(sizeof(GA_SpawnHottaActorBase_C_OnCompleted_C9329E844FB909621C9C28842E08F25A) == 0x0000B8, "Wrong size on GA_SpawnHottaActorBase_C_OnCompleted_C9329E844FB909621C9C28842E08F25A");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnCompleted_C9329E844FB909621C9C28842E08F25A, EventTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_OnCompleted_C9329E844FB909621C9C28842E08F25A::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnCompleted_C9329E844FB909621C9C28842E08F25A, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_OnCompleted_C9329E844FB909621C9C28842E08F25A::EventData' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.OnBlendOut_C9329E844FB909621C9C28842E08F25A
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnHottaActorBase_C_OnBlendOut_C9329E844FB909621C9C28842E08F25A final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_OnBlendOut_C9329E844FB909621C9C28842E08F25A) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_OnBlendOut_C9329E844FB909621C9C28842E08F25A");
static_assert(sizeof(GA_SpawnHottaActorBase_C_OnBlendOut_C9329E844FB909621C9C28842E08F25A) == 0x0000B8, "Wrong size on GA_SpawnHottaActorBase_C_OnBlendOut_C9329E844FB909621C9C28842E08F25A");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnBlendOut_C9329E844FB909621C9C28842E08F25A, EventTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_OnBlendOut_C9329E844FB909621C9C28842E08F25A::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnBlendOut_C9329E844FB909621C9C28842E08F25A, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_OnBlendOut_C9329E844FB909621C9C28842E08F25A::EventData' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.OnInterrupted_C9329E844FB909621C9C28842E08F25A
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnHottaActorBase_C_OnInterrupted_C9329E844FB909621C9C28842E08F25A final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_OnInterrupted_C9329E844FB909621C9C28842E08F25A) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_OnInterrupted_C9329E844FB909621C9C28842E08F25A");
static_assert(sizeof(GA_SpawnHottaActorBase_C_OnInterrupted_C9329E844FB909621C9C28842E08F25A) == 0x0000B8, "Wrong size on GA_SpawnHottaActorBase_C_OnInterrupted_C9329E844FB909621C9C28842E08F25A");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnInterrupted_C9329E844FB909621C9C28842E08F25A, EventTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_OnInterrupted_C9329E844FB909621C9C28842E08F25A::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnInterrupted_C9329E844FB909621C9C28842E08F25A, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_OnInterrupted_C9329E844FB909621C9C28842E08F25A::EventData' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.OnCancelled_C9329E844FB909621C9C28842E08F25A
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnHottaActorBase_C_OnCancelled_C9329E844FB909621C9C28842E08F25A final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_OnCancelled_C9329E844FB909621C9C28842E08F25A) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_OnCancelled_C9329E844FB909621C9C28842E08F25A");
static_assert(sizeof(GA_SpawnHottaActorBase_C_OnCancelled_C9329E844FB909621C9C28842E08F25A) == 0x0000B8, "Wrong size on GA_SpawnHottaActorBase_C_OnCancelled_C9329E844FB909621C9C28842E08F25A");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnCancelled_C9329E844FB909621C9C28842E08F25A, EventTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_OnCancelled_C9329E844FB909621C9C28842E08F25A::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnCancelled_C9329E844FB909621C9C28842E08F25A, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_OnCancelled_C9329E844FB909621C9C28842E08F25A::EventData' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.EventReceived_C9329E844FB909621C9C28842E08F25A
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnHottaActorBase_C_EventReceived_C9329E844FB909621C9C28842E08F25A final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_EventReceived_C9329E844FB909621C9C28842E08F25A) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_EventReceived_C9329E844FB909621C9C28842E08F25A");
static_assert(sizeof(GA_SpawnHottaActorBase_C_EventReceived_C9329E844FB909621C9C28842E08F25A) == 0x0000B8, "Wrong size on GA_SpawnHottaActorBase_C_EventReceived_C9329E844FB909621C9C28842E08F25A");
static_assert(offsetof(GA_SpawnHottaActorBase_C_EventReceived_C9329E844FB909621C9C28842E08F25A, EventTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_EventReceived_C9329E844FB909621C9C28842E08F25A::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_EventReceived_C9329E844FB909621C9C28842E08F25A, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_EventReceived_C9329E844FB909621C9C28842E08F25A::EventData' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.OnCompleted_99D3BA014A41C469D60D4EBBFFF54350
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnHottaActorBase_C_OnCompleted_99D3BA014A41C469D60D4EBBFFF54350 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_OnCompleted_99D3BA014A41C469D60D4EBBFFF54350) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_OnCompleted_99D3BA014A41C469D60D4EBBFFF54350");
static_assert(sizeof(GA_SpawnHottaActorBase_C_OnCompleted_99D3BA014A41C469D60D4EBBFFF54350) == 0x0000B8, "Wrong size on GA_SpawnHottaActorBase_C_OnCompleted_99D3BA014A41C469D60D4EBBFFF54350");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnCompleted_99D3BA014A41C469D60D4EBBFFF54350, EventTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_OnCompleted_99D3BA014A41C469D60D4EBBFFF54350::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnCompleted_99D3BA014A41C469D60D4EBBFFF54350, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_OnCompleted_99D3BA014A41C469D60D4EBBFFF54350::EventData' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.OnBlendOut_99D3BA014A41C469D60D4EBBFFF54350
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnHottaActorBase_C_OnBlendOut_99D3BA014A41C469D60D4EBBFFF54350 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_OnBlendOut_99D3BA014A41C469D60D4EBBFFF54350) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_OnBlendOut_99D3BA014A41C469D60D4EBBFFF54350");
static_assert(sizeof(GA_SpawnHottaActorBase_C_OnBlendOut_99D3BA014A41C469D60D4EBBFFF54350) == 0x0000B8, "Wrong size on GA_SpawnHottaActorBase_C_OnBlendOut_99D3BA014A41C469D60D4EBBFFF54350");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnBlendOut_99D3BA014A41C469D60D4EBBFFF54350, EventTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_OnBlendOut_99D3BA014A41C469D60D4EBBFFF54350::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnBlendOut_99D3BA014A41C469D60D4EBBFFF54350, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_OnBlendOut_99D3BA014A41C469D60D4EBBFFF54350::EventData' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.OnInterrupted_99D3BA014A41C469D60D4EBBFFF54350
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnHottaActorBase_C_OnInterrupted_99D3BA014A41C469D60D4EBBFFF54350 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_OnInterrupted_99D3BA014A41C469D60D4EBBFFF54350) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_OnInterrupted_99D3BA014A41C469D60D4EBBFFF54350");
static_assert(sizeof(GA_SpawnHottaActorBase_C_OnInterrupted_99D3BA014A41C469D60D4EBBFFF54350) == 0x0000B8, "Wrong size on GA_SpawnHottaActorBase_C_OnInterrupted_99D3BA014A41C469D60D4EBBFFF54350");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnInterrupted_99D3BA014A41C469D60D4EBBFFF54350, EventTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_OnInterrupted_99D3BA014A41C469D60D4EBBFFF54350::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnInterrupted_99D3BA014A41C469D60D4EBBFFF54350, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_OnInterrupted_99D3BA014A41C469D60D4EBBFFF54350::EventData' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.OnCancelled_99D3BA014A41C469D60D4EBBFFF54350
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnHottaActorBase_C_OnCancelled_99D3BA014A41C469D60D4EBBFFF54350 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_OnCancelled_99D3BA014A41C469D60D4EBBFFF54350) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_OnCancelled_99D3BA014A41C469D60D4EBBFFF54350");
static_assert(sizeof(GA_SpawnHottaActorBase_C_OnCancelled_99D3BA014A41C469D60D4EBBFFF54350) == 0x0000B8, "Wrong size on GA_SpawnHottaActorBase_C_OnCancelled_99D3BA014A41C469D60D4EBBFFF54350");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnCancelled_99D3BA014A41C469D60D4EBBFFF54350, EventTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_OnCancelled_99D3BA014A41C469D60D4EBBFFF54350::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_OnCancelled_99D3BA014A41C469D60D4EBBFFF54350, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_OnCancelled_99D3BA014A41C469D60D4EBBFFF54350::EventData' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.EventReceived_99D3BA014A41C469D60D4EBBFFF54350
// 0x00B8 (0x00B8 - 0x0000)
struct GA_SpawnHottaActorBase_C_EventReceived_99D3BA014A41C469D60D4EBBFFF54350 final
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_EventReceived_99D3BA014A41C469D60D4EBBFFF54350) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_EventReceived_99D3BA014A41C469D60D4EBBFFF54350");
static_assert(sizeof(GA_SpawnHottaActorBase_C_EventReceived_99D3BA014A41C469D60D4EBBFFF54350) == 0x0000B8, "Wrong size on GA_SpawnHottaActorBase_C_EventReceived_99D3BA014A41C469D60D4EBBFFF54350");
static_assert(offsetof(GA_SpawnHottaActorBase_C_EventReceived_99D3BA014A41C469D60D4EBBFFF54350, EventTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_EventReceived_99D3BA014A41C469D60D4EBBFFF54350::EventTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_EventReceived_99D3BA014A41C469D60D4EBBFFF54350, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_EventReceived_99D3BA014A41C469D60D4EBBFFF54350::EventData' has a wrong offset!");

// Function GA_SpawnHottaActorBase.GA_SpawnHottaActorBase_C.Trigger Montage Event
// 0x00C8 (0x00C8 - 0x0000)
struct GA_SpawnHottaActorBase_C_Trigger_Montage_Event final
{
public:
	struct FGameplayTag                           ContainerTag;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor, HasGetValueTypeHash)
	struct FGameplayEventData                     EventData;                                         // 0x0008(0x00B0)(BlueprintVisible, BlueprintReadOnly, Parm)
	TArray<struct FActiveGameplayEffectHandle>    CallFunc_ApplyEffectContainer_ReturnValue;         // 0x00B8(0x0010)(ReferenceParm)
};
static_assert(alignof(GA_SpawnHottaActorBase_C_Trigger_Montage_Event) == 0x000008, "Wrong alignment on GA_SpawnHottaActorBase_C_Trigger_Montage_Event");
static_assert(sizeof(GA_SpawnHottaActorBase_C_Trigger_Montage_Event) == 0x0000C8, "Wrong size on GA_SpawnHottaActorBase_C_Trigger_Montage_Event");
static_assert(offsetof(GA_SpawnHottaActorBase_C_Trigger_Montage_Event, ContainerTag) == 0x000000, "Member 'GA_SpawnHottaActorBase_C_Trigger_Montage_Event::ContainerTag' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_Trigger_Montage_Event, EventData) == 0x000008, "Member 'GA_SpawnHottaActorBase_C_Trigger_Montage_Event::EventData' has a wrong offset!");
static_assert(offsetof(GA_SpawnHottaActorBase_C_Trigger_Montage_Event, CallFunc_ApplyEffectContainer_ReturnValue) == 0x0000B8, "Member 'GA_SpawnHottaActorBase_C_Trigger_Montage_Event::CallFunc_ApplyEffectContainer_ReturnValue' has a wrong offset!");

}

