#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GA_SpawnDamageActorBase

#include "Basic.hpp"

#include "GA_HottaSkillBase_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_SpawnDamageActorBase.GA_SpawnDamageActorBase_C
// 0x0020 (0x0D00 - 0x0CE0)
class UGA_SpawnDamageActorBase_C : public UGA_HottaSkillBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_SpawnDamageActorBase_C;          // 0x0CE0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   StartSectionName;                                  // 0x0CE8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   AttributeModifierFailedSection;                    // 0x0CF0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          SpawnHottaActorFunc;                               // 0x0CF8(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GA_SpawnDamageActorBase(int32 EntryPoint);
	void AfterCommitAbilityEvent(bool bCommit);
	void K2_OnEndAbility(bool bWasCancelled);
	void K2_TriggerJumpSection(class FName JumpSectionName);
	void K2_ActivateAbility();
	void OnCompleted_BBD44C30403383B392603D97D6025A48(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnBlendOut_BBD44C30403383B392603D97D6025A48(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnInterrupted_BBD44C30403383B392603D97D6025A48(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCancelled_BBD44C30403383B392603D97D6025A48(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void EventReceived_BBD44C30403383B392603D97D6025A48(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCompleted_8D5F5A1C486D7457E4C4018946DF9359(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnBlendOut_8D5F5A1C486D7457E4C4018946DF9359(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnInterrupted_8D5F5A1C486D7457E4C4018946DF9359(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnCancelled_8D5F5A1C486D7457E4C4018946DF9359(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void EventReceived_8D5F5A1C486D7457E4C4018946DF9359(const struct FGameplayTag& EventTag, const struct FGameplayEventData& EventData);
	void OnTriggerNextSection_DF0FCD8E4E56B1CEE54E0DB72E9CA8AE(class FName NextSectionName);
	void OnRelease_1D3F9C5A4BB971EEADEBFFA1A3C53C03(float TimeHeld, bool bAuto);
	void TriggerMontageEvent(const struct FGameplayTag& ContainerTag, const struct FGameplayEventData& EventData);
	void CheckNeedUseInputReleaseTask(bool* Return);
	void FailCheckConsumeFun();
	void CheckAkComp(class FName SectionName, class FName CheckSection);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_SpawnDamageActorBase_C">();
	}
	static class UGA_SpawnDamageActorBase_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_SpawnDamageActorBase_C>();
	}
};
static_assert(alignof(UGA_SpawnDamageActorBase_C) == 0x000010, "Wrong alignment on UGA_SpawnDamageActorBase_C");
static_assert(sizeof(UGA_SpawnDamageActorBase_C) == 0x000D00, "Wrong size on UGA_SpawnDamageActorBase_C");
static_assert(offsetof(UGA_SpawnDamageActorBase_C, UberGraphFrame_GA_SpawnDamageActorBase_C) == 0x000CE0, "Member 'UGA_SpawnDamageActorBase_C::UberGraphFrame_GA_SpawnDamageActorBase_C' has a wrong offset!");
static_assert(offsetof(UGA_SpawnDamageActorBase_C, StartSectionName) == 0x000CE8, "Member 'UGA_SpawnDamageActorBase_C::StartSectionName' has a wrong offset!");
static_assert(offsetof(UGA_SpawnDamageActorBase_C, AttributeModifierFailedSection) == 0x000CF0, "Member 'UGA_SpawnDamageActorBase_C::AttributeModifierFailedSection' has a wrong offset!");
static_assert(offsetof(UGA_SpawnDamageActorBase_C, SpawnHottaActorFunc) == 0x000CF8, "Member 'UGA_SpawnDamageActorBase_C::SpawnHottaActorFunc' has a wrong offset!");

}

