#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GCBase_Buff

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GCBase_Buff.GCBase_Buff_C
// 0x0090 (0x04C8 - 0x0438)
class AGCBase_Buff_C : public AHaloBuffActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0438(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0440(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UParticleSystem>         ParticleTemplate;                                  // 0x0448(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                   SocketName;                                        // 0x0470(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                LocationOffset;                                    // 0x0478(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               RotationOffset;                                    // 0x0484(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                Scale;                                             // 0x0490(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Attached;                                          // 0x049C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_574F[0x3];                                     // 0x049D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               TempParticleCmp;                                   // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundBase*                             Sound;                                             // 0x04A8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   SectionName;                                       // 0x04B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   EndSectionName;                                    // 0x04B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedAdaptation;                                    // 0x04C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          bAbsoluteRotation;                                 // 0x04C1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	EAttachLocation                               Location_Type;                                     // 0x04C2(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CheckThirdClientEffect;                            // 0x04C3(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          AcceptCustomDilation;                              // 0x04C4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_GCBase_Buff(int32 EntryPoint);
	void CharacterCustomHideChanged(bool Param_bHidden);
	void ReceiveTick(float DeltaSeconds);
	bool OnActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnRemove(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	bool OnExecute(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void PlayParticleEffect(class AActor* MyTarget, class UParticleSystemComponent** OutParticleCmp);
	void PlaySound(class AActor* MyTarget);
	void PlayMontage(class AHottaCharacter* MyTarget, bool* Result);
	void OpenActorTick(class AHottaCharacter* Character);
	void CalcScale(float Highft, struct FVector* Param_Scale);
	void JumpOrStopMontage_Play(class AHottaCharacter* Character);
	bool WhileActive(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters);
	void ActiveFunction(class AActor* MyTarget, const struct FGameplayCueParameters& Parameters, bool* Result);
	void Get_Load_Particle_Comp(class UParticleSystem** ParticleEffect);
	void Set_Load_Particle_Comp(class UParticleSystem* NewParticle);
	void StopCurMontageSkill(class AHottaCharacter* Target);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GCBase_Buff_C">();
	}
	static class AGCBase_Buff_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AGCBase_Buff_C>();
	}
};
static_assert(alignof(AGCBase_Buff_C) == 0x000008, "Wrong alignment on AGCBase_Buff_C");
static_assert(sizeof(AGCBase_Buff_C) == 0x0004C8, "Wrong size on AGCBase_Buff_C");
static_assert(offsetof(AGCBase_Buff_C, UberGraphFrame) == 0x000438, "Member 'AGCBase_Buff_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, DefaultSceneRoot) == 0x000440, "Member 'AGCBase_Buff_C::DefaultSceneRoot' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, ParticleTemplate) == 0x000448, "Member 'AGCBase_Buff_C::ParticleTemplate' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, SocketName) == 0x000470, "Member 'AGCBase_Buff_C::SocketName' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, LocationOffset) == 0x000478, "Member 'AGCBase_Buff_C::LocationOffset' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, RotationOffset) == 0x000484, "Member 'AGCBase_Buff_C::RotationOffset' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, Scale) == 0x000490, "Member 'AGCBase_Buff_C::Scale' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, Attached) == 0x00049C, "Member 'AGCBase_Buff_C::Attached' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, TempParticleCmp) == 0x0004A0, "Member 'AGCBase_Buff_C::TempParticleCmp' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, Sound) == 0x0004A8, "Member 'AGCBase_Buff_C::Sound' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, SectionName) == 0x0004B0, "Member 'AGCBase_Buff_C::SectionName' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, EndSectionName) == 0x0004B8, "Member 'AGCBase_Buff_C::EndSectionName' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, NeedAdaptation) == 0x0004C0, "Member 'AGCBase_Buff_C::NeedAdaptation' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, bAbsoluteRotation) == 0x0004C1, "Member 'AGCBase_Buff_C::bAbsoluteRotation' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, Location_Type) == 0x0004C2, "Member 'AGCBase_Buff_C::Location_Type' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, CheckThirdClientEffect) == 0x0004C3, "Member 'AGCBase_Buff_C::CheckThirdClientEffect' has a wrong offset!");
static_assert(offsetof(AGCBase_Buff_C, AcceptCustomDilation) == 0x0004C4, "Member 'AGCBase_Buff_C::AcceptCustomDilation' has a wrong offset!");

}

