#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: GetRedEquipSpecialAttribute

#include "Basic.hpp"


namespace SDK::Params
{

// Function GetRedEquipSpecialAttribute.GetRedEquipSpecialAttribute_C.HottaCalculateBaseMagnitude
// 0x0050 (0x0050 - 0x0000)
struct GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude final
{
public:
	const class AActor*                           OwnerActor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           HitActor;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InstigatorActor;                                   // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_570D[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ActorHasTag_ReturnValue_1;                // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_570E[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        CallFunc_GetLeader_ReturnValue;                    // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute; // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_570F[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue; // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsMirrorCharacter_ReturnValue;            // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1; // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5710[0x2];                                     // 0x0042(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1; // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude) == 0x000008, "Wrong alignment on GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude");
static_assert(sizeof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude) == 0x000050, "Wrong size on GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, OwnerActor) == 0x000000, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::OwnerActor' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, HitActor) == 0x000008, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::HitActor' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, InstigatorActor) == 0x000010, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::InstigatorActor' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, ReturnValue) == 0x000018, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_AsHotta_Character) == 0x000020, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_ActorHasTag_ReturnValue) == 0x000029, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_ActorHasTag_ReturnValue_1) == 0x00002A, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_ActorHasTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_GetLeader_ReturnValue) == 0x000030, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_GetLeader_ReturnValue' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute) == 0x000039, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue) == 0x00003C, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_IsMirrorCharacter_ReturnValue) == 0x000040, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_IsMirrorCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1) == 0x000041, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_GetFloatAttributeFromAbilitySystemComponent_bSuccessfullyFoundAttribute_1' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1) == 0x000044, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_GetFloatAttributeFromAbilitySystemComponent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_BooleanOR_ReturnValue) == 0x000048, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude, CallFunc_BooleanOR_ReturnValue_1) == 0x000049, "Member 'GetRedEquipSpecialAttribute_C_HottaCalculateBaseMagnitude::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

}

