#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: H5UIWin

#include "Basic.hpp"

#include "CoreUObject_classes.hpp"
#include "UMG_classes.hpp"


namespace SDK
{

// Class H5UIWin.H5UIManager
// 0x0100 (0x0128 - 0x0028)
class UH5UIManager final : public UObject
{
public:
	uint8                                         Pad_1896[0x100];                                   // 0x0028(0x0100)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"H5UIManager">();
	}
	static class UH5UIManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UH5UIManager>();
	}
};
static_assert(alignof(UH5UIManager) == 0x000008, "Wrong alignment on UH5UIManager");
static_assert(sizeof(UH5UIManager) == 0x000128, "Wrong size on UH5UIManager");

// Class H5UIWin.H5UIWebView
// 0x0130 (0x03B0 - 0x0280)
class UH5UIWebView final : public UUserWidget
{
public:
	uint8                                         Pad_1897[0x80];                                    // 0x0280(0x0080)(Fixing Size After Last Property [ Dumper-7 ])
	class UBluEye*                                BluEye;                                            // 0x0300(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCanvasPanel*                           CanvasPanel;                                       // 0x0308(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 HtmlImage;                                         // 0x0310(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 PopupImage;                                        // 0x0318(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LoadingGrayImage;                                  // 0x0320(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 LoadingWhiteImage;                                 // 0x0328(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 DefaultBackgroundImage;                            // 0x0330(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 DefaultGrayImage;                                  // 0x0338(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImage*                                 DefaultWhiteImage;                                 // 0x0340(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ErrorText;                                         // 0x0348(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseBlackButton;                                  // 0x0350(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                CloseWhiteButton;                                  // 0x0358(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                BackGrayButton;                                    // 0x0360(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ButtonGrayText;                                    // 0x0368(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTextBlock*                             ButtonWhiteText;                                   // 0x0370(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UButton*                                BackWhiteButton;                                   // 0x0378(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                         Pad_1898[0x30];                                    // 0x0380(0x0030)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Close();
	void Display();
	struct FVector2D GetDrawSize();
	void Hide();
	void Load();
	void LoadURL(const class FString& URL);
	class FString ParseURL(const class FString& URL);
	void SetDrawSize(const struct FVector2D& DrawSize);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"H5UIWebView">();
	}
	static class UH5UIWebView* GetDefaultObj()
	{
		return GetDefaultObjImpl<UH5UIWebView>();
	}
};
static_assert(alignof(UH5UIWebView) == 0x000008, "Wrong alignment on UH5UIWebView");
static_assert(sizeof(UH5UIWebView) == 0x0003B0, "Wrong size on UH5UIWebView");
static_assert(offsetof(UH5UIWebView, BluEye) == 0x000300, "Member 'UH5UIWebView::BluEye' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, CanvasPanel) == 0x000308, "Member 'UH5UIWebView::CanvasPanel' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, HtmlImage) == 0x000310, "Member 'UH5UIWebView::HtmlImage' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, PopupImage) == 0x000318, "Member 'UH5UIWebView::PopupImage' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, LoadingGrayImage) == 0x000320, "Member 'UH5UIWebView::LoadingGrayImage' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, LoadingWhiteImage) == 0x000328, "Member 'UH5UIWebView::LoadingWhiteImage' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, DefaultBackgroundImage) == 0x000330, "Member 'UH5UIWebView::DefaultBackgroundImage' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, DefaultGrayImage) == 0x000338, "Member 'UH5UIWebView::DefaultGrayImage' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, DefaultWhiteImage) == 0x000340, "Member 'UH5UIWebView::DefaultWhiteImage' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, ErrorText) == 0x000348, "Member 'UH5UIWebView::ErrorText' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, CloseBlackButton) == 0x000350, "Member 'UH5UIWebView::CloseBlackButton' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, CloseWhiteButton) == 0x000358, "Member 'UH5UIWebView::CloseWhiteButton' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, BackGrayButton) == 0x000360, "Member 'UH5UIWebView::BackGrayButton' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, ButtonGrayText) == 0x000368, "Member 'UH5UIWebView::ButtonGrayText' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, ButtonWhiteText) == 0x000370, "Member 'UH5UIWebView::ButtonWhiteText' has a wrong offset!");
static_assert(offsetof(UH5UIWebView, BackWhiteButton) == 0x000378, "Member 'UH5UIWebView::BackWhiteButton' has a wrong offset!");

// Class H5UIWin.H5UIWinScene
// 0x0160 (0x0188 - 0x0028)
class UH5UIWinScene final : public UObject
{
public:
	uint8                                         Pad_1899[0x68];                                    // 0x0028(0x0068)(Fixing Size After Last Property [ Dumper-7 ])
	class UH5UIWebView*                           Webview;                                           // 0x0090(0x0008)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBluEye*                                BluEye;                                            // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                         Pad_189A[0xE8];                                    // 0x00A0(0x00E8)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	void Awake();
	void Hibernate();
	void Hide();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"H5UIWinScene">();
	}
	static class UH5UIWinScene* GetDefaultObj()
	{
		return GetDefaultObjImpl<UH5UIWinScene>();
	}
};
static_assert(alignof(UH5UIWinScene) == 0x000008, "Wrong alignment on UH5UIWinScene");
static_assert(sizeof(UH5UIWinScene) == 0x000188, "Wrong size on UH5UIWinScene");
static_assert(offsetof(UH5UIWinScene, Webview) == 0x000090, "Member 'UH5UIWinScene::Webview' has a wrong offset!");
static_assert(offsetof(UH5UIWinScene, BluEye) == 0x000098, "Member 'UH5UIWinScene::BluEye' has a wrong offset!");

}

