#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HierarchicalInstanced

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK
{

// Enum HierarchicalInstanced.ETargetLevelType
// NumValues: 0x0003
enum class ETargetLevelType : uint8
{
	AllLevels                                = 0,
	SelectedLevels                           = 1,
	ETargetLevelType_MAX                     = 2,
};

// Enum HierarchicalInstanced.EPointType
// NumValues: 0x0005
enum class EPointType : uint8
{
	None                                     = 0,
	NoisePoint                               = 1,
	BorderPoint                              = 2,
	CorePoint                                = 3,
	EPointType_MAX                           = 4,
};

// Enum HierarchicalInstanced.EHICullType
// NumValues: 0x0003
enum class EHICullType : uint8
{
	Distance                                 = 0,
	ScreenSize                               = 1,
	EHICullType_MAX                          = 2,
};

// Enum HierarchicalInstanced.EHierarchicalInstancedReplacementMethod
// NumValues: 0x0003
enum class EHierarchicalInstancedReplacementMethod : uint8
{
	RemoveOriginalActors                     = 0,
	KeepOriginalActorsAsEditorOnly           = 1,
	EHierarchicalInstancedReplacementMethod_MAX = 2,
};

// ScriptStruct HierarchicalInstanced.HierarchicalInstancedSettings
// 0x0020 (0x0020 - 0x0000)
struct FHierarchicalInstancedSettings final
{
public:
	float                                         ActorDensityDistance;                              // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         MinNumberOfActorsToInstanced;                      // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHierarchicalInstancedReplacementMethod       MeshReplacementMethod;                             // 0x0008(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          bSkipMeshesWithVertexColors;                       // 0x0009(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	EHICullType                                   CullType;                                          // 0x000A(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1758[0x1];                                     // 0x000B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CullScreenSize;                                    // 0x000C(0x0004)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCullDistanceSizePair>          CullDistances;                                     // 0x0010(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(FHierarchicalInstancedSettings) == 0x000008, "Wrong alignment on FHierarchicalInstancedSettings");
static_assert(sizeof(FHierarchicalInstancedSettings) == 0x000020, "Wrong size on FHierarchicalInstancedSettings");
static_assert(offsetof(FHierarchicalInstancedSettings, ActorDensityDistance) == 0x000000, "Member 'FHierarchicalInstancedSettings::ActorDensityDistance' has a wrong offset!");
static_assert(offsetof(FHierarchicalInstancedSettings, MinNumberOfActorsToInstanced) == 0x000004, "Member 'FHierarchicalInstancedSettings::MinNumberOfActorsToInstanced' has a wrong offset!");
static_assert(offsetof(FHierarchicalInstancedSettings, MeshReplacementMethod) == 0x000008, "Member 'FHierarchicalInstancedSettings::MeshReplacementMethod' has a wrong offset!");
static_assert(offsetof(FHierarchicalInstancedSettings, bSkipMeshesWithVertexColors) == 0x000009, "Member 'FHierarchicalInstancedSettings::bSkipMeshesWithVertexColors' has a wrong offset!");
static_assert(offsetof(FHierarchicalInstancedSettings, CullType) == 0x00000A, "Member 'FHierarchicalInstancedSettings::CullType' has a wrong offset!");
static_assert(offsetof(FHierarchicalInstancedSettings, CullScreenSize) == 0x00000C, "Member 'FHierarchicalInstancedSettings::CullScreenSize' has a wrong offset!");
static_assert(offsetof(FHierarchicalInstancedSettings, CullDistances) == 0x000010, "Member 'FHierarchicalInstancedSettings::CullDistances' has a wrong offset!");

}

