#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HierarchicalInstanced

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "HierarchicalInstanced_structs.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class HierarchicalInstanced.HierarchicalInstancedActor
// 0x0008 (0x0240 - 0x0238)
class AHierarchicalInstancedActor final : public AActor
{
public:
	class UHierarchicalInstancedStaticMeshComponent* HISMComponent;                                     // 0x0238(0x0008)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"HierarchicalInstancedActor">();
	}
	static class AHierarchicalInstancedActor* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHierarchicalInstancedActor>();
	}
};
static_assert(alignof(AHierarchicalInstancedActor) == 0x000008, "Wrong alignment on AHierarchicalInstancedActor");
static_assert(sizeof(AHierarchicalInstancedActor) == 0x000240, "Wrong size on AHierarchicalInstancedActor");
static_assert(offsetof(AHierarchicalInstancedActor, HISMComponent) == 0x000238, "Member 'AHierarchicalInstancedActor::HISMComponent' has a wrong offset!");

// Class HierarchicalInstanced.InstancedClusterSettings
// 0x0028 (0x0050 - 0x0028)
class UInstancedClusterSettings final : public UObject
{
public:
	uint8                                         bOnlyGenerateClustersForVolumes : 1;               // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	ETargetLevelType                              TargetLevelsType;                                  // 0x0029(0x0001)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1759[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHierarchicalInstancedSettings         InstancedSettings;                                 // 0x0030(0x0020)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"InstancedClusterSettings">();
	}
	static class UInstancedClusterSettings* GetDefaultObj()
	{
		return GetDefaultObjImpl<UInstancedClusterSettings>();
	}
};
static_assert(alignof(UInstancedClusterSettings) == 0x000008, "Wrong alignment on UInstancedClusterSettings");
static_assert(sizeof(UInstancedClusterSettings) == 0x000050, "Wrong size on UInstancedClusterSettings");
static_assert(offsetof(UInstancedClusterSettings, TargetLevelsType) == 0x000029, "Member 'UInstancedClusterSettings::TargetLevelsType' has a wrong offset!");
static_assert(offsetof(UInstancedClusterSettings, InstancedSettings) == 0x000030, "Member 'UInstancedClusterSettings::InstancedSettings' has a wrong offset!");

}

