#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HottaSwimmingSystem

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function HottaSwimmingSystem.HottaSwimmingSystem_C.GetCharaterPos
// 0x0034 (0x0034 - 0x0000)
struct HottaSwimmingSystem_C_GetCharaterPos final
{
public:
	struct FVector                                Pos;                                               // 0x0000(0x000C)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CharacterPos;                                      // 0x000C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRiding_ReturnValue;                     // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5900[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue_1;    // 0x0028(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HottaSwimmingSystem_C_GetCharaterPos) == 0x000004, "Wrong alignment on HottaSwimmingSystem_C_GetCharaterPos");
static_assert(sizeof(HottaSwimmingSystem_C_GetCharaterPos) == 0x000034, "Wrong size on HottaSwimmingSystem_C_GetCharaterPos");
static_assert(offsetof(HottaSwimmingSystem_C_GetCharaterPos, Pos) == 0x000000, "Member 'HottaSwimmingSystem_C_GetCharaterPos::Pos' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_GetCharaterPos, CharacterPos) == 0x00000C, "Member 'HottaSwimmingSystem_C_GetCharaterPos::CharacterPos' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_GetCharaterPos, CallFunc_IsRiding_ReturnValue) == 0x000018, "Member 'HottaSwimmingSystem_C_GetCharaterPos::CallFunc_IsRiding_ReturnValue' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_GetCharaterPos, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00001C, "Member 'HottaSwimmingSystem_C_GetCharaterPos::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_GetCharaterPos, CallFunc_K2_GetComponentLocation_ReturnValue_1) == 0x000028, "Member 'HottaSwimmingSystem_C_GetCharaterPos::CallFunc_K2_GetComponentLocation_ReturnValue_1' has a wrong offset!");

// Function HottaSwimmingSystem.HottaSwimmingSystem_C.ReceiveTick
// 0x0004 (0x0004 - 0x0000)
struct HottaSwimmingSystem_C_ReceiveTick final
{
public:
	float                                         DeltaSeconds;                                      // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HottaSwimmingSystem_C_ReceiveTick) == 0x000004, "Wrong alignment on HottaSwimmingSystem_C_ReceiveTick");
static_assert(sizeof(HottaSwimmingSystem_C_ReceiveTick) == 0x000004, "Wrong size on HottaSwimmingSystem_C_ReceiveTick");
static_assert(offsetof(HottaSwimmingSystem_C_ReceiveTick, DeltaSeconds) == 0x000000, "Member 'HottaSwimmingSystem_C_ReceiveTick::DeltaSeconds' has a wrong offset!");

// Function HottaSwimmingSystem.HottaSwimmingSystem_C.ExecuteUbergraph_HottaSwimmingSystem
// 0x0078 (0x0078 - 0x0000)
struct HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5901[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AQuadTree*                              CallFunc_GetReferenceToOceanology_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AHottaOceanologyVolume*>         CallFunc_GetAllActorsOfClass_OutActors;            // 0x0010(0x0010)(ReferenceParm)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5902[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaOceanologyVolume*                 CallFunc_Array_Get_Item;                           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0034(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0035(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5903[0x2];                                     // 0x0036(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5904[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         K2Node_Event_DeltaSeconds;                         // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Character_Base_C*                   K2Node_DynamicCast_AsBP_Character_Base;            // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5905[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_GetCharaterPos_pos;                       // 0x006C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem) == 0x000008, "Wrong alignment on HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem");
static_assert(sizeof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem) == 0x000078, "Wrong size on HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, EntryPoint) == 0x000000, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::EntryPoint' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_GetReferenceToOceanology_ReturnValue) == 0x000008, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_GetReferenceToOceanology_ReturnValue' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_GetAllActorsOfClass_OutActors) == 0x000010, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_GetAllActorsOfClass_OutActors' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_Array_Get_Item) == 0x000028, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_Array_Length_ReturnValue) == 0x000030, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_Greater_IntInt_ReturnValue) == 0x000034, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_IsValid_ReturnValue_1) == 0x000035, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000038, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_BreakVector_X) == 0x000044, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_BreakVector_Y) == 0x000048, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_BreakVector_Z) == 0x00004C, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_Not_PreBool_ReturnValue) == 0x000050, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000051, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_IsValid_ReturnValue_2) == 0x000052, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, K2Node_Event_DeltaSeconds) == 0x000054, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::K2Node_Event_DeltaSeconds' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_GetOwner_ReturnValue) == 0x000058, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, K2Node_DynamicCast_AsBP_Character_Base) == 0x000060, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::K2Node_DynamicCast_AsBP_Character_Base' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, K2Node_DynamicCast_bSuccess) == 0x000068, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem, CallFunc_GetCharaterPos_pos) == 0x00006C, "Member 'HottaSwimmingSystem_C_ExecuteUbergraph_HottaSwimmingSystem::CallFunc_GetCharaterPos_pos' has a wrong offset!");

}

