#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HottaUIExtensions

#include "Basic.hpp"

#include "HottaUIExtensions_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "UMG_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function HottaUIExtensions.ScrollPhysics.CreateScrollPhysics
// 0x0020 (0x0020 - 0x0000)
struct ScrollPhysics_CreateScrollPhysics final
{
public:
	TSubclassOf<class UScrollPhysics>             InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPhysics*                         InParent;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPhysics*                         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollPhysics_CreateScrollPhysics) == 0x000008, "Wrong alignment on ScrollPhysics_CreateScrollPhysics");
static_assert(sizeof(ScrollPhysics_CreateScrollPhysics) == 0x000020, "Wrong size on ScrollPhysics_CreateScrollPhysics");
static_assert(offsetof(ScrollPhysics_CreateScrollPhysics, InClass) == 0x000000, "Member 'ScrollPhysics_CreateScrollPhysics::InClass' has a wrong offset!");
static_assert(offsetof(ScrollPhysics_CreateScrollPhysics, InOuter) == 0x000008, "Member 'ScrollPhysics_CreateScrollPhysics::InOuter' has a wrong offset!");
static_assert(offsetof(ScrollPhysics_CreateScrollPhysics, InParent) == 0x000010, "Member 'ScrollPhysics_CreateScrollPhysics::InParent' has a wrong offset!");
static_assert(offsetof(ScrollPhysics_CreateScrollPhysics, ReturnValue) == 0x000018, "Member 'ScrollPhysics_CreateScrollPhysics::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollPhysics.ApplyTo
// 0x0010 (0x0010 - 0x0000)
struct ScrollPhysics_ApplyTo final
{
public:
	class UScrollPhysics*                         InAncestor;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPhysics*                         ReturnValue;                                       // 0x0008(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollPhysics_ApplyTo) == 0x000008, "Wrong alignment on ScrollPhysics_ApplyTo");
static_assert(sizeof(ScrollPhysics_ApplyTo) == 0x000010, "Wrong size on ScrollPhysics_ApplyTo");
static_assert(offsetof(ScrollPhysics_ApplyTo, InAncestor) == 0x000000, "Member 'ScrollPhysics_ApplyTo::InAncestor' has a wrong offset!");
static_assert(offsetof(ScrollPhysics_ApplyTo, ReturnValue) == 0x000008, "Member 'ScrollPhysics_ApplyTo::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollPhysics.GetSpring
// 0x000C (0x000C - 0x0000)
struct ScrollPhysics_GetSpring final
{
public:
	struct FSpringDescription                     ReturnValue;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollPhysics_GetSpring) == 0x000004, "Wrong alignment on ScrollPhysics_GetSpring");
static_assert(sizeof(ScrollPhysics_GetSpring) == 0x00000C, "Wrong size on ScrollPhysics_GetSpring");
static_assert(offsetof(ScrollPhysics_GetSpring, ReturnValue) == 0x000000, "Member 'ScrollPhysics_GetSpring::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollPhysics.GetTolerance
// 0x000C (0x000C - 0x0000)
struct ScrollPhysics_GetTolerance final
{
public:
	struct FTolerance                             ReturnValue;                                       // 0x0000(0x000C)(ConstParm, Parm, OutParm, ReturnParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollPhysics_GetTolerance) == 0x000004, "Wrong alignment on ScrollPhysics_GetTolerance");
static_assert(sizeof(ScrollPhysics_GetTolerance) == 0x00000C, "Wrong size on ScrollPhysics_GetTolerance");
static_assert(offsetof(ScrollPhysics_GetTolerance, ReturnValue) == 0x000000, "Member 'ScrollPhysics_GetTolerance::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.AlwaysScrollableScrollPhysics.CreateAlwaysScrollableScrollPhysics
// 0x0020 (0x0020 - 0x0000)
struct AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics final
{
public:
	TSubclassOf<class UAlwaysScrollableScrollPhysics> InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPhysics*                         InParent;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAlwaysScrollableScrollPhysics*         ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics) == 0x000008, "Wrong alignment on AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics");
static_assert(sizeof(AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics) == 0x000020, "Wrong size on AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics");
static_assert(offsetof(AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics, InClass) == 0x000000, "Member 'AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics::InClass' has a wrong offset!");
static_assert(offsetof(AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics, InOuter) == 0x000008, "Member 'AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics::InOuter' has a wrong offset!");
static_assert(offsetof(AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics, InParent) == 0x000010, "Member 'AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics::InParent' has a wrong offset!");
static_assert(offsetof(AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics, ReturnValue) == 0x000018, "Member 'AlwaysScrollableScrollPhysics_CreateAlwaysScrollableScrollPhysics::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollActivity.CreateScrollActivity
// 0x0018 (0x0018 - 0x0000)
struct ScrollActivity_CreateScrollActivity final
{
public:
	TSubclassOf<class UScrollActivity>            InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPosition*                        InPosition;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollActivity*                        ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollActivity_CreateScrollActivity) == 0x000008, "Wrong alignment on ScrollActivity_CreateScrollActivity");
static_assert(sizeof(ScrollActivity_CreateScrollActivity) == 0x000018, "Wrong size on ScrollActivity_CreateScrollActivity");
static_assert(offsetof(ScrollActivity_CreateScrollActivity, InClass) == 0x000000, "Member 'ScrollActivity_CreateScrollActivity::InClass' has a wrong offset!");
static_assert(offsetof(ScrollActivity_CreateScrollActivity, InPosition) == 0x000008, "Member 'ScrollActivity_CreateScrollActivity::InPosition' has a wrong offset!");
static_assert(offsetof(ScrollActivity_CreateScrollActivity, ReturnValue) == 0x000010, "Member 'ScrollActivity_CreateScrollActivity::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.BallisticScrollActivity.CreateBallisticScrollActivity
// 0x0020 (0x0020 - 0x0000)
struct BallisticScrollActivity_CreateBallisticScrollActivity final
{
public:
	TSubclassOf<class UBallisticScrollActivity>   InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPosition*                        InPosition;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USimulation*                            InSimulation;                                      // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBallisticScrollActivity*               ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BallisticScrollActivity_CreateBallisticScrollActivity) == 0x000008, "Wrong alignment on BallisticScrollActivity_CreateBallisticScrollActivity");
static_assert(sizeof(BallisticScrollActivity_CreateBallisticScrollActivity) == 0x000020, "Wrong size on BallisticScrollActivity_CreateBallisticScrollActivity");
static_assert(offsetof(BallisticScrollActivity_CreateBallisticScrollActivity, InClass) == 0x000000, "Member 'BallisticScrollActivity_CreateBallisticScrollActivity::InClass' has a wrong offset!");
static_assert(offsetof(BallisticScrollActivity_CreateBallisticScrollActivity, InPosition) == 0x000008, "Member 'BallisticScrollActivity_CreateBallisticScrollActivity::InPosition' has a wrong offset!");
static_assert(offsetof(BallisticScrollActivity_CreateBallisticScrollActivity, InSimulation) == 0x000010, "Member 'BallisticScrollActivity_CreateBallisticScrollActivity::InSimulation' has a wrong offset!");
static_assert(offsetof(BallisticScrollActivity_CreateBallisticScrollActivity, ReturnValue) == 0x000018, "Member 'BallisticScrollActivity_CreateBallisticScrollActivity::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.BouncingScrollPhysics.CreateBouncingScrollPhysics
// 0x0020 (0x0020 - 0x0000)
struct BouncingScrollPhysics_CreateBouncingScrollPhysics final
{
public:
	TSubclassOf<class UBouncingScrollPhysics>     InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPhysics*                         InParent;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBouncingScrollPhysics*                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BouncingScrollPhysics_CreateBouncingScrollPhysics) == 0x000008, "Wrong alignment on BouncingScrollPhysics_CreateBouncingScrollPhysics");
static_assert(sizeof(BouncingScrollPhysics_CreateBouncingScrollPhysics) == 0x000020, "Wrong size on BouncingScrollPhysics_CreateBouncingScrollPhysics");
static_assert(offsetof(BouncingScrollPhysics_CreateBouncingScrollPhysics, InClass) == 0x000000, "Member 'BouncingScrollPhysics_CreateBouncingScrollPhysics::InClass' has a wrong offset!");
static_assert(offsetof(BouncingScrollPhysics_CreateBouncingScrollPhysics, InOuter) == 0x000008, "Member 'BouncingScrollPhysics_CreateBouncingScrollPhysics::InOuter' has a wrong offset!");
static_assert(offsetof(BouncingScrollPhysics_CreateBouncingScrollPhysics, InParent) == 0x000010, "Member 'BouncingScrollPhysics_CreateBouncingScrollPhysics::InParent' has a wrong offset!");
static_assert(offsetof(BouncingScrollPhysics_CreateBouncingScrollPhysics, ReturnValue) == 0x000018, "Member 'BouncingScrollPhysics_CreateBouncingScrollPhysics::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.Simulation.CreateSimulation
// 0x0028 (0x0028 - 0x0000)
struct Simulation_CreateSimulation final
{
public:
	TSubclassOf<class USimulation>                InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTolerance                             InTolerance;                                       // 0x0010(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_115B[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class USimulation*                            ReturnValue;                                       // 0x0020(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(Simulation_CreateSimulation) == 0x000008, "Wrong alignment on Simulation_CreateSimulation");
static_assert(sizeof(Simulation_CreateSimulation) == 0x000028, "Wrong size on Simulation_CreateSimulation");
static_assert(offsetof(Simulation_CreateSimulation, InClass) == 0x000000, "Member 'Simulation_CreateSimulation::InClass' has a wrong offset!");
static_assert(offsetof(Simulation_CreateSimulation, InOuter) == 0x000008, "Member 'Simulation_CreateSimulation::InOuter' has a wrong offset!");
static_assert(offsetof(Simulation_CreateSimulation, InTolerance) == 0x000010, "Member 'Simulation_CreateSimulation::InTolerance' has a wrong offset!");
static_assert(offsetof(Simulation_CreateSimulation, ReturnValue) == 0x000020, "Member 'Simulation_CreateSimulation::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.BouncingScrollSimulation.CreateBouncingScrollSimulation
// 0x0040 (0x0040 - 0x0000)
struct BouncingScrollSimulation_CreateBouncingScrollSimulation final
{
public:
	TSubclassOf<class UBouncingScrollSimulation>  InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPosition;                                        // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InVelocity;                                        // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InLeadingExtent;                                   // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTrailingExtent;                                  // 0x001C(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSpringDescription                     InSpring;                                          // 0x0020(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	struct FTolerance                             InTolerance;                                       // 0x002C(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	class UBouncingScrollSimulation*              ReturnValue;                                       // 0x0038(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(BouncingScrollSimulation_CreateBouncingScrollSimulation) == 0x000008, "Wrong alignment on BouncingScrollSimulation_CreateBouncingScrollSimulation");
static_assert(sizeof(BouncingScrollSimulation_CreateBouncingScrollSimulation) == 0x000040, "Wrong size on BouncingScrollSimulation_CreateBouncingScrollSimulation");
static_assert(offsetof(BouncingScrollSimulation_CreateBouncingScrollSimulation, InClass) == 0x000000, "Member 'BouncingScrollSimulation_CreateBouncingScrollSimulation::InClass' has a wrong offset!");
static_assert(offsetof(BouncingScrollSimulation_CreateBouncingScrollSimulation, InOuter) == 0x000008, "Member 'BouncingScrollSimulation_CreateBouncingScrollSimulation::InOuter' has a wrong offset!");
static_assert(offsetof(BouncingScrollSimulation_CreateBouncingScrollSimulation, InPosition) == 0x000010, "Member 'BouncingScrollSimulation_CreateBouncingScrollSimulation::InPosition' has a wrong offset!");
static_assert(offsetof(BouncingScrollSimulation_CreateBouncingScrollSimulation, InVelocity) == 0x000014, "Member 'BouncingScrollSimulation_CreateBouncingScrollSimulation::InVelocity' has a wrong offset!");
static_assert(offsetof(BouncingScrollSimulation_CreateBouncingScrollSimulation, InLeadingExtent) == 0x000018, "Member 'BouncingScrollSimulation_CreateBouncingScrollSimulation::InLeadingExtent' has a wrong offset!");
static_assert(offsetof(BouncingScrollSimulation_CreateBouncingScrollSimulation, InTrailingExtent) == 0x00001C, "Member 'BouncingScrollSimulation_CreateBouncingScrollSimulation::InTrailingExtent' has a wrong offset!");
static_assert(offsetof(BouncingScrollSimulation_CreateBouncingScrollSimulation, InSpring) == 0x000020, "Member 'BouncingScrollSimulation_CreateBouncingScrollSimulation::InSpring' has a wrong offset!");
static_assert(offsetof(BouncingScrollSimulation_CreateBouncingScrollSimulation, InTolerance) == 0x00002C, "Member 'BouncingScrollSimulation_CreateBouncingScrollSimulation::InTolerance' has a wrong offset!");
static_assert(offsetof(BouncingScrollSimulation_CreateBouncingScrollSimulation, ReturnValue) == 0x000038, "Member 'BouncingScrollSimulation_CreateBouncingScrollSimulation::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ClampingScrollPhysics.CreateClampingScrollPhysics
// 0x0020 (0x0020 - 0x0000)
struct ClampingScrollPhysics_CreateClampingScrollPhysics final
{
public:
	TSubclassOf<class UClampingScrollPhysics>     InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPhysics*                         InParent;                                          // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClampingScrollPhysics*                 ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClampingScrollPhysics_CreateClampingScrollPhysics) == 0x000008, "Wrong alignment on ClampingScrollPhysics_CreateClampingScrollPhysics");
static_assert(sizeof(ClampingScrollPhysics_CreateClampingScrollPhysics) == 0x000020, "Wrong size on ClampingScrollPhysics_CreateClampingScrollPhysics");
static_assert(offsetof(ClampingScrollPhysics_CreateClampingScrollPhysics, InClass) == 0x000000, "Member 'ClampingScrollPhysics_CreateClampingScrollPhysics::InClass' has a wrong offset!");
static_assert(offsetof(ClampingScrollPhysics_CreateClampingScrollPhysics, InOuter) == 0x000008, "Member 'ClampingScrollPhysics_CreateClampingScrollPhysics::InOuter' has a wrong offset!");
static_assert(offsetof(ClampingScrollPhysics_CreateClampingScrollPhysics, InParent) == 0x000010, "Member 'ClampingScrollPhysics_CreateClampingScrollPhysics::InParent' has a wrong offset!");
static_assert(offsetof(ClampingScrollPhysics_CreateClampingScrollPhysics, ReturnValue) == 0x000018, "Member 'ClampingScrollPhysics_CreateClampingScrollPhysics::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ClampingScrollSimulation.CreateClampingScrollSimulation
// 0x0030 (0x0030 - 0x0000)
struct ClampingScrollSimulation_CreateClampingScrollSimulation final
{
public:
	TSubclassOf<class UClampingScrollSimulation>  InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InPosition;                                        // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InVelocity;                                        // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTolerance                             InTolerance;                                       // 0x0018(0x000C)(ConstParm, Parm, OutParm, ReferenceParm, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         Pad_115E[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UClampingScrollSimulation*              ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ClampingScrollSimulation_CreateClampingScrollSimulation) == 0x000008, "Wrong alignment on ClampingScrollSimulation_CreateClampingScrollSimulation");
static_assert(sizeof(ClampingScrollSimulation_CreateClampingScrollSimulation) == 0x000030, "Wrong size on ClampingScrollSimulation_CreateClampingScrollSimulation");
static_assert(offsetof(ClampingScrollSimulation_CreateClampingScrollSimulation, InClass) == 0x000000, "Member 'ClampingScrollSimulation_CreateClampingScrollSimulation::InClass' has a wrong offset!");
static_assert(offsetof(ClampingScrollSimulation_CreateClampingScrollSimulation, InOuter) == 0x000008, "Member 'ClampingScrollSimulation_CreateClampingScrollSimulation::InOuter' has a wrong offset!");
static_assert(offsetof(ClampingScrollSimulation_CreateClampingScrollSimulation, InPosition) == 0x000010, "Member 'ClampingScrollSimulation_CreateClampingScrollSimulation::InPosition' has a wrong offset!");
static_assert(offsetof(ClampingScrollSimulation_CreateClampingScrollSimulation, InVelocity) == 0x000014, "Member 'ClampingScrollSimulation_CreateClampingScrollSimulation::InVelocity' has a wrong offset!");
static_assert(offsetof(ClampingScrollSimulation_CreateClampingScrollSimulation, InTolerance) == 0x000018, "Member 'ClampingScrollSimulation_CreateClampingScrollSimulation::InTolerance' has a wrong offset!");
static_assert(offsetof(ClampingScrollSimulation_CreateClampingScrollSimulation, ReturnValue) == 0x000028, "Member 'ClampingScrollSimulation_CreateClampingScrollSimulation::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.DragScrollActivity.CreateDragScrollActivity
// 0x0018 (0x0018 - 0x0000)
struct DragScrollActivity_CreateDragScrollActivity final
{
public:
	TSubclassOf<class UDragScrollActivity>        InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPosition*                        InPosition;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDragScrollActivity*                    ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DragScrollActivity_CreateDragScrollActivity) == 0x000008, "Wrong alignment on DragScrollActivity_CreateDragScrollActivity");
static_assert(sizeof(DragScrollActivity_CreateDragScrollActivity) == 0x000018, "Wrong size on DragScrollActivity_CreateDragScrollActivity");
static_assert(offsetof(DragScrollActivity_CreateDragScrollActivity, InClass) == 0x000000, "Member 'DragScrollActivity_CreateDragScrollActivity::InClass' has a wrong offset!");
static_assert(offsetof(DragScrollActivity_CreateDragScrollActivity, InPosition) == 0x000008, "Member 'DragScrollActivity_CreateDragScrollActivity::InPosition' has a wrong offset!");
static_assert(offsetof(DragScrollActivity_CreateDragScrollActivity, ReturnValue) == 0x000010, "Member 'DragScrollActivity_CreateDragScrollActivity::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.DrivenScrollActivity.CreateDrivenScrollActivity
// 0x0030 (0x0030 - 0x0000)
struct DrivenScrollActivity_CreateDrivenScrollActivity final
{
public:
	TSubclassOf<class UDrivenScrollActivity>      InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPosition*                        InPosition;                                        // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InFrom;                                            // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InTo;                                              // 0x0014(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDuration;                                        // 0x0018(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1162[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCurveFloat*                            InCurve;                                           // 0x0020(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDrivenScrollActivity*                  ReturnValue;                                       // 0x0028(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(DrivenScrollActivity_CreateDrivenScrollActivity) == 0x000008, "Wrong alignment on DrivenScrollActivity_CreateDrivenScrollActivity");
static_assert(sizeof(DrivenScrollActivity_CreateDrivenScrollActivity) == 0x000030, "Wrong size on DrivenScrollActivity_CreateDrivenScrollActivity");
static_assert(offsetof(DrivenScrollActivity_CreateDrivenScrollActivity, InClass) == 0x000000, "Member 'DrivenScrollActivity_CreateDrivenScrollActivity::InClass' has a wrong offset!");
static_assert(offsetof(DrivenScrollActivity_CreateDrivenScrollActivity, InPosition) == 0x000008, "Member 'DrivenScrollActivity_CreateDrivenScrollActivity::InPosition' has a wrong offset!");
static_assert(offsetof(DrivenScrollActivity_CreateDrivenScrollActivity, InFrom) == 0x000010, "Member 'DrivenScrollActivity_CreateDrivenScrollActivity::InFrom' has a wrong offset!");
static_assert(offsetof(DrivenScrollActivity_CreateDrivenScrollActivity, InTo) == 0x000014, "Member 'DrivenScrollActivity_CreateDrivenScrollActivity::InTo' has a wrong offset!");
static_assert(offsetof(DrivenScrollActivity_CreateDrivenScrollActivity, InDuration) == 0x000018, "Member 'DrivenScrollActivity_CreateDrivenScrollActivity::InDuration' has a wrong offset!");
static_assert(offsetof(DrivenScrollActivity_CreateDrivenScrollActivity, InCurve) == 0x000020, "Member 'DrivenScrollActivity_CreateDrivenScrollActivity::InCurve' has a wrong offset!");
static_assert(offsetof(DrivenScrollActivity_CreateDrivenScrollActivity, ReturnValue) == 0x000028, "Member 'DrivenScrollActivity_CreateDrivenScrollActivity::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.FixedExtentScrollableObjectInterface.Interface_GetItemExtent
// 0x0004 (0x0004 - 0x0000)
struct FixedExtentScrollableObjectInterface_Interface_GetItemExtent final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FixedExtentScrollableObjectInterface_Interface_GetItemExtent) == 0x000004, "Wrong alignment on FixedExtentScrollableObjectInterface_Interface_GetItemExtent");
static_assert(sizeof(FixedExtentScrollableObjectInterface_Interface_GetItemExtent) == 0x000004, "Wrong size on FixedExtentScrollableObjectInterface_Interface_GetItemExtent");
static_assert(offsetof(FixedExtentScrollableObjectInterface_Interface_GetItemExtent, ReturnValue) == 0x000000, "Member 'FixedExtentScrollableObjectInterface_Interface_GetItemExtent::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollableState.CreateScrollState
// 0x0018 (0x0018 - 0x0000)
struct ScrollableState_CreateScrollState final
{
public:
	TSubclassOf<class UScrollableState>           InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollContext*                         InContext;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollableState*                       ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollableState_CreateScrollState) == 0x000008, "Wrong alignment on ScrollableState_CreateScrollState");
static_assert(sizeof(ScrollableState_CreateScrollState) == 0x000018, "Wrong size on ScrollableState_CreateScrollState");
static_assert(offsetof(ScrollableState_CreateScrollState, InClass) == 0x000000, "Member 'ScrollableState_CreateScrollState::InClass' has a wrong offset!");
static_assert(offsetof(ScrollableState_CreateScrollState, InContext) == 0x000008, "Member 'ScrollableState_CreateScrollState::InContext' has a wrong offset!");
static_assert(offsetof(ScrollableState_CreateScrollState, ReturnValue) == 0x000010, "Member 'ScrollableState_CreateScrollState::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollableState.UpdateScrollExtent
// 0x0008 (0x0008 - 0x0000)
struct ScrollableState_UpdateScrollExtent final
{
public:
	class UScrollContext*                         InContext;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollableState_UpdateScrollExtent) == 0x000008, "Wrong alignment on ScrollableState_UpdateScrollExtent");
static_assert(sizeof(ScrollableState_UpdateScrollExtent) == 0x000008, "Wrong size on ScrollableState_UpdateScrollExtent");
static_assert(offsetof(ScrollableState_UpdateScrollExtent, InContext) == 0x000000, "Member 'ScrollableState_UpdateScrollExtent::InContext' has a wrong offset!");

// Function HottaUIExtensions.ScrollableState.UpdateViewportDimension
// 0x0008 (0x0008 - 0x0000)
struct ScrollableState_UpdateViewportDimension final
{
public:
	class UScrollContext*                         InContext;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollableState_UpdateViewportDimension) == 0x000008, "Wrong alignment on ScrollableState_UpdateViewportDimension");
static_assert(sizeof(ScrollableState_UpdateViewportDimension) == 0x000008, "Wrong size on ScrollableState_UpdateViewportDimension");
static_assert(offsetof(ScrollableState_UpdateViewportDimension, InContext) == 0x000000, "Member 'ScrollableState_UpdateViewportDimension::InContext' has a wrong offset!");

// Function HottaUIExtensions.ScrollableState.GetController
// 0x0008 (0x0008 - 0x0000)
struct ScrollableState_GetController final
{
public:
	class UScrollController*                      ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollableState_GetController) == 0x000008, "Wrong alignment on ScrollableState_GetController");
static_assert(sizeof(ScrollableState_GetController) == 0x000008, "Wrong size on ScrollableState_GetController");
static_assert(offsetof(ScrollableState_GetController, ReturnValue) == 0x000000, "Member 'ScrollableState_GetController::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollableState.GetDirection
// 0x0001 (0x0001 - 0x0000)
struct ScrollableState_GetDirection final
{
public:
	EScrollDirectionType                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollableState_GetDirection) == 0x000001, "Wrong alignment on ScrollableState_GetDirection");
static_assert(sizeof(ScrollableState_GetDirection) == 0x000001, "Wrong size on ScrollableState_GetDirection");
static_assert(offsetof(ScrollableState_GetDirection, ReturnValue) == 0x000000, "Member 'ScrollableState_GetDirection::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollableState.GetPhysics
// 0x0008 (0x0008 - 0x0000)
struct ScrollableState_GetPhysics final
{
public:
	class UScrollPhysics*                         ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollableState_GetPhysics) == 0x000008, "Wrong alignment on ScrollableState_GetPhysics");
static_assert(sizeof(ScrollableState_GetPhysics) == 0x000008, "Wrong size on ScrollableState_GetPhysics");
static_assert(offsetof(ScrollableState_GetPhysics, ReturnValue) == 0x000000, "Member 'ScrollableState_GetPhysics::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollableState.GetPosition
// 0x0008 (0x0008 - 0x0000)
struct ScrollableState_GetPosition final
{
public:
	class UScrollPosition*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollableState_GetPosition) == 0x000008, "Wrong alignment on ScrollableState_GetPosition");
static_assert(sizeof(ScrollableState_GetPosition) == 0x000008, "Wrong size on ScrollableState_GetPosition");
static_assert(offsetof(ScrollableState_GetPosition, ReturnValue) == 0x000000, "Member 'ScrollableState_GetPosition::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.FixedExtentScrollableState.CreateFixedExtentScrollableState
// 0x0018 (0x0018 - 0x0000)
struct FixedExtentScrollableState_CreateFixedExtentScrollableState final
{
public:
	TSubclassOf<class UFixedExtentScrollableState> InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollContext*                         InContext;                                         // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFixedExtentScrollableState*            ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FixedExtentScrollableState_CreateFixedExtentScrollableState) == 0x000008, "Wrong alignment on FixedExtentScrollableState_CreateFixedExtentScrollableState");
static_assert(sizeof(FixedExtentScrollableState_CreateFixedExtentScrollableState) == 0x000018, "Wrong size on FixedExtentScrollableState_CreateFixedExtentScrollableState");
static_assert(offsetof(FixedExtentScrollableState_CreateFixedExtentScrollableState, InClass) == 0x000000, "Member 'FixedExtentScrollableState_CreateFixedExtentScrollableState::InClass' has a wrong offset!");
static_assert(offsetof(FixedExtentScrollableState_CreateFixedExtentScrollableState, InContext) == 0x000008, "Member 'FixedExtentScrollableState_CreateFixedExtentScrollableState::InContext' has a wrong offset!");
static_assert(offsetof(FixedExtentScrollableState_CreateFixedExtentScrollableState, ReturnValue) == 0x000010, "Member 'FixedExtentScrollableState_CreateFixedExtentScrollableState::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollContext.CreateScrollContext
// 0x0018 (0x0018 - 0x0000)
struct ScrollContext_CreateScrollContext final
{
public:
	TSubclassOf<class UScrollContext>             InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollContext*                         ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollContext_CreateScrollContext) == 0x000008, "Wrong alignment on ScrollContext_CreateScrollContext");
static_assert(sizeof(ScrollContext_CreateScrollContext) == 0x000018, "Wrong size on ScrollContext_CreateScrollContext");
static_assert(offsetof(ScrollContext_CreateScrollContext, InClass) == 0x000000, "Member 'ScrollContext_CreateScrollContext::InClass' has a wrong offset!");
static_assert(offsetof(ScrollContext_CreateScrollContext, InOuter) == 0x000008, "Member 'ScrollContext_CreateScrollContext::InOuter' has a wrong offset!");
static_assert(offsetof(ScrollContext_CreateScrollContext, ReturnValue) == 0x000010, "Member 'ScrollContext_CreateScrollContext::ReturnValue' has a wrong offset!");

// DelegateFunction HottaUIExtensions.ScrollContext.OnScrollExtentUpdateNotification__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ScrollContext_OnScrollExtentUpdateNotification__DelegateSignature final
{
public:
	class UScrollContext*                         InContext;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollContext_OnScrollExtentUpdateNotification__DelegateSignature) == 0x000008, "Wrong alignment on ScrollContext_OnScrollExtentUpdateNotification__DelegateSignature");
static_assert(sizeof(ScrollContext_OnScrollExtentUpdateNotification__DelegateSignature) == 0x000008, "Wrong size on ScrollContext_OnScrollExtentUpdateNotification__DelegateSignature");
static_assert(offsetof(ScrollContext_OnScrollExtentUpdateNotification__DelegateSignature, InContext) == 0x000000, "Member 'ScrollContext_OnScrollExtentUpdateNotification__DelegateSignature::InContext' has a wrong offset!");

// DelegateFunction HottaUIExtensions.ScrollContext.OnViewportDimensionUpdateNotification__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct ScrollContext_OnViewportDimensionUpdateNotification__DelegateSignature final
{
public:
	class UScrollContext*                         InContext;                                         // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollContext_OnViewportDimensionUpdateNotification__DelegateSignature) == 0x000008, "Wrong alignment on ScrollContext_OnViewportDimensionUpdateNotification__DelegateSignature");
static_assert(sizeof(ScrollContext_OnViewportDimensionUpdateNotification__DelegateSignature) == 0x000008, "Wrong size on ScrollContext_OnViewportDimensionUpdateNotification__DelegateSignature");
static_assert(offsetof(ScrollContext_OnViewportDimensionUpdateNotification__DelegateSignature, InContext) == 0x000000, "Member 'ScrollContext_OnViewportDimensionUpdateNotification__DelegateSignature::InContext' has a wrong offset!");

// Function HottaUIExtensions.FixedExtentScrollContext.CreateFixedExtentScrollContext
// 0x0018 (0x0018 - 0x0000)
struct FixedExtentScrollContext_CreateFixedExtentScrollContext final
{
public:
	TSubclassOf<class UFixedExtentScrollContext>  InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFixedExtentScrollContext*              ReturnValue;                                       // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FixedExtentScrollContext_CreateFixedExtentScrollContext) == 0x000008, "Wrong alignment on FixedExtentScrollContext_CreateFixedExtentScrollContext");
static_assert(sizeof(FixedExtentScrollContext_CreateFixedExtentScrollContext) == 0x000018, "Wrong size on FixedExtentScrollContext_CreateFixedExtentScrollContext");
static_assert(offsetof(FixedExtentScrollContext_CreateFixedExtentScrollContext, InClass) == 0x000000, "Member 'FixedExtentScrollContext_CreateFixedExtentScrollContext::InClass' has a wrong offset!");
static_assert(offsetof(FixedExtentScrollContext_CreateFixedExtentScrollContext, InOuter) == 0x000008, "Member 'FixedExtentScrollContext_CreateFixedExtentScrollContext::InOuter' has a wrong offset!");
static_assert(offsetof(FixedExtentScrollContext_CreateFixedExtentScrollContext, ReturnValue) == 0x000010, "Member 'FixedExtentScrollContext_CreateFixedExtentScrollContext::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.CreateScrollController
// 0x0020 (0x0020 - 0x0000)
struct ScrollController_CreateScrollController final
{
public:
	TSubclassOf<class UScrollController>          InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         Param_InitialScrollOffset;                         // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1168[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UScrollController*                      ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollController_CreateScrollController) == 0x000008, "Wrong alignment on ScrollController_CreateScrollController");
static_assert(sizeof(ScrollController_CreateScrollController) == 0x000020, "Wrong size on ScrollController_CreateScrollController");
static_assert(offsetof(ScrollController_CreateScrollController, InClass) == 0x000000, "Member 'ScrollController_CreateScrollController::InClass' has a wrong offset!");
static_assert(offsetof(ScrollController_CreateScrollController, InOuter) == 0x000008, "Member 'ScrollController_CreateScrollController::InOuter' has a wrong offset!");
static_assert(offsetof(ScrollController_CreateScrollController, Param_InitialScrollOffset) == 0x000010, "Member 'ScrollController_CreateScrollController::Param_InitialScrollOffset' has a wrong offset!");
static_assert(offsetof(ScrollController_CreateScrollController, ReturnValue) == 0x000018, "Member 'ScrollController_CreateScrollController::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.AnimateTo
// 0x0018 (0x0018 - 0x0000)
struct ScrollController_AnimateTo final
{
public:
	float                                         InNewScrollOffset;                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                         InDuration;                                        // 0x0004(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                            InCurve;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1169[0x7];                                     // 0x0011(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(ScrollController_AnimateTo) == 0x000008, "Wrong alignment on ScrollController_AnimateTo");
static_assert(sizeof(ScrollController_AnimateTo) == 0x000018, "Wrong size on ScrollController_AnimateTo");
static_assert(offsetof(ScrollController_AnimateTo, InNewScrollOffset) == 0x000000, "Member 'ScrollController_AnimateTo::InNewScrollOffset' has a wrong offset!");
static_assert(offsetof(ScrollController_AnimateTo, InDuration) == 0x000004, "Member 'ScrollController_AnimateTo::InDuration' has a wrong offset!");
static_assert(offsetof(ScrollController_AnimateTo, InCurve) == 0x000008, "Member 'ScrollController_AnimateTo::InCurve' has a wrong offset!");
static_assert(offsetof(ScrollController_AnimateTo, ReturnValue) == 0x000010, "Member 'ScrollController_AnimateTo::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.Attach
// 0x0008 (0x0008 - 0x0000)
struct ScrollController_Attach final
{
public:
	class UScrollPosition*                        InPosition;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollController_Attach) == 0x000008, "Wrong alignment on ScrollController_Attach");
static_assert(sizeof(ScrollController_Attach) == 0x000008, "Wrong size on ScrollController_Attach");
static_assert(offsetof(ScrollController_Attach, InPosition) == 0x000000, "Member 'ScrollController_Attach::InPosition' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.CreateScrollPosition
// 0x0020 (0x0020 - 0x0000)
struct ScrollController_CreateScrollPosition final
{
public:
	TSubclassOf<class UScrollPosition>            InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollableState*                       InState;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPhysics*                         InPhysics;                                         // 0x0010(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UScrollPosition*                        ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollController_CreateScrollPosition) == 0x000008, "Wrong alignment on ScrollController_CreateScrollPosition");
static_assert(sizeof(ScrollController_CreateScrollPosition) == 0x000020, "Wrong size on ScrollController_CreateScrollPosition");
static_assert(offsetof(ScrollController_CreateScrollPosition, InClass) == 0x000000, "Member 'ScrollController_CreateScrollPosition::InClass' has a wrong offset!");
static_assert(offsetof(ScrollController_CreateScrollPosition, InState) == 0x000008, "Member 'ScrollController_CreateScrollPosition::InState' has a wrong offset!");
static_assert(offsetof(ScrollController_CreateScrollPosition, InPhysics) == 0x000010, "Member 'ScrollController_CreateScrollPosition::InPhysics' has a wrong offset!");
static_assert(offsetof(ScrollController_CreateScrollPosition, ReturnValue) == 0x000018, "Member 'ScrollController_CreateScrollPosition::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.Detach
// 0x0008 (0x0008 - 0x0000)
struct ScrollController_Detach final
{
public:
	class UScrollPosition*                        InPosition;                                        // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollController_Detach) == 0x000008, "Wrong alignment on ScrollController_Detach");
static_assert(sizeof(ScrollController_Detach) == 0x000008, "Wrong size on ScrollController_Detach");
static_assert(offsetof(ScrollController_Detach, InPosition) == 0x000000, "Member 'ScrollController_Detach::InPosition' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.GetPosition
// 0x0008 (0x0008 - 0x0000)
struct ScrollController_GetPosition final
{
public:
	class UScrollPosition*                        ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollController_GetPosition) == 0x000008, "Wrong alignment on ScrollController_GetPosition");
static_assert(sizeof(ScrollController_GetPosition) == 0x000008, "Wrong size on ScrollController_GetPosition");
static_assert(offsetof(ScrollController_GetPosition, ReturnValue) == 0x000000, "Member 'ScrollController_GetPosition::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.GetPositions
// 0x0010 (0x0010 - 0x0000)
struct ScrollController_GetPositions final
{
public:
	TArray<class UScrollPosition*>                ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollController_GetPositions) == 0x000008, "Wrong alignment on ScrollController_GetPositions");
static_assert(sizeof(ScrollController_GetPositions) == 0x000010, "Wrong size on ScrollController_GetPositions");
static_assert(offsetof(ScrollController_GetPositions, ReturnValue) == 0x000000, "Member 'ScrollController_GetPositions::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.JumpTo
// 0x0004 (0x0004 - 0x0000)
struct ScrollController_JumpTo final
{
public:
	float                                         InNewScrollOffset;                                 // 0x0000(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollController_JumpTo) == 0x000004, "Wrong alignment on ScrollController_JumpTo");
static_assert(sizeof(ScrollController_JumpTo) == 0x000004, "Wrong size on ScrollController_JumpTo");
static_assert(offsetof(ScrollController_JumpTo, InNewScrollOffset) == 0x000000, "Member 'ScrollController_JumpTo::InNewScrollOffset' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.GetInitialScrollOffset
// 0x0004 (0x0004 - 0x0000)
struct ScrollController_GetInitialScrollOffset final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollController_GetInitialScrollOffset) == 0x000004, "Wrong alignment on ScrollController_GetInitialScrollOffset");
static_assert(sizeof(ScrollController_GetInitialScrollOffset) == 0x000004, "Wrong size on ScrollController_GetInitialScrollOffset");
static_assert(offsetof(ScrollController_GetInitialScrollOffset, ReturnValue) == 0x000000, "Member 'ScrollController_GetInitialScrollOffset::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.GetScrollOffset
// 0x0004 (0x0004 - 0x0000)
struct ScrollController_GetScrollOffset final
{
public:
	float                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollController_GetScrollOffset) == 0x000004, "Wrong alignment on ScrollController_GetScrollOffset");
static_assert(sizeof(ScrollController_GetScrollOffset) == 0x000004, "Wrong size on ScrollController_GetScrollOffset");
static_assert(offsetof(ScrollController_GetScrollOffset, ReturnValue) == 0x000000, "Member 'ScrollController_GetScrollOffset::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.ScrollController.HasClients
// 0x0001 (0x0001 - 0x0000)
struct ScrollController_HasClients final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(ScrollController_HasClients) == 0x000001, "Wrong alignment on ScrollController_HasClients");
static_assert(sizeof(ScrollController_HasClients) == 0x000001, "Wrong size on ScrollController_HasClients");
static_assert(offsetof(ScrollController_HasClients, ReturnValue) == 0x000000, "Member 'ScrollController_HasClients::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.FixedExtentScrollController.CreateFixedExtentScrollController
// 0x0020 (0x0020 - 0x0000)
struct FixedExtentScrollController_CreateFixedExtentScrollController final
{
public:
	TSubclassOf<class UFixedExtentScrollController> InClass;                                           // 0x0000(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                                InOuter;                                           // 0x0008(0x0008)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InitialItem;                                       // 0x0010(0x0004)(ConstParm, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_116B[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UFixedExtentScrollController*           ReturnValue;                                       // 0x0018(0x0008)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FixedExtentScrollController_CreateFixedExtentScrollController) == 0x000008, "Wrong alignment on FixedExtentScrollController_CreateFixedExtentScrollController");
static_assert(sizeof(FixedExtentScrollController_CreateFixedExtentScrollController) == 0x000020, "Wrong size on FixedExtentScrollController_CreateFixedExtentScrollController");
static_assert(offsetof(FixedExtentScrollController_CreateFixedExtentScrollController, InClass) == 0x000000, "Member 'FixedExtentScrollController_CreateFixedExtentScrollController::InClass' has a wrong offset!");
static_assert(offsetof(FixedExtentScrollController_CreateFixedExtentScrollController, InOuter) == 0x000008, "Member 'FixedExtentScrollController_CreateFixedExtentScrollController::InOuter' has a wrong offset!");
static_assert(offsetof(FixedExtentScrollController_CreateFixedExtentScrollController, InitialItem) == 0x000010, "Member 'FixedExtentScrollController_CreateFixedExtentScrollController::InitialItem' has a wrong offset!");
static_assert(offsetof(FixedExtentScrollController_CreateFixedExtentScrollController, ReturnValue) == 0x000018, "Member 'FixedExtentScrollController_CreateFixedExtentScrollController::ReturnValue' has a wrong offset!");

// Function HottaUIExtensions.FixedExtentScrollController.AnimateToItem
// 0x0008 (0x0008 - 0x0000)
struct FixedExtentScrollController_AnimateToItem final
{
public:
