#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: HottaSwimmingSystem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Oceanology_Plugin_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HottaSwimmingSystem.HottaSwimmingSystem_C
// 0x0030 (0x00F0 - 0x00C0)
class UHottaSwimmingSystem_C final : public UHottaSwimmingComponent
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x00C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_Character_Base_C*                   Owner;                                             // 0x00C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    PrimComponent;                                     // 0x00D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaOceanologyVolume*                 Oceanology_Swim_Volume;                            // 0x00D8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ShowDebugVolumes;                                  // 0x00E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          Height;                                            // 0x00E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_58FF[0x6];                                     // 0x00E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_Character_Base_C*                   Character;                                         // 0x00E8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)

public:
	void GetCharaterPos(struct FVector* Pos);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_HottaSwimmingSystem(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HottaSwimmingSystem_C">();
	}
	static class UHottaSwimmingSystem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UHottaSwimmingSystem_C>();
	}
};
static_assert(alignof(UHottaSwimmingSystem_C) == 0x000008, "Wrong alignment on UHottaSwimmingSystem_C");
static_assert(sizeof(UHottaSwimmingSystem_C) == 0x0000F0, "Wrong size on UHottaSwimmingSystem_C");
static_assert(offsetof(UHottaSwimmingSystem_C, UberGraphFrame) == 0x0000C0, "Member 'UHottaSwimmingSystem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UHottaSwimmingSystem_C, Owner) == 0x0000C8, "Member 'UHottaSwimmingSystem_C::Owner' has a wrong offset!");
static_assert(offsetof(UHottaSwimmingSystem_C, PrimComponent) == 0x0000D0, "Member 'UHottaSwimmingSystem_C::PrimComponent' has a wrong offset!");
static_assert(offsetof(UHottaSwimmingSystem_C, Oceanology_Swim_Volume) == 0x0000D8, "Member 'UHottaSwimmingSystem_C::Oceanology_Swim_Volume' has a wrong offset!");
static_assert(offsetof(UHottaSwimmingSystem_C, ShowDebugVolumes) == 0x0000E0, "Member 'UHottaSwimmingSystem_C::ShowDebugVolumes' has a wrong offset!");
static_assert(offsetof(UHottaSwimmingSystem_C, Height) == 0x0000E1, "Member 'UHottaSwimmingSystem_C::Height' has a wrong offset!");
static_assert(offsetof(UHottaSwimmingSystem_C, Character) == 0x0000E8, "Member 'UHottaSwimmingSystem_C::Character' has a wrong offset!");

}

