#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: IKAnimLayerInterface

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function IKAnimLayerInterface.IKAnimLayerInterface_C.IKAnimationLayer
// 0x0028 (0x0028 - 0x0000)
struct IKAnimLayerInterface_C_IKAnimationLayer final
{
public:
	struct FPoseLink                              InPose;                                            // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, NoDestructor)
	float                                         PowerIKAlpha;                                      // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_552F[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPoseLink                              Param_IKAnimationLayer;                            // 0x0018(0x0010)(Parm, OutParm, NoDestructor)
};
static_assert(alignof(IKAnimLayerInterface_C_IKAnimationLayer) == 0x000008, "Wrong alignment on IKAnimLayerInterface_C_IKAnimationLayer");
static_assert(sizeof(IKAnimLayerInterface_C_IKAnimationLayer) == 0x000028, "Wrong size on IKAnimLayerInterface_C_IKAnimationLayer");
static_assert(offsetof(IKAnimLayerInterface_C_IKAnimationLayer, InPose) == 0x000000, "Member 'IKAnimLayerInterface_C_IKAnimationLayer::InPose' has a wrong offset!");
static_assert(offsetof(IKAnimLayerInterface_C_IKAnimationLayer, PowerIKAlpha) == 0x000010, "Member 'IKAnimLayerInterface_C_IKAnimationLayer::PowerIKAlpha' has a wrong offset!");
static_assert(offsetof(IKAnimLayerInterface_C_IKAnimationLayer, Param_IKAnimationLayer) == 0x000018, "Member 'IKAnimLayerInterface_C_IKAnimationLayer::Param_IKAnimationLayer' has a wrong offset!");

}

