#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Jiaohuwhite_v204006

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass jiaohuwhite_v204006.jiaohuwhite_v204006_C
// 0x0030 (0x05D0 - 0x05A0)
class AJiaohuwhite_v204006_C final : public AHottaVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                       Sphere;                                            // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   QuestID;                                           // 0x05B0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 Pick_Up;                                           // 0x05B8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)
	class FName                                   ObjID;                                             // 0x05C8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_jiaohuwhite_v204006(int32 EntryPoint);
	void BPInteractFinished(class AHottaPlayerController* ByPC, int32 InteractIndex);
	void BPGetInteractEntries(class AHottaPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"jiaohuwhite_v204006_C">();
	}
	static class AJiaohuwhite_v204006_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AJiaohuwhite_v204006_C>();
	}
};
static_assert(alignof(AJiaohuwhite_v204006_C) == 0x000010, "Wrong alignment on AJiaohuwhite_v204006_C");
static_assert(sizeof(AJiaohuwhite_v204006_C) == 0x0005D0, "Wrong size on AJiaohuwhite_v204006_C");
static_assert(offsetof(AJiaohuwhite_v204006_C, UberGraphFrame) == 0x0005A0, "Member 'AJiaohuwhite_v204006_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AJiaohuwhite_v204006_C, Sphere) == 0x0005A8, "Member 'AJiaohuwhite_v204006_C::Sphere' has a wrong offset!");
static_assert(offsetof(AJiaohuwhite_v204006_C, QuestID) == 0x0005B0, "Member 'AJiaohuwhite_v204006_C::QuestID' has a wrong offset!");
static_assert(offsetof(AJiaohuwhite_v204006_C, Pick_Up) == 0x0005B8, "Member 'AJiaohuwhite_v204006_C::Pick_Up' has a wrong offset!");
static_assert(offsetof(AJiaohuwhite_v204006_C, ObjID) == 0x0005C8, "Member 'AJiaohuwhite_v204006_C::ObjID' has a wrong offset!");

}

