#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Jiaohuwhite_v204006

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function jiaohuwhite_v204006.jiaohuwhite_v204006_C.ExecuteUbergraph_jiaohuwhite_v204006
// 0x0030 (0x0030 - 0x0000)
struct Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D86[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerController*                 K2Node_Event_ByPC;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D87[0x4];                                     // 0x0014(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestObjectInProgress_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateQuestProgress_ReturnValue;          // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006) == 0x000008, "Wrong alignment on Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006");
static_assert(sizeof(Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006) == 0x000030, "Wrong size on Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006");
static_assert(offsetof(Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006, EntryPoint) == 0x000000, "Member 'Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006::EntryPoint' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006, K2Node_Event_ByPC) == 0x000008, "Member 'Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006::K2Node_Event_ByPC' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006, K2Node_Event_InteractIndex) == 0x000010, "Member 'Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006::K2Node_Event_InteractIndex' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000020, "Member 'Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006, CallFunc_IsQuestObjectInProgress_ReturnValue) == 0x000029, "Member 'Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006::CallFunc_IsQuestObjectInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006, CallFunc_UpdateQuestProgress_ReturnValue) == 0x00002A, "Member 'Jiaohuwhite_v204006_C_ExecuteUbergraph_jiaohuwhite_v204006::CallFunc_UpdateQuestProgress_ReturnValue' has a wrong offset!");

// Function jiaohuwhite_v204006.jiaohuwhite_v204006_C.BPInteractFinished
// 0x0010 (0x0010 - 0x0000)
struct Jiaohuwhite_v204006_C_BPInteractFinished final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Jiaohuwhite_v204006_C_BPInteractFinished) == 0x000008, "Wrong alignment on Jiaohuwhite_v204006_C_BPInteractFinished");
static_assert(sizeof(Jiaohuwhite_v204006_C_BPInteractFinished) == 0x000010, "Wrong size on Jiaohuwhite_v204006_C_BPInteractFinished");
static_assert(offsetof(Jiaohuwhite_v204006_C_BPInteractFinished, ByPC) == 0x000000, "Member 'Jiaohuwhite_v204006_C_BPInteractFinished::ByPC' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_BPInteractFinished, InteractIndex) == 0x000008, "Member 'Jiaohuwhite_v204006_C_BPInteractFinished::InteractIndex' has a wrong offset!");

// Function jiaohuwhite_v204006.jiaohuwhite_v204006_C.BPGetInteractEntries
// 0x0030 (0x0030 - 0x0000)
struct Jiaohuwhite_v204006_C_BPGetInteractEntries final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 OutInteractEntries;                                // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	class AHottaPlayerCharacter*                  CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestObjectInProgress_ReturnValue;      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Jiaohuwhite_v204006_C_BPGetInteractEntries) == 0x000008, "Wrong alignment on Jiaohuwhite_v204006_C_BPGetInteractEntries");
static_assert(sizeof(Jiaohuwhite_v204006_C_BPGetInteractEntries) == 0x000030, "Wrong size on Jiaohuwhite_v204006_C_BPGetInteractEntries");
static_assert(offsetof(Jiaohuwhite_v204006_C_BPGetInteractEntries, ByPC) == 0x000000, "Member 'Jiaohuwhite_v204006_C_BPGetInteractEntries::ByPC' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_BPGetInteractEntries, OutInteractEntries) == 0x000008, "Member 'Jiaohuwhite_v204006_C_BPGetInteractEntries::OutInteractEntries' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_BPGetInteractEntries, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'Jiaohuwhite_v204006_C_BPGetInteractEntries::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_BPGetInteractEntries, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000020, "Member 'Jiaohuwhite_v204006_C_BPGetInteractEntries::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_BPGetInteractEntries, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Jiaohuwhite_v204006_C_BPGetInteractEntries::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Jiaohuwhite_v204006_C_BPGetInteractEntries, CallFunc_IsQuestObjectInProgress_ReturnValue) == 0x000029, "Member 'Jiaohuwhite_v204006_C_BPGetInteractEntries::CallFunc_IsQuestObjectInProgress_ReturnValue' has a wrong offset!");

}

