#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Leaveupdatebox_sidequest

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"
#include "QRSL_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass leaveupdatebox_sidequest.leaveupdatebox_sidequest_C
// 0x0060 (0x0600 - 0x05A0)
class ALeaveupdatebox_sidequest_C final : public AHottaVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                    Billboard;                                         // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          Box;                                               // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class FName                                   Quest_ID;                                          // 0x05B8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   Object_ID;                                         // 0x05C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   black_text;                                        // 0x05C8(0x0018)(Edit, BlueprintVisible)
	bool                                          One_________;                                      // 0x05E0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          Tips;                                              // 0x05E1(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D7F[0x6];                                     // 0x05E2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInteractionTipsInfo>           Talk2;                                             // 0x05E8(0x0010)(Edit, BlueprintVisible, ContainsInstancedReference)

public:
	void ExecuteUbergraph_leaveupdatebox_sidequest(int32 EntryPoint);
	void BndEvt__linglongupdatebox_q600410_ZDY_Box_K2Node_ComponentBoundEvent_0_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"leaveupdatebox_sidequest_C">();
	}
	static class ALeaveupdatebox_sidequest_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ALeaveupdatebox_sidequest_C>();
	}
};
static_assert(alignof(ALeaveupdatebox_sidequest_C) == 0x000010, "Wrong alignment on ALeaveupdatebox_sidequest_C");
static_assert(sizeof(ALeaveupdatebox_sidequest_C) == 0x000600, "Wrong size on ALeaveupdatebox_sidequest_C");
static_assert(offsetof(ALeaveupdatebox_sidequest_C, UberGraphFrame) == 0x0005A0, "Member 'ALeaveupdatebox_sidequest_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ALeaveupdatebox_sidequest_C, Billboard) == 0x0005A8, "Member 'ALeaveupdatebox_sidequest_C::Billboard' has a wrong offset!");
static_assert(offsetof(ALeaveupdatebox_sidequest_C, Box) == 0x0005B0, "Member 'ALeaveupdatebox_sidequest_C::Box' has a wrong offset!");
static_assert(offsetof(ALeaveupdatebox_sidequest_C, Quest_ID) == 0x0005B8, "Member 'ALeaveupdatebox_sidequest_C::Quest_ID' has a wrong offset!");
static_assert(offsetof(ALeaveupdatebox_sidequest_C, Object_ID) == 0x0005C0, "Member 'ALeaveupdatebox_sidequest_C::Object_ID' has a wrong offset!");
static_assert(offsetof(ALeaveupdatebox_sidequest_C, black_text) == 0x0005C8, "Member 'ALeaveupdatebox_sidequest_C::black_text' has a wrong offset!");
static_assert(offsetof(ALeaveupdatebox_sidequest_C, One_________) == 0x0005E0, "Member 'ALeaveupdatebox_sidequest_C::One_________' has a wrong offset!");
static_assert(offsetof(ALeaveupdatebox_sidequest_C, Tips) == 0x0005E1, "Member 'ALeaveupdatebox_sidequest_C::Tips' has a wrong offset!");
static_assert(offsetof(ALeaveupdatebox_sidequest_C, Talk2) == 0x0005E8, "Member 'ALeaveupdatebox_sidequest_C::Talk2' has a wrong offset!");

}

