#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Limit_Buff_GC_Quset_Respawn

#include "Basic.hpp"


namespace SDK::Params
{

// Function limit_Buff_GC_Quset_Respawn.limit_Buff_GC_Quset_Respawn_C.CanApplyGameplayEffectContent
// 0x0048 (0x0048 - 0x0000)
struct Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InstigatorActor;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C84[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C85[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHP_ReturnValue;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHP_ReturnValue;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent) == 0x000008, "Wrong alignment on Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent");
static_assert(sizeof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent) == 0x000048, "Wrong size on Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, SourceActor) == 0x000000, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::SourceActor' has a wrong offset!");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, TargetActor) == 0x000008, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::TargetActor' has a wrong offset!");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, InstigatorActor) == 0x000010, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::InstigatorActor' has a wrong offset!");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, GameplayEffect) == 0x000018, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::GameplayEffect' has a wrong offset!");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, ReturnValue) == 0x000020, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000028, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, CallFunc_GetHP_ReturnValue) == 0x000034, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::CallFunc_GetHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, CallFunc_GetMaxHP_ReturnValue) == 0x000038, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::CallFunc_GetMaxHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00003C, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000040, "Member 'Limit_Buff_GC_Quset_Respawn_C_CanApplyGameplayEffectContent::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");

}

