#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Main_dialogue

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass main_dialogue.main_dialogue_C
// 0x0018 (0x09C8 - 0x09B0)
class UMain_dialogue_C final : public UHottaInteractEntryWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09B0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_68;                                          // 0x09B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           InteractButton;                                    // 0x09C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_main_dialogue(int32 EntryPoint);
	void BPOnGamepadInputChanged(bool bGamepad);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"main_dialogue_C">();
	}
	static class UMain_dialogue_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMain_dialogue_C>();
	}
};
static_assert(alignof(UMain_dialogue_C) == 0x000008, "Wrong alignment on UMain_dialogue_C");
static_assert(sizeof(UMain_dialogue_C) == 0x0009C8, "Wrong size on UMain_dialogue_C");
static_assert(offsetof(UMain_dialogue_C, UberGraphFrame) == 0x0009B0, "Member 'UMain_dialogue_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMain_dialogue_C, Image_68) == 0x0009B8, "Member 'UMain_dialogue_C::Image_68' has a wrong offset!");
static_assert(offsetof(UMain_dialogue_C, InteractButton) == 0x0009C0, "Member 'UMain_dialogue_C::InteractButton' has a wrong offset!");

}

