#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MarkPhyLevel1

#include "Basic.hpp"


namespace SDK::Params
{

// Function MarkPhyLevel1.MarkPhyLevel1_C.CanApplyGameplayEffectContent
// 0x0048 (0x0048 - 0x0000)
struct MarkPhyLevel1_C_CanApplyGameplayEffectContent final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InstigatorActor;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B1[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMirrorCharacter_ReturnValue;            // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55B2[0x2];                                     // 0x0032(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetHP_ReturnValue;                        // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetMaxHP_ReturnValue;                     // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue; // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MarkPhyLevel1_C_CanApplyGameplayEffectContent) == 0x000008, "Wrong alignment on MarkPhyLevel1_C_CanApplyGameplayEffectContent");
static_assert(sizeof(MarkPhyLevel1_C_CanApplyGameplayEffectContent) == 0x000048, "Wrong size on MarkPhyLevel1_C_CanApplyGameplayEffectContent");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, SourceActor) == 0x000000, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::SourceActor' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, TargetActor) == 0x000008, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::TargetActor' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, InstigatorActor) == 0x000010, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::InstigatorActor' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, GameplayEffect) == 0x000018, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::GameplayEffect' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, ReturnValue) == 0x000020, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_AsHotta_Character) == 0x000028, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, CallFunc_IsMirrorCharacter_ReturnValue) == 0x000031, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::CallFunc_IsMirrorCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, CallFunc_GetHP_ReturnValue) == 0x000034, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::CallFunc_GetHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, CallFunc_GetMaxHP_ReturnValue) == 0x000038, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::CallFunc_GetMaxHP_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00003C, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue) == 0x000040, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000041, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(MarkPhyLevel1_C_CanApplyGameplayEffectContent, CallFunc_BooleanAND_ReturnValue) == 0x000042, "Member 'MarkPhyLevel1_C_CanApplyGameplayEffectContent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

}

