#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MarkRobCannon

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MarkRobCannon.MarkRobCannon_C
// 0x01F0 (0x04B0 - 0x02C0)
class UMarkRobCannon_C final : public UAnimInstance
{
public:
	uint8                                         Pad_5974[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer;                      // 0x02F8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x0378(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x03A8(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x0458(0x0048)()
	class UAnimSequence*                          IdleStateAnim;                                     // 0x04A0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MarkRobCannon(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MarkRobCannon_C">();
	}
	static class UMarkRobCannon_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMarkRobCannon_C>();
	}
};
static_assert(alignof(UMarkRobCannon_C) == 0x000010, "Wrong alignment on UMarkRobCannon_C");
static_assert(sizeof(UMarkRobCannon_C) == 0x0004B0, "Wrong size on UMarkRobCannon_C");
static_assert(offsetof(UMarkRobCannon_C, UberGraphFrame) == 0x0002C0, "Member 'UMarkRobCannon_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UMarkRobCannon_C, AnimGraphNode_Root) == 0x0002C8, "Member 'UMarkRobCannon_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(UMarkRobCannon_C, AnimGraphNode_SequencePlayer) == 0x0002F8, "Member 'UMarkRobCannon_C::AnimGraphNode_SequencePlayer' has a wrong offset!");
static_assert(offsetof(UMarkRobCannon_C, AnimGraphNode_StateResult) == 0x000378, "Member 'UMarkRobCannon_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(UMarkRobCannon_C, AnimGraphNode_StateMachine) == 0x0003A8, "Member 'UMarkRobCannon_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(UMarkRobCannon_C, AnimGraphNode_Slot) == 0x000458, "Member 'UMarkRobCannon_C::AnimGraphNode_Slot' has a wrong offset!");
static_assert(offsetof(UMarkRobCannon_C, IdleStateAnim) == 0x0004A0, "Member 'UMarkRobCannon_C::IdleStateAnim' has a wrong offset!");

}

