#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Minigame_Cactus_main

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function Minigame_Cactus_main.Minigame_Cactus_main_C.ExecuteUbergraph_Minigame_Cactus_main
// 0x03E0 (0x03E0 - 0x0000)
struct Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class ABreakableActor* InActor)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AItemActor* HarvestedActor)> K2Node_CreateDelegate_OutputDelegate_2;            // 0x0024(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6DDA[0xC];                                     // 0x0034(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_K2_GetComponentToWorld_ReturnValue;       // 0x0040(0x0030)(IsPlainOldData, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable;                                // 0x0070(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x0080(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_1;                              // 0x0090(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_1;                            // 0x00A0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_2;                              // 0x00B0(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_2;                            // 0x00C0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_3;                              // 0x00D0(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_3;                            // 0x00E0(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ___object_Variable;                                // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_As____;                         // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DDB[0x7];                                     // 0x0109(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ___object_Variable_1;                              // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_As_____1;                       // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0128(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DDC[0x7];                                     // 0x0129(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DDD[0x7];                                     // 0x0141(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABreakableActor*                        K2Node_CustomEvent_InActor;                        // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue;       // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DDE[0x7];                                     // 0x0151(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemActor*                             K2Node_CustomEvent_HarvestedActor;                 // 0x0158(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0160(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DDF[0x7];                                     // 0x0171(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_DamageCauser;                         // 0x0178(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             K2Node_Event_HitResult;                            // 0x0180(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          K2Node_Event_bRealDamaged;                         // 0x020C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DE0[0x3];                                     // 0x020D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_1;   // 0x0210(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_2;       // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsYahaha2SubmittedByID_ReturnValue_1;     // 0x0221(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DE1[0x2];                                     // 0x0222(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_3;            // 0x0224(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6DE2[0x4];                                     // 0x0234(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_HarvestBase_C*                      CallFunc_FinishSpawningActor_ReturnValue;          // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DE3[0x7];                                     // 0x0249(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AItemActor*                             K2Node_ComponentBoundEvent_ItemActor;              // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bHarvested;             // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DE4[0x7];                                     // 0x0259(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class ABP_MiniGame_CactusGem_Base_C*          K2Node_DynamicCast_AsBP_Mini_Game_Cactus_Gem_Base; // 0x0260(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0268(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DE5[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocationEx_ReturnValue;     // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPOI                                   K2Node_MakeStruct_POI;                             // 0x0280(0x0060)()
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x02E0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x02E4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEvent_ReturnValue_2;                  // 0x02E8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x02EC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DE6[0x3];                                     // 0x02ED(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_3;                  // 0x02F0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x02F4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_1;               // 0x02F5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_2;               // 0x02F6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x02F7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x02F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_3;               // 0x02F9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x02FA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DE7[0x1];                                     // 0x02FB(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x02FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0300(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0304(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0308(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DE8[0x4];                                     // 0x0314(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0318(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0320(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0321(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DE9[0x2];                                     // 0x0322(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0324(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0330(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetSplineLength_ReturnValue;              // 0x0334(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0338(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue; // 0x033C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             CallFunc_K2_SetWorldLocation_SweepHitResult;       // 0x0348(0x008C)(IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main) == 0x000010, "Wrong alignment on Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main");
static_assert(sizeof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main) == 0x0003E0, "Wrong size on Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, EntryPoint) == 0x000000, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::EntryPoint' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_CreateDelegate_OutputDelegate_2) == 0x000024, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_K2_GetComponentToWorld_ReturnValue) == 0x000040, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_K2_GetComponentToWorld_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, ___struct_Variable) == 0x000070, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::___struct_Variable' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, ___delegate_Variable) == 0x000080, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, ___struct_Variable_1) == 0x000090, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, ___delegate_Variable_1) == 0x0000A0, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::___delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, ___struct_Variable_2) == 0x0000B0, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::___struct_Variable_2' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, ___delegate_Variable_2) == 0x0000C0, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::___delegate_Variable_2' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, ___struct_Variable_3) == 0x0000D0, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::___struct_Variable_3' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, ___delegate_Variable_3) == 0x0000E0, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::___delegate_Variable_3' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_CustomEvent_Loaded_1) == 0x0000F0, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, ___object_Variable) == 0x0000F8, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::___object_Variable' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_As____) == 0x000100, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_bSuccess) == 0x000108, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_CustomEvent_Loaded) == 0x000110, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, ___object_Variable_1) == 0x000118, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::___object_Variable_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_As_____1) == 0x000120, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_As_____1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_bSuccess_1) == 0x000128, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_Event_MainPlayer) == 0x000130, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000138, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_bSuccess_2) == 0x000140, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_CustomEvent_InActor) == 0x000148, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_CustomEvent_InActor' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_IsYahaha2SubmittedByID_ReturnValue) == 0x000150, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_IsYahaha2SubmittedByID_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_CustomEvent_HarvestedActor) == 0x000158, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_CustomEvent_HarvestedActor' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000160, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000168, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_bSuccess_3) == 0x000170, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_Event_DamageCauser) == 0x000178, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_Event_DamageCauser' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_Event_HitResult) == 0x000180, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_Event_HitResult' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_Event_bRealDamaged) == 0x00020C, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_Event_bRealDamaged' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_GetClientPlayerCharacter_ReturnValue_1) == 0x000210, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_GetClientPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_AsQRSLPlayer_Character_2) == 0x000218, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_AsQRSLPlayer_Character_2' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_bSuccess_4) == 0x000220, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_IsYahaha2SubmittedByID_ReturnValue_1) == 0x000221, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_IsYahaha2SubmittedByID_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_CreateDelegate_OutputDelegate_3) == 0x000224, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x000238, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_FinishSpawningActor_ReturnValue) == 0x000240, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_IsValid_ReturnValue) == 0x000248, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_ComponentBoundEvent_ItemActor) == 0x000250, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_ComponentBoundEvent_ItemActor' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_ComponentBoundEvent_bHarvested) == 0x000258, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_ComponentBoundEvent_bHarvested' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_AsBP_Mini_Game_Cactus_Gem_Base) == 0x000260, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_AsBP_Mini_Game_Cactus_Gem_Base' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_DynamicCast_bSuccess_5) == 0x000268, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x00026C, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_SpawnEmitterAtLocationEx_ReturnValue) == 0x000278, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_SpawnEmitterAtLocationEx_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_MakeStruct_POI) == 0x000280, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_MakeStruct_POI' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_PostEvent_ReturnValue) == 0x0002E0, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_PostEvent_ReturnValue_1) == 0x0002E4, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_PostEvent_ReturnValue_2) == 0x0002E8, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_PostEvent_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_SwitchNetMode_OutNetMode) == 0x0002EC, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_PostEvent_ReturnValue_3) == 0x0002F0, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_PostEvent_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_SwitchEnum_CmpSuccess) == 0x0002F4, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_SwitchNetMode_OutNetMode_1) == 0x0002F5, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_SwitchNetMode_OutNetMode_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_SwitchNetMode_OutNetMode_2) == 0x0002F6, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_SwitchNetMode_OutNetMode_2' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_SwitchEnum_CmpSuccess_1) == 0x0002F7, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_SwitchEnum_CmpSuccess_2) == 0x0002F8, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_SwitchNetMode_OutNetMode_3) == 0x0002F9, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_SwitchNetMode_OutNetMode_3' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, K2Node_SwitchEnum_CmpSuccess_3) == 0x0002FA, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_Add_FloatFloat_ReturnValue) == 0x0002FC, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000300, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000304, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_MakeVector_ReturnValue) == 0x000308, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_MakeVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000318, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_IsValid_ReturnValue_1) == 0x000320, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_IsValid_ReturnValue_2) == 0x000321, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_IsValid_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000324, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_PostEventAtLocation_ReturnValue) == 0x000330, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_GetSplineLength_ReturnValue) == 0x000334, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_GetSplineLength_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000338, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue) == 0x00033C, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_GetLocationAtDistanceAlongSpline_ReturnValue' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main, CallFunc_K2_SetWorldLocation_SweepHitResult) == 0x000348, "Member 'Minigame_Cactus_main_C_ExecuteUbergraph_Minigame_Cactus_main::CallFunc_K2_SetWorldLocation_SweepHitResult' has a wrong offset!");

// Function Minigame_Cactus_main.Minigame_Cactus_main_C.BndEvt__Minigame_Cactus_main_CactusTargetGemManager_K2Node_ComponentBoundEvent_0_OnVisualHarvestSignature__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct Minigame_Cactus_main_C_BndEvt__Minigame_Cactus_main_CactusTargetGemManager_K2Node_ComponentBoundEvent_0_OnVisualHarvestSignature__DelegateSignature final
{
public:
	class AItemActor*                             ItemActor;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Param_bHarvested;                                  // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Minigame_Cactus_main_C_BndEvt__Minigame_Cactus_main_CactusTargetGemManager_K2Node_ComponentBoundEvent_0_OnVisualHarvestSignature__DelegateSignature) == 0x000008, "Wrong alignment on Minigame_Cactus_main_C_BndEvt__Minigame_Cactus_main_CactusTargetGemManager_K2Node_ComponentBoundEvent_0_OnVisualHarvestSignature__DelegateSignature");
static_assert(sizeof(Minigame_Cactus_main_C_BndEvt__Minigame_Cactus_main_CactusTargetGemManager_K2Node_ComponentBoundEvent_0_OnVisualHarvestSignature__DelegateSignature) == 0x000010, "Wrong size on Minigame_Cactus_main_C_BndEvt__Minigame_Cactus_main_CactusTargetGemManager_K2Node_ComponentBoundEvent_0_OnVisualHarvestSignature__DelegateSignature");
static_assert(offsetof(Minigame_Cactus_main_C_BndEvt__Minigame_Cactus_main_CactusTargetGemManager_K2Node_ComponentBoundEvent_0_OnVisualHarvestSignature__DelegateSignature, ItemActor) == 0x000000, "Member 'Minigame_Cactus_main_C_BndEvt__Minigame_Cactus_main_CactusTargetGemManager_K2Node_ComponentBoundEvent_0_OnVisualHarvestSignature__DelegateSignature::ItemActor' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_BndEvt__Minigame_Cactus_main_CactusTargetGemManager_K2Node_ComponentBoundEvent_0_OnVisualHarvestSignature__DelegateSignature, Param_bHarvested) == 0x000008, "Member 'Minigame_Cactus_main_C_BndEvt__Minigame_Cactus_main_CactusTargetGemManager_K2Node_ComponentBoundEvent_0_OnVisualHarvestSignature__DelegateSignature::Param_bHarvested' has a wrong offset!");

// Function Minigame_Cactus_main.Minigame_Cactus_main_C.ReceiveOnTakeDamage
// 0x0098 (0x0098 - 0x0000)
struct Minigame_Cactus_main_C_ReceiveOnTakeDamage final
{
public:
	class AActor*                                 DamageCauser;                                      // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FHitResult                             HitResult;                                         // 0x0008(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	bool                                          bRealDamaged;                                      // 0x0094(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Minigame_Cactus_main_C_ReceiveOnTakeDamage) == 0x000008, "Wrong alignment on Minigame_Cactus_main_C_ReceiveOnTakeDamage");
static_assert(sizeof(Minigame_Cactus_main_C_ReceiveOnTakeDamage) == 0x000098, "Wrong size on Minigame_Cactus_main_C_ReceiveOnTakeDamage");
static_assert(offsetof(Minigame_Cactus_main_C_ReceiveOnTakeDamage, DamageCauser) == 0x000000, "Member 'Minigame_Cactus_main_C_ReceiveOnTakeDamage::DamageCauser' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ReceiveOnTakeDamage, HitResult) == 0x000008, "Member 'Minigame_Cactus_main_C_ReceiveOnTakeDamage::HitResult' has a wrong offset!");
static_assert(offsetof(Minigame_Cactus_main_C_ReceiveOnTakeDamage, bRealDamaged) == 0x000094, "Member 'Minigame_Cactus_main_C_ReceiveOnTakeDamage::bRealDamaged' has a wrong offset!");

// Function Minigame_Cactus_main.Minigame_Cactus_main_C.OnItemHarvested_Event_0
// 0x0008 (0x0008 - 0x0000)
struct Minigame_Cactus_main_C_OnItemHarvested_Event_0 final
{
public:
	class AItemActor*                             HarvestedActor;                                    // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Minigame_Cactus_main_C_OnItemHarvested_Event_0) == 0x000008, "Wrong alignment on Minigame_Cactus_main_C_OnItemHarvested_Event_0");
static_assert(sizeof(Minigame_Cactus_main_C_OnItemHarvested_Event_0) == 0x000008, "Wrong size on Minigame_Cactus_main_C_OnItemHarvested_Event_0");
static_assert(offsetof(Minigame_Cactus_main_C_OnItemHarvested_Event_0, HarvestedActor) == 0x000000, "Member 'Minigame_Cactus_main_C_OnItemHarvested_Event_0::HarvestedActor' has a wrong offset!");

// Function Minigame_Cactus_main.Minigame_Cactus_main_C.OnBrokenDelegate_Event_1
// 0x0008 (0x0008 - 0x0000)
struct Minigame_Cactus_main_C_OnBrokenDelegate_Event_1 final
{
public:
	class ABreakableActor*                        InActor;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Minigame_Cactus_main_C_OnBrokenDelegate_Event_1) == 0x000008, "Wrong alignment on Minigame_Cactus_main_C_OnBrokenDelegate_Event_1");
static_assert(sizeof(Minigame_Cactus_main_C_OnBrokenDelegate_Event_1) == 0x000008, "Wrong size on Minigame_Cactus_main_C_OnBrokenDelegate_Event_1");
static_assert(offsetof(Minigame_Cactus_main_C_OnBrokenDelegate_Event_1, InActor) == 0x000000, "Member 'Minigame_Cactus_main_C_OnBrokenDelegate_Event_1::InActor' has a wrong offset!");

// Function Minigame_Cactus_main.Minigame_Cactus_main_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct Minigame_Cactus_main_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Minigame_Cactus_main_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on Minigame_Cactus_main_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(Minigame_Cactus_main_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on Minigame_Cactus_main_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(Minigame_Cactus_main_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'Minigame_Cactus_main_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

// Function Minigame_Cactus_main.Minigame_Cactus_main_C.OnLoaded_C11B30CC457474E31F7AF3A271E0D76F
// 0x0008 (0x0008 - 0x0000)
struct Minigame_Cactus_main_C_OnLoaded_C11B30CC457474E31F7AF3A271E0D76F final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Minigame_Cactus_main_C_OnLoaded_C11B30CC457474E31F7AF3A271E0D76F) == 0x000008, "Wrong alignment on Minigame_Cactus_main_C_OnLoaded_C11B30CC457474E31F7AF3A271E0D76F");
static_assert(sizeof(Minigame_Cactus_main_C_OnLoaded_C11B30CC457474E31F7AF3A271E0D76F) == 0x000008, "Wrong size on Minigame_Cactus_main_C_OnLoaded_C11B30CC457474E31F7AF3A271E0D76F");
static_assert(offsetof(Minigame_Cactus_main_C_OnLoaded_C11B30CC457474E31F7AF3A271E0D76F, Loaded) == 0x000000, "Member 'Minigame_Cactus_main_C_OnLoaded_C11B30CC457474E31F7AF3A271E0D76F::Loaded' has a wrong offset!");

// Function Minigame_Cactus_main.Minigame_Cactus_main_C.OnLoaded_EC64F11C4CC648049FDCC1BCB7679637
// 0x0008 (0x0008 - 0x0000)
struct Minigame_Cactus_main_C_OnLoaded_EC64F11C4CC648049FDCC1BCB7679637 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Minigame_Cactus_main_C_OnLoaded_EC64F11C4CC648049FDCC1BCB7679637) == 0x000008, "Wrong alignment on Minigame_Cactus_main_C_OnLoaded_EC64F11C4CC648049FDCC1BCB7679637");
static_assert(sizeof(Minigame_Cactus_main_C_OnLoaded_EC64F11C4CC648049FDCC1BCB7679637) == 0x000008, "Wrong size on Minigame_Cactus_main_C_OnLoaded_EC64F11C4CC648049FDCC1BCB7679637");
static_assert(offsetof(Minigame_Cactus_main_C_OnLoaded_EC64F11C4CC648049FDCC1BCB7679637, Loaded) == 0x000000, "Member 'Minigame_Cactus_main_C_OnLoaded_EC64F11C4CC648049FDCC1BCB7679637::Loaded' has a wrong offset!");

}

