#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ModifyArmorDamageFreeRatio

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function ModifyArmorDamageFreeRatio.ModifyArmorDamageFreeRatio_C.HottaCalculateBaseMagnitude
// 0x0088 (0x0088 - 0x0000)
struct ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude final
{
public:
	const class AActor*                           OwnerActor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           HitActor;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InstigatorActor;                                   // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalPassArmor;                                    // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult;          // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5552[0x2];                                     // 0x002A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY;              // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelScene_ReturnValue;                 // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5553[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsBreakFateMap_ReturnValue;               // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5554[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaItem*                             CallFunc_GetPlayerWeaponObject_ReturnValue;        // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5555[0x1];                                     // 0x004B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetMaxATField_ReturnValue;                // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue; // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue_1; // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue_2; // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_GetATField_ReturnValue;                   // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5556[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Divide_FloatFloat_ReturnValue;            // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_1;        // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5557[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_1;            // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5558[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EEvaluateCurveTableResult                     CallFunc_EvaluateCurveTableRow_OutResult_2;        // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5559[0x3];                                     // 0x0071(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_EvaluateCurveTableRow_OutXY_2;            // 0x0074(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_555A[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0080(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude) == 0x000008, "Wrong alignment on ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude");
static_assert(sizeof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude) == 0x000088, "Wrong size on ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, OwnerActor) == 0x000000, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::OwnerActor' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, HitActor) == 0x000008, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::HitActor' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, InstigatorActor) == 0x000010, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::InstigatorActor' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, ReturnValue) == 0x000018, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, TotalPassArmor) == 0x00001C, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::TotalPassArmor' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000020, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult) == 0x000029, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY) == 0x00002C, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_IsLevelScene_ReturnValue) == 0x000030, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_IsLevelScene_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_Add_FloatFloat_ReturnValue) == 0x000034, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_Not_PreBool_ReturnValue) == 0x000038, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess) == 0x000039, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_IsBreakFateMap_ReturnValue) == 0x00003A, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_IsBreakFateMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003B, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_Not_PreBool_ReturnValue_2) == 0x00003C, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_GetPlayerWeaponObject_ReturnValue) == 0x000040, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_GetPlayerWeaponObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_BooleanAND_ReturnValue) == 0x000048, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_IsValid_ReturnValue) == 0x000049, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_BooleanAND_ReturnValue_1) == 0x00004A, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_GetMaxATField_ReturnValue) == 0x00004C, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_GetMaxATField_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue) == 0x000050, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue_1) == 0x000051, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue_2) == 0x000052, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_BooleanAND_ReturnValue_2) == 0x000053, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_GetATField_ReturnValue) == 0x000054, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_GetATField_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_BooleanAND_ReturnValue_3) == 0x000058, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_Divide_FloatFloat_ReturnValue) == 0x00005C, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_Divide_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult_1) == 0x000060, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult_1' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY_1) == 0x000064, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY_1' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess_1) == 0x000068, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x00006C, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutResult_2) == 0x000070, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutResult_2' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_EvaluateCurveTableRow_OutXY_2) == 0x000074, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_EvaluateCurveTableRow_OutXY_2' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, K2Node_SwitchEnum_CmpSuccess_2) == 0x000078, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x00007C, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000080, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude, CallFunc_Add_FloatFloat_ReturnValue_2) == 0x000084, "Member 'ModifyArmorDamageFreeRatio_C_HottaCalculateBaseMagnitude::CallFunc_Add_FloatFloat_ReturnValue_2' has a wrong offset!");

}

