#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mon_hum_087_chief_world

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function mon_hum_087_chief_world.mon_hum_087_chief_world_C.ExecuteUbergraph_mon_hum_087_chief_world
// 0x00F0 (0x00F0 - 0x0000)
struct Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AActor* OverlappedActor, class AActor* OtherActor)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E2E[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontageEx_ReturnValue;            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E2F[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Location;                  // 0x0050(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               CallFunc_BreakTransform_Rotation;                  // 0x005C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                                CallFunc_BreakTransform_Scale;                     // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E30[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AAIController*                          CallFunc_GetAIController_ReturnValue;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                             CallFunc_GetTransform_ReturnValue_1;               // 0x0080(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class AMonsterControllerBP_Base_C*            K2Node_DynamicCast_AsMonster_Controller_BP_Base;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E31[0x7];                                     // 0x00B9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue; // 0x00C0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OverlappedActor;                // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_CustomEvent_OtherActor;                     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUndergroundOverlapActor_C*             CallFunc_FinishSpawningActor_ReturnValue;          // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_1;               // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsDead_ReturnValue;                       // 0x00EA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00EB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world) == 0x000010, "Wrong alignment on Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world");
static_assert(sizeof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world) == 0x0000F0, "Wrong size on Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, EntryPoint) == 0x000000, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_SwitchNetMode_OutNetMode) == 0x000014, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_PlayAnimMontageEx_ReturnValue) == 0x000018, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_PlayAnimMontageEx_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, K2Node_SwitchEnum_CmpSuccess) == 0x00001C, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_GetTransform_ReturnValue) == 0x000020, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_BreakTransform_Location) == 0x000050, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_BreakTransform_Location' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_BreakTransform_Rotation) == 0x00005C, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_BreakTransform_Rotation' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_BreakTransform_Scale) == 0x000068, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_BreakTransform_Scale' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_GetAIController_ReturnValue) == 0x000078, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_GetAIController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_GetTransform_ReturnValue_1) == 0x000080, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_GetTransform_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, K2Node_DynamicCast_AsMonster_Controller_BP_Base) == 0x0000B0, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::K2Node_DynamicCast_AsMonster_Controller_BP_Base' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, K2Node_DynamicCast_bSuccess) == 0x0000B8, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue) == 0x0000C0, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, K2Node_CustomEvent_OverlappedActor) == 0x0000C8, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::K2Node_CustomEvent_OverlappedActor' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, K2Node_CustomEvent_OtherActor) == 0x0000D0, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::K2Node_CustomEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_FinishSpawningActor_ReturnValue) == 0x0000D8, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_FinishSpawningActor_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x0000E0, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, K2Node_DynamicCast_bSuccess_1) == 0x0000E8, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_SwitchNetMode_OutNetMode_1) == 0x0000E9, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_SwitchNetMode_OutNetMode_1' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, CallFunc_IsDead_ReturnValue) == 0x0000EA, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::CallFunc_IsDead_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000EB, "Member 'Mon_hum_087_chief_world_C_ExecuteUbergraph_mon_hum_087_chief_world::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function mon_hum_087_chief_world.mon_hum_087_chief_world_C.OnActorBeginOverlap_ܚ_0
// 0x0010 (0x0010 - 0x0000)
struct Mon_hum_087_chief_world_C_OnActorBeginOverlap____0 final
{
public:
	class AActor*                                 OverlappedActor;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mon_hum_087_chief_world_C_OnActorBeginOverlap____0) == 0x000008, "Wrong alignment on Mon_hum_087_chief_world_C_OnActorBeginOverlap____0");
static_assert(sizeof(Mon_hum_087_chief_world_C_OnActorBeginOverlap____0) == 0x000010, "Wrong size on Mon_hum_087_chief_world_C_OnActorBeginOverlap____0");
static_assert(offsetof(Mon_hum_087_chief_world_C_OnActorBeginOverlap____0, OverlappedActor) == 0x000000, "Member 'Mon_hum_087_chief_world_C_OnActorBeginOverlap____0::OverlappedActor' has a wrong offset!");
static_assert(offsetof(Mon_hum_087_chief_world_C_OnActorBeginOverlap____0, OtherActor) == 0x000008, "Member 'Mon_hum_087_chief_world_C_OnActorBeginOverlap____0::OtherActor' has a wrong offset!");

}

