#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mon_hum_019

#include "Basic.hpp"


namespace SDK::Params
{

// Function mon_hum_019.mon_hum_019_C.ExecuteUbergraph_mon_hum_019
// 0x001C (0x001C - 0x0000)
struct Mon_hum_019_C_ExecuteUbergraph_mon_hum_019 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ChangeBossStage_ReturnValue;              // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55F1[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   K2Node_Event_BodyPartTag;                          // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55F2[0x3];                                     // 0x0011(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeBossStage_ReturnValue_1;            // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ChangeBossStage_ReturnValue_2;            // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019) == 0x000004, "Wrong alignment on Mon_hum_019_C_ExecuteUbergraph_mon_hum_019");
static_assert(sizeof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019) == 0x00001C, "Wrong size on Mon_hum_019_C_ExecuteUbergraph_mon_hum_019");
static_assert(offsetof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019, EntryPoint) == 0x000000, "Member 'Mon_hum_019_C_ExecuteUbergraph_mon_hum_019::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019, CallFunc_ChangeBossStage_ReturnValue) == 0x000004, "Member 'Mon_hum_019_C_ExecuteUbergraph_mon_hum_019::CallFunc_ChangeBossStage_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019, K2Node_Event_BodyPartTag) == 0x000008, "Member 'Mon_hum_019_C_ExecuteUbergraph_mon_hum_019::K2Node_Event_BodyPartTag' has a wrong offset!");
static_assert(offsetof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019, CallFunc_EqualEqual_NameName_ReturnValue) == 0x000010, "Member 'Mon_hum_019_C_ExecuteUbergraph_mon_hum_019::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019, CallFunc_Array_Length_ReturnValue) == 0x000014, "Member 'Mon_hum_019_C_ExecuteUbergraph_mon_hum_019::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000018, "Member 'Mon_hum_019_C_ExecuteUbergraph_mon_hum_019::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000019, "Member 'Mon_hum_019_C_ExecuteUbergraph_mon_hum_019::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019, CallFunc_ChangeBossStage_ReturnValue_1) == 0x00001A, "Member 'Mon_hum_019_C_ExecuteUbergraph_mon_hum_019::CallFunc_ChangeBossStage_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mon_hum_019_C_ExecuteUbergraph_mon_hum_019, CallFunc_ChangeBossStage_ReturnValue_2) == 0x00001B, "Member 'Mon_hum_019_C_ExecuteUbergraph_mon_hum_019::CallFunc_ChangeBossStage_ReturnValue_2' has a wrong offset!");

// Function mon_hum_019.mon_hum_019_C.BPOnBodyPartDestroyed
// 0x0008 (0x0008 - 0x0000)
struct Mon_hum_019_C_BPOnBodyPartDestroyed final
{
public:
	class FName                                   BodyPartTag;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mon_hum_019_C_BPOnBodyPartDestroyed) == 0x000004, "Wrong alignment on Mon_hum_019_C_BPOnBodyPartDestroyed");
static_assert(sizeof(Mon_hum_019_C_BPOnBodyPartDestroyed) == 0x000008, "Wrong size on Mon_hum_019_C_BPOnBodyPartDestroyed");
static_assert(offsetof(Mon_hum_019_C_BPOnBodyPartDestroyed, BodyPartTag) == 0x000000, "Member 'Mon_hum_019_C_BPOnBodyPartDestroyed::BodyPartTag' has a wrong offset!");

}

