#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mon_hum_087_chief

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "MonsterCharacterBP_Base_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass mon_hum_087_chief.mon_hum_087_chief_C
// 0x0020 (0x3B50 - 0x3B30)
class AMon_hum_087_chief_C : public AMonsterCharacterBP_Base_C
{
public:
	uint8                                         Pad_6DEA[0x4];                                     // 0x3B24(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame_Mon_hum_087_chief_C;                // 0x3B28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FVector                                BornLoc;                                           // 0x3B30(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               BornRot;                                           // 0x3B3C(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                          IsOnBox;                                           // 0x3B48(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_mon_hum_087_chief(int32 EntryPoint);
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"mon_hum_087_chief_C">();
	}
	static class AMon_hum_087_chief_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AMon_hum_087_chief_C>();
	}
};
static_assert(alignof(AMon_hum_087_chief_C) == 0x000010, "Wrong alignment on AMon_hum_087_chief_C");
static_assert(sizeof(AMon_hum_087_chief_C) == 0x003B50, "Wrong size on AMon_hum_087_chief_C");
static_assert(offsetof(AMon_hum_087_chief_C, UberGraphFrame_Mon_hum_087_chief_C) == 0x003B28, "Member 'AMon_hum_087_chief_C::UberGraphFrame_Mon_hum_087_chief_C' has a wrong offset!");
static_assert(offsetof(AMon_hum_087_chief_C, BornLoc) == 0x003B30, "Member 'AMon_hum_087_chief_C::BornLoc' has a wrong offset!");
static_assert(offsetof(AMon_hum_087_chief_C, BornRot) == 0x003B3C, "Member 'AMon_hum_087_chief_C::BornRot' has a wrong offset!");
static_assert(offsetof(AMon_hum_087_chief_C, IsOnBox) == 0x003B48, "Member 'AMon_hum_087_chief_C::IsOnBox' has a wrong offset!");

}

