#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mon_hum_031

#include "Basic.hpp"


namespace SDK::Params
{

// Function mon_hum_031.mon_hum_031_C.ExecuteUbergraph_mon_hum_031
// 0x0018 (0x0018 - 0x0000)
struct Mon_hum_031_C_ExecuteUbergraph_mon_hum_031 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Has_Been_Initd_Variable;                   // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_IsClosed_Variable;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CAD[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_RandomFloatInRange_ReturnValue;           // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_NewPercentage;                        // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CAE[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontageEx_ReturnValue;            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mon_hum_031_C_ExecuteUbergraph_mon_hum_031) == 0x000004, "Wrong alignment on Mon_hum_031_C_ExecuteUbergraph_mon_hum_031");
static_assert(sizeof(Mon_hum_031_C_ExecuteUbergraph_mon_hum_031) == 0x000018, "Wrong size on Mon_hum_031_C_ExecuteUbergraph_mon_hum_031");
static_assert(offsetof(Mon_hum_031_C_ExecuteUbergraph_mon_hum_031, EntryPoint) == 0x000000, "Member 'Mon_hum_031_C_ExecuteUbergraph_mon_hum_031::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mon_hum_031_C_ExecuteUbergraph_mon_hum_031, ___bool_Has_Been_Initd_Variable) == 0x000004, "Member 'Mon_hum_031_C_ExecuteUbergraph_mon_hum_031::___bool_Has_Been_Initd_Variable' has a wrong offset!");
static_assert(offsetof(Mon_hum_031_C_ExecuteUbergraph_mon_hum_031, ___bool_IsClosed_Variable) == 0x000005, "Member 'Mon_hum_031_C_ExecuteUbergraph_mon_hum_031::___bool_IsClosed_Variable' has a wrong offset!");
static_assert(offsetof(Mon_hum_031_C_ExecuteUbergraph_mon_hum_031, CallFunc_RandomFloatInRange_ReturnValue) == 0x000008, "Member 'Mon_hum_031_C_ExecuteUbergraph_mon_hum_031::CallFunc_RandomFloatInRange_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_031_C_ExecuteUbergraph_mon_hum_031, K2Node_Event_NewPercentage) == 0x00000C, "Member 'Mon_hum_031_C_ExecuteUbergraph_mon_hum_031::K2Node_Event_NewPercentage' has a wrong offset!");
static_assert(offsetof(Mon_hum_031_C_ExecuteUbergraph_mon_hum_031, CallFunc_Less_FloatFloat_ReturnValue) == 0x000010, "Member 'Mon_hum_031_C_ExecuteUbergraph_mon_hum_031::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_031_C_ExecuteUbergraph_mon_hum_031, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000011, "Member 'Mon_hum_031_C_ExecuteUbergraph_mon_hum_031::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_hum_031_C_ExecuteUbergraph_mon_hum_031, CallFunc_PlayAnimMontageEx_ReturnValue) == 0x000014, "Member 'Mon_hum_031_C_ExecuteUbergraph_mon_hum_031::CallFunc_PlayAnimMontageEx_ReturnValue' has a wrong offset!");

// Function mon_hum_031.mon_hum_031_C.BPOnHPPercentageChanged
// 0x0004 (0x0004 - 0x0000)
struct Mon_hum_031_C_BPOnHPPercentageChanged final
{
public:
	float                                         NewPercentage;                                     // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mon_hum_031_C_BPOnHPPercentageChanged) == 0x000004, "Wrong alignment on Mon_hum_031_C_BPOnHPPercentageChanged");
static_assert(sizeof(Mon_hum_031_C_BPOnHPPercentageChanged) == 0x000004, "Wrong size on Mon_hum_031_C_BPOnHPPercentageChanged");
static_assert(offsetof(Mon_hum_031_C_BPOnHPPercentageChanged, NewPercentage) == 0x000000, "Member 'Mon_hum_031_C_BPOnHPPercentageChanged::NewPercentage' has a wrong offset!");

}

