#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Mon_ele_015

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function mon_ele_015.mon_ele_015_C.ExecuteUbergraph_mon_ele_015
// 0x0140 (0x0140 - 0x0000)
struct Mon_ele_015_C_ExecuteUbergraph_mon_ele_015 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(EElementalAreaType ElementalAreaType)> K2Node_CreateDelegate_OutputDelegate;              // 0x0004(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(EElementalAreaType ElementalAreaType)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0014(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EWeatherState                                 K2Node_CustomEvent_NewWeather;                     // 0x0025(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRainWeather_ReturnValue;                // 0x0026(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ApplyGameplayEffect_ReturnValue;          // 0x0027(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EElementalAreaType                            K2Node_CustomEvent_ElementalAreaType_1;            // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DED[0x1];                                     // 0x002B(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue;  // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EElementalAreaType                            K2Node_CustomEvent_ElementalAreaType;              // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyGameplayEffect_ReturnValue_1;        // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	TDelegate<void(EWeatherState NewWeather)>     K2Node_CreateDelegate_OutputDelegate_2;            // 0x0034(0x0010)(ZeroConstructor, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_1;               // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DEE[0x2];                                     // 0x0046(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1; // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ApplyGameplayEffect_ReturnValue_2;        // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_2;               // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_2;                    // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DEF[0x1];                                     // 0x004F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_ByPlayer;                             // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue_2; // 0x0058(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_3;               // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_3;                    // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF0[0x2];                                     // 0x005E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_Event_HitComp;                              // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_Event_OtherComp;                            // 0x0070(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0078(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF1[0x3];                                     // 0x0079(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_RemoveActiveEffectsWithTags_ReturnValue_3; // 0x007C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0080(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0090(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF2[0x3];                                     // 0x009D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x00A0(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6DF3[0x4];                                     // 0x012C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPhysicsVolume*                     K2Node_DynamicCast_AsQRSLPhysics_Volume;           // 0x0130(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015) == 0x000008, "Wrong alignment on Mon_ele_015_C_ExecuteUbergraph_mon_ele_015");
static_assert(sizeof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015) == 0x000140, "Wrong size on Mon_ele_015_C_ExecuteUbergraph_mon_ele_015");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, EntryPoint) == 0x000000, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::EntryPoint' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_CreateDelegate_OutputDelegate) == 0x000004, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_CreateDelegate_OutputDelegate_1) == 0x000014, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x000024, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_CustomEvent_NewWeather) == 0x000025, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_CustomEvent_NewWeather' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_IsRainWeather_ReturnValue) == 0x000026, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_IsRainWeather_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_ApplyGameplayEffect_ReturnValue) == 0x000027, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_ApplyGameplayEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_SwitchNetMode_OutNetMode) == 0x000028, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_CustomEvent_ElementalAreaType_1) == 0x00002A, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_CustomEvent_ElementalAreaType_1' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_RemoveActiveEffectsWithTags_ReturnValue) == 0x00002C, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_RemoveActiveEffectsWithTags_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000030, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x000031, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_CustomEvent_ElementalAreaType) == 0x000032, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_CustomEvent_ElementalAreaType' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_ApplyGameplayEffect_ReturnValue_1) == 0x000033, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_ApplyGameplayEffect_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_CreateDelegate_OutputDelegate_2) == 0x000034, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_SwitchNetMode_OutNetMode_1) == 0x000044, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_SwitchNetMode_OutNetMode_1' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_SwitchEnum_CmpSuccess_1) == 0x000045, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1) == 0x000048, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_RemoveActiveEffectsWithTags_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_ApplyGameplayEffect_ReturnValue_2) == 0x00004C, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_ApplyGameplayEffect_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_SwitchNetMode_OutNetMode_2) == 0x00004D, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_SwitchNetMode_OutNetMode_2' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_SwitchEnum_CmpSuccess_2) == 0x00004E, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_SwitchEnum_CmpSuccess_2' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_Event_ByPlayer) == 0x000050, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_Event_ByPlayer' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_RemoveActiveEffectsWithTags_ReturnValue_2) == 0x000058, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_RemoveActiveEffectsWithTags_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_SwitchNetMode_OutNetMode_3) == 0x00005C, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_SwitchNetMode_OutNetMode_3' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_SwitchEnum_CmpSuccess_3) == 0x00005D, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_SwitchEnum_CmpSuccess_3' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_Event_HitComp) == 0x000060, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_Event_HitComp' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_Event_OtherActor) == 0x000068, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_Event_OtherComp) == 0x000070, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_Event_OtherComp' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000078, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_RemoveActiveEffectsWithTags_ReturnValue_3) == 0x00007C, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_RemoveActiveEffectsWithTags_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000080, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_ComponentBoundEvent_OtherActor) == 0x000088, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_ComponentBoundEvent_OtherComp) == 0x000090, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000098, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_ComponentBoundEvent_bFromSweep) == 0x00009C, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_ComponentBoundEvent_SweepResult) == 0x0000A0, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_DynamicCast_AsQRSLPhysics_Volume) == 0x000130, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_DynamicCast_AsQRSLPhysics_Volume' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, K2Node_DynamicCast_bSuccess) == 0x000138, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_ExecuteUbergraph_mon_ele_015, CallFunc_EqualEqual_IntInt_ReturnValue_1) == 0x000139, "Member 'Mon_ele_015_C_ExecuteUbergraph_mon_ele_015::CallFunc_EqualEqual_IntInt_ReturnValue_1' has a wrong offset!");

// Function mon_ele_015.mon_ele_015_C.BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DF4[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Mon_ele_015_C_BndEvt__CapsuleComponent_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function mon_ele_015.mon_ele_015_C.BPOnThrowingHit
// 0x0018 (0x0018 - 0x0000)
struct Mon_ele_015_C_BPOnThrowingHit final
{
public:
	class UPrimitiveComponent*                    HitComp;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mon_ele_015_C_BPOnThrowingHit) == 0x000008, "Wrong alignment on Mon_ele_015_C_BPOnThrowingHit");
static_assert(sizeof(Mon_ele_015_C_BPOnThrowingHit) == 0x000018, "Wrong size on Mon_ele_015_C_BPOnThrowingHit");
static_assert(offsetof(Mon_ele_015_C_BPOnThrowingHit, HitComp) == 0x000000, "Member 'Mon_ele_015_C_BPOnThrowingHit::HitComp' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_BPOnThrowingHit, OtherActor) == 0x000008, "Member 'Mon_ele_015_C_BPOnThrowingHit::OtherActor' has a wrong offset!");
static_assert(offsetof(Mon_ele_015_C_BPOnThrowingHit, OtherComp) == 0x000010, "Member 'Mon_ele_015_C_BPOnThrowingHit::OtherComp' has a wrong offset!");

// Function mon_ele_015.mon_ele_015_C.BPOnThrow
// 0x0008 (0x0008 - 0x0000)
struct Mon_ele_015_C_BPOnThrow final
{
public:
	class AHottaPlayerCharacter*                  ByPlayer;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mon_ele_015_C_BPOnThrow) == 0x000008, "Wrong alignment on Mon_ele_015_C_BPOnThrow");
static_assert(sizeof(Mon_ele_015_C_BPOnThrow) == 0x000008, "Wrong size on Mon_ele_015_C_BPOnThrow");
static_assert(offsetof(Mon_ele_015_C_BPOnThrow, ByPlayer) == 0x000000, "Member 'Mon_ele_015_C_BPOnThrow::ByPlayer' has a wrong offset!");

// Function mon_ele_015.mon_ele_015_C.LeaveAreaEffect
// 0x0001 (0x0001 - 0x0000)
struct Mon_ele_015_C_LeaveAreaEffect final
{
public:
	EElementalAreaType                            ElementalAreaType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mon_ele_015_C_LeaveAreaEffect) == 0x000001, "Wrong alignment on Mon_ele_015_C_LeaveAreaEffect");
static_assert(sizeof(Mon_ele_015_C_LeaveAreaEffect) == 0x000001, "Wrong size on Mon_ele_015_C_LeaveAreaEffect");
static_assert(offsetof(Mon_ele_015_C_LeaveAreaEffect, ElementalAreaType) == 0x000000, "Member 'Mon_ele_015_C_LeaveAreaEffect::ElementalAreaType' has a wrong offset!");

// Function mon_ele_015.mon_ele_015_C.ElementAreaEffect
// 0x0001 (0x0001 - 0x0000)
struct Mon_ele_015_C_ElementAreaEffect final
{
public:
	EElementalAreaType                            ElementalAreaType;                                 // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mon_ele_015_C_ElementAreaEffect) == 0x000001, "Wrong alignment on Mon_ele_015_C_ElementAreaEffect");
static_assert(sizeof(Mon_ele_015_C_ElementAreaEffect) == 0x000001, "Wrong size on Mon_ele_015_C_ElementAreaEffect");
static_assert(offsetof(Mon_ele_015_C_ElementAreaEffect, ElementalAreaType) == 0x000000, "Member 'Mon_ele_015_C_ElementAreaEffect::ElementalAreaType' has a wrong offset!");

// Function mon_ele_015.mon_ele_015_C.WeatherEffect
// 0x0001 (0x0001 - 0x0000)
struct Mon_ele_015_C_WeatherEffect final
{
public:
	EWeatherState                                 NewWeather;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Mon_ele_015_C_WeatherEffect) == 0x000001, "Wrong alignment on Mon_ele_015_C_WeatherEffect");
static_assert(sizeof(Mon_ele_015_C_WeatherEffect) == 0x000001, "Wrong size on Mon_ele_015_C_WeatherEffect");
static_assert(offsetof(Mon_ele_015_C_WeatherEffect, NewWeather) == 0x000000, "Member 'Mon_ele_015_C_WeatherEffect::NewWeather' has a wrong offset!");

}

