#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: MrakPhyLevel6_4

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function MrakPhyLevel6_4.MrakPhyLevel6_4_C.CanApplyGameplayEffectContent
// 0x00C0 (0x00C0 - 0x0000)
struct MrakPhyLevel6_4_C_CanApplyGameplayEffectContent final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InstigatorActor;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          IsUsingSkill;                                      // 0x0021(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_True_if_break_was_hit_Variable;            // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5873[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUsingChangeSkill_ReturnValue;           // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5874[0x6];                                     // 0x0032(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeaponBase*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x0041(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue; // 0x0042(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x0043(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue_2;          // 0x0044(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x0045(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0046(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0047(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ___int_Array_Index_Variable;                       // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Loop_Counter_Variable;                      // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue;       // 0x0054(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5875[0x3];                                     // 0x005D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_1;     // 0x0060(0x0008)(NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5876[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTag                           CallFunc_MakeLiteralGameplayTag_ReturnValue_2;     // 0x006C(0x0008)(NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5877[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  CallFunc_MakeGameplayTagContainerFromTag_ReturnValue; // 0x0078(0x0020)()
	TArray<class UHottaSkill*>                    CallFunc_GetActiveAbilitiesWithTags_ActiveSkills;  // 0x0098(0x0010)(ReferenceParm)
	class UHottaSkill*                            CallFunc_Array_Get_Item;                           // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x00B0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_AbilityHasAnyTag_ReturnValue;             // 0x00B4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x00B5(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x00B6(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AbilityHasAnyTag_ReturnValue_1;           // 0x00B7(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x00B8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_AbilityHasAnyTag_ReturnValue_2;           // 0x00B9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x00BA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x00BB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent) == 0x000008, "Wrong alignment on MrakPhyLevel6_4_C_CanApplyGameplayEffectContent");
static_assert(sizeof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent) == 0x0000C0, "Wrong size on MrakPhyLevel6_4_C_CanApplyGameplayEffectContent");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, SourceActor) == 0x000000, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::SourceActor' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, TargetActor) == 0x000008, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::TargetActor' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, InstigatorActor) == 0x000010, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::InstigatorActor' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, GameplayEffect) == 0x000018, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::GameplayEffect' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, ReturnValue) == 0x000020, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, IsUsingSkill) == 0x000021, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::IsUsingSkill' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, ___bool_True_if_break_was_hit_Variable) == 0x000022, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::___bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000028, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_IsUsingChangeSkill_ReturnValue) == 0x000031, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_IsUsingChangeSkill_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000038, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_Not_PreBool_ReturnValue) == 0x000040, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x000041, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue) == 0x000042, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_K2_HaveGameplayEffectWithClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_NotEqual_ByteByte_ReturnValue_1) == 0x000043, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_NotEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_NotEqual_ByteByte_ReturnValue_2) == 0x000044, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_NotEqual_ByteByte_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_Not_PreBool_ReturnValue_1) == 0x000045, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_BooleanAND_ReturnValue) == 0x000046, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_BooleanAND_ReturnValue_1) == 0x000047, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, ___int_Array_Index_Variable) == 0x000048, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, ___int_Loop_Counter_Variable) == 0x00004C, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_Add_IntInt_ReturnValue) == 0x000050, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_MakeLiteralGameplayTag_ReturnValue) == 0x000054, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_MakeLiteralGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_BooleanAND_ReturnValue_2) == 0x00005C, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_BooleanAND_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_MakeLiteralGameplayTag_ReturnValue_1) == 0x000060, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_MakeLiteralGameplayTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_BooleanAND_ReturnValue_3) == 0x000068, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_BooleanAND_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_BooleanAND_ReturnValue_4) == 0x000069, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_BooleanAND_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_MakeLiteralGameplayTag_ReturnValue_2) == 0x00006C, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_MakeLiteralGameplayTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_MakeGameplayTagContainerFromTag_ReturnValue) == 0x000078, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_MakeGameplayTagContainerFromTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_GetActiveAbilitiesWithTags_ActiveSkills) == 0x000098, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_GetActiveAbilitiesWithTags_ActiveSkills' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_Array_Get_Item) == 0x0000A8, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_Array_Length_ReturnValue) == 0x0000B0, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_AbilityHasAnyTag_ReturnValue) == 0x0000B4, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_AbilityHasAnyTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_Less_IntInt_ReturnValue) == 0x0000B5, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_BooleanAND_ReturnValue_5) == 0x0000B6, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_BooleanAND_ReturnValue_5' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_AbilityHasAnyTag_ReturnValue_1) == 0x0000B7, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_AbilityHasAnyTag_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_Not_PreBool_ReturnValue_2) == 0x0000B8, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_AbilityHasAnyTag_ReturnValue_2) == 0x0000B9, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_AbilityHasAnyTag_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_Not_PreBool_ReturnValue_3) == 0x0000BA, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_Not_PreBool_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(MrakPhyLevel6_4_C_CanApplyGameplayEffectContent, CallFunc_BooleanAND_ReturnValue_6) == 0x0000BB, "Member 'MrakPhyLevel6_4_C_CanApplyGameplayEffectContent::CallFunc_BooleanAND_ReturnValue_6' has a wrong offset!");

}

