#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Muzhuang

#include "Basic.hpp"


namespace SDK::Params
{

// Function muzhuang.muzhuang_C.ExecuteUbergraph_muzhuang
// 0x0030 (0x0030 - 0x0000)
struct Muzhuang_C_ExecuteUbergraph_muzhuang final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_555C[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AAIController*                          K2Node_DynamicCast_AsAI___;                        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_555D[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaAIController*                     K2Node_DynamicCast_AsHotta_AIController;           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Muzhuang_C_ExecuteUbergraph_muzhuang) == 0x000008, "Wrong alignment on Muzhuang_C_ExecuteUbergraph_muzhuang");
static_assert(sizeof(Muzhuang_C_ExecuteUbergraph_muzhuang) == 0x000030, "Wrong size on Muzhuang_C_ExecuteUbergraph_muzhuang");
static_assert(offsetof(Muzhuang_C_ExecuteUbergraph_muzhuang, EntryPoint) == 0x000000, "Member 'Muzhuang_C_ExecuteUbergraph_muzhuang::EntryPoint' has a wrong offset!");
static_assert(offsetof(Muzhuang_C_ExecuteUbergraph_muzhuang, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'Muzhuang_C_ExecuteUbergraph_muzhuang::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Muzhuang_C_ExecuteUbergraph_muzhuang, K2Node_DynamicCast_AsAI___) == 0x000010, "Member 'Muzhuang_C_ExecuteUbergraph_muzhuang::K2Node_DynamicCast_AsAI___' has a wrong offset!");
static_assert(offsetof(Muzhuang_C_ExecuteUbergraph_muzhuang, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'Muzhuang_C_ExecuteUbergraph_muzhuang::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Muzhuang_C_ExecuteUbergraph_muzhuang, K2Node_DynamicCast_AsHotta_AIController) == 0x000020, "Member 'Muzhuang_C_ExecuteUbergraph_muzhuang::K2Node_DynamicCast_AsHotta_AIController' has a wrong offset!");
static_assert(offsetof(Muzhuang_C_ExecuteUbergraph_muzhuang, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'Muzhuang_C_ExecuteUbergraph_muzhuang::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

