#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NewPlayQuestFailed_sidequest

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function NewPlayQuestFailed_sidequest.NewPlayQuestFailed_sidequest_C.ExecuteUbergraph_NewPlayQuestFailed_sidequest
// 0x0140 (0x0140 - 0x0000)
struct NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_True_if_break_was_hit_Variable;            // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5687[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable;                       // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5688[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5689[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLHUD*                               CallFunc_GetQRSLHUD_ReturnValue;                   // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerController*                  K2Node_DynamicCast_AsQRSLPlayer_Controller;        // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568A[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568B[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568C[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_Array_Get_Item;                           // 0x0064(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_568D[0x4];                                     // 0x006C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLHUD*                               CallFunc_GetQRSLHUD_ReturnValue_1;                 // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue_1;              // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerController*                  K2Node_DynamicCast_AsQRSLPlayer_Controller_1;      // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SubmitQuest_ReturnValue;                  // 0x0089(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReplaceQuest_ReturnValue;                 // 0x008A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestFailed_ReturnValue;                // 0x008B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x008C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568E[0x3];                                     // 0x008D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0090(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0094(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0095(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_568F[0x2];                                     // 0x0096(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EntryClientGroup_ReturnValue;             // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue;            // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5690[0x6];                                     // 0x00A2(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x00B0(0x0018)()
	bool                                          CallFunc_IsLocalClientRole_ReturnValue_1;          // 0x00C8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EntryClientGroup_ReturnValue_1;           // 0x00C9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5691[0x6];                                     // 0x00CA(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue_1;               // 0x00D0(0x0018)()
	bool                                          ___bool_True_if_break_was_hit_Variable_1;          // 0x00E8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x00E9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5692[0x2];                                     // 0x00EA(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Array_Index_Variable_1;                     // 0x00EC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Array_Get_Item_1;                         // 0x00F0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName& QuestID, bool bCustom)> K2Node_CreateDelegate_OutputDelegate;              // 0x00F8(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue_1;        // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReplaceQuest_ReturnValue_1;               // 0x0109(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SubmitQuest_ReturnValue_1;                // 0x010A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestFailed_ReturnValue_1;              // 0x010B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                         ___int_Loop_Counter_Variable_1;                    // 0x010C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_CustomEvent_QuestID;                        // 0x0110(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bCustom;                        // 0x0118(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x0119(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5693[0x2];                                     // 0x011A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Add_IntInt_ReturnValue_1;                 // 0x011C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0120(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5694[0x7];                                     // 0x0121(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_2;   // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Find_ReturnValue;                   // 0x0130(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0134(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_SubmitQuest_ReturnValue_2;                // 0x0135(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_ReplaceQuest_ReturnValue_2;               // 0x0136(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestFailed_ReturnValue_2;              // 0x0137(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0138(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0139(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_1;               // 0x013A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x013B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest) == 0x000008, "Wrong alignment on NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest");
static_assert(sizeof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest) == 0x000140, "Wrong size on NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, EntryPoint) == 0x000000, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::EntryPoint' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, ___bool_True_if_break_was_hit_Variable) == 0x000004, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::___bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, ___int_Array_Index_Variable) == 0x000008, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Not_PreBool_ReturnValue) == 0x00000C, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_Event_OtherActor_1) == 0x000010, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000018, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Array_Length_ReturnValue) == 0x000024, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_GetQRSLHUD_ReturnValue) == 0x000028, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_GetQRSLHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_GetController_ReturnValue) == 0x000030, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_DynamicCast_AsQRSLPlayer_Controller) == 0x000038, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_DynamicCast_AsQRSLPlayer_Controller' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, ___int_Loop_Counter_Variable) == 0x000044, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Add_IntInt_ReturnValue) == 0x000048, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_Event_OtherActor) == 0x000050, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000058, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_DynamicCast_bSuccess_2) == 0x000060, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Array_Get_Item) == 0x000064, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_GetQRSLHUD_ReturnValue_1) == 0x000070, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_GetQRSLHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_GetController_ReturnValue_1) == 0x000078, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_GetController_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_DynamicCast_AsQRSLPlayer_Controller_1) == 0x000080, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_DynamicCast_AsQRSLPlayer_Controller_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_DynamicCast_bSuccess_3) == 0x000088, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_SubmitQuest_ReturnValue) == 0x000089, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_SubmitQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_ReplaceQuest_ReturnValue) == 0x00008A, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_ReplaceQuest_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_IsQuestFailed_ReturnValue) == 0x00008B, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_IsQuestFailed_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_EqualEqual_NameName_ReturnValue) == 0x00008C, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Array_Length_ReturnValue_1) == 0x000090, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Less_IntInt_ReturnValue) == 0x000094, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_BooleanAND_ReturnValue) == 0x000095, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000098, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_EntryClientGroup_ReturnValue) == 0x0000A0, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_EntryClientGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_IsLocalClientRole_ReturnValue) == 0x0000A1, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_IsLocalClientRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_GetClientPlayerCharacter_ReturnValue_1) == 0x0000A8, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_GetClientPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_GetEmptyText_ReturnValue) == 0x0000B0, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_IsLocalClientRole_ReturnValue_1) == 0x0000C8, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_IsLocalClientRole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_EntryClientGroup_ReturnValue_1) == 0x0000C9, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_EntryClientGroup_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_GetEmptyText_ReturnValue_1) == 0x0000D0, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_GetEmptyText_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, ___bool_True_if_break_was_hit_Variable_1) == 0x0000E8, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::___bool_True_if_break_was_hit_Variable_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Not_PreBool_ReturnValue_1) == 0x0000E9, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, ___int_Array_Index_Variable_1) == 0x0000EC, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::___int_Array_Index_Variable_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Array_Get_Item_1) == 0x0000F0, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Array_Get_Item_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_CreateDelegate_OutputDelegate) == 0x0000F8, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_EqualEqual_NameName_ReturnValue_1) == 0x000108, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_EqualEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_ReplaceQuest_ReturnValue_1) == 0x000109, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_ReplaceQuest_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_SubmitQuest_ReturnValue_1) == 0x00010A, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_SubmitQuest_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_IsQuestFailed_ReturnValue_1) == 0x00010B, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_IsQuestFailed_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, ___int_Loop_Counter_Variable_1) == 0x00010C, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::___int_Loop_Counter_Variable_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_CustomEvent_QuestID) == 0x000110, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_CustomEvent_QuestID' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_CustomEvent_bCustom) == 0x000118, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_CustomEvent_bCustom' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Less_IntInt_ReturnValue_1) == 0x000119, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Add_IntInt_ReturnValue_1) == 0x00011C, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Add_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_BooleanAND_ReturnValue_1) == 0x000120, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_GetClientPlayerCharacter_ReturnValue_2) == 0x000128, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_GetClientPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_Array_Find_ReturnValue) == 0x000130, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_Array_Find_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x000134, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_SubmitQuest_ReturnValue_2) == 0x000135, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_SubmitQuest_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_ReplaceQuest_ReturnValue_2) == 0x000136, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_ReplaceQuest_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_IsQuestFailed_ReturnValue_2) == 0x000137, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_IsQuestFailed_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_SwitchNetMode_OutNetMode) == 0x000138, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_SwitchEnum_CmpSuccess) == 0x000139, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, CallFunc_SwitchNetMode_OutNetMode_1) == 0x00013A, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::CallFunc_SwitchNetMode_OutNetMode_1' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest, K2Node_SwitchEnum_CmpSuccess_1) == 0x00013B, "Member 'NewPlayQuestFailed_sidequest_C_ExecuteUbergraph_NewPlayQuestFailed_sidequest::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");

// Function NewPlayQuestFailed_sidequest.NewPlayQuestFailed_sidequest_C.TrackQusetChange
// 0x000C (0x000C - 0x0000)
struct NewPlayQuestFailed_sidequest_C_TrackQusetChange final
{
public:
	class FName                                   QuestID;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bCustom;                                           // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(NewPlayQuestFailed_sidequest_C_TrackQusetChange) == 0x000004, "Wrong alignment on NewPlayQuestFailed_sidequest_C_TrackQusetChange");
static_assert(sizeof(NewPlayQuestFailed_sidequest_C_TrackQusetChange) == 0x00000C, "Wrong size on NewPlayQuestFailed_sidequest_C_TrackQusetChange");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_TrackQusetChange, QuestID) == 0x000000, "Member 'NewPlayQuestFailed_sidequest_C_TrackQusetChange::QuestID' has a wrong offset!");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_TrackQusetChange, bCustom) == 0x000008, "Member 'NewPlayQuestFailed_sidequest_C_TrackQusetChange::bCustom' has a wrong offset!");

// Function NewPlayQuestFailed_sidequest.NewPlayQuestFailed_sidequest_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct NewPlayQuestFailed_sidequest_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewPlayQuestFailed_sidequest_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on NewPlayQuestFailed_sidequest_C_ReceiveActorEndOverlap");
static_assert(sizeof(NewPlayQuestFailed_sidequest_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on NewPlayQuestFailed_sidequest_C_ReceiveActorEndOverlap");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'NewPlayQuestFailed_sidequest_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function NewPlayQuestFailed_sidequest.NewPlayQuestFailed_sidequest_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct NewPlayQuestFailed_sidequest_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(NewPlayQuestFailed_sidequest_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on NewPlayQuestFailed_sidequest_C_ReceiveActorBeginOverlap");
static_assert(sizeof(NewPlayQuestFailed_sidequest_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on NewPlayQuestFailed_sidequest_C_ReceiveActorBeginOverlap");
static_assert(offsetof(NewPlayQuestFailed_sidequest_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'NewPlayQuestFailed_sidequest_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

