#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: NPC_FeedAnimal_NotWalk_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "BP_DialogueNpcBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass NPC_FeedAnimal_NotWalk_Base.NPC_FeedAnimal_NotWalk_Base_C
// 0x00D0 (0x3BB0 - 0x3AE0)
class ANPC_FeedAnimal_NotWalk_Base_C : public ABP_DialogueNpcBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_NPC_FeedAnimal_NotWalk_Base_C;      // 0x3AD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               Animal_gameplay_food_01;                           // 0x3AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             AnimalFindReward;                                  // 0x3AE8(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FPOI                                   AnimalPOI;                                         // 0x3AF8(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UAnimMontage>            FindPlayerMontage_Soft;                            // 0x3B58(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UAnimMontage>            FindFoodAndRewardMontage_Soft;                     // 0x3B80(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)

public:
	void AnimalFindReward__DelegateSignature();
	void ExecuteUbergraph_NPC_FeedAnimal_NotWalk_Base(int32 EntryPoint);
	void BndEvt__NPC_NeedFood_DialogueCollisionSphere_K2Node_ComponentBoundEvent_1_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BP_OnDialogueEvent(const class FName& EventName);
	void ReceiveTick(float DeltaSeconds);
	void ReceiveBeginPlay();
	void OnLoaded_19B814024E9A0D32C350AE88C8E338AD(class UObject* Loaded);
	void OnLoaded_4FE9A0ED4DDB76C453344DB5558D9F24(class UObject* Loaded);
	void OnCompleted_38E9C4E04B88CDC3C99548BC1A48DF94(class FName NotifyName);
	void OnBlendOut_38E9C4E04B88CDC3C99548BC1A48DF94(class FName NotifyName);
	void OnInterrupted_38E9C4E04B88CDC3C99548BC1A48DF94(class FName NotifyName);
	void OnNotifyBegin_38E9C4E04B88CDC3C99548BC1A48DF94(class FName NotifyName);
	void OnNotifyEnd_38E9C4E04B88CDC3C99548BC1A48DF94(class FName NotifyName);
	void AnimalUseAimOffset(bool Use);
	void ClientAddPOI(class AQRSLPlayerCharacter* Player);
	void ClientDelPOI(class AQRSLPlayerCharacter* Player);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"NPC_FeedAnimal_NotWalk_Base_C">();
	}
	static class ANPC_FeedAnimal_NotWalk_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ANPC_FeedAnimal_NotWalk_Base_C>();
	}
};
static_assert(alignof(ANPC_FeedAnimal_NotWalk_Base_C) == 0x000010, "Wrong alignment on ANPC_FeedAnimal_NotWalk_Base_C");
static_assert(sizeof(ANPC_FeedAnimal_NotWalk_Base_C) == 0x003BB0, "Wrong size on ANPC_FeedAnimal_NotWalk_Base_C");
static_assert(offsetof(ANPC_FeedAnimal_NotWalk_Base_C, UberGraphFrame_NPC_FeedAnimal_NotWalk_Base_C) == 0x003AD8, "Member 'ANPC_FeedAnimal_NotWalk_Base_C::UberGraphFrame_NPC_FeedAnimal_NotWalk_Base_C' has a wrong offset!");
static_assert(offsetof(ANPC_FeedAnimal_NotWalk_Base_C, Animal_gameplay_food_01) == 0x003AE0, "Member 'ANPC_FeedAnimal_NotWalk_Base_C::Animal_gameplay_food_01' has a wrong offset!");
static_assert(offsetof(ANPC_FeedAnimal_NotWalk_Base_C, AnimalFindReward) == 0x003AE8, "Member 'ANPC_FeedAnimal_NotWalk_Base_C::AnimalFindReward' has a wrong offset!");
static_assert(offsetof(ANPC_FeedAnimal_NotWalk_Base_C, AnimalPOI) == 0x003AF8, "Member 'ANPC_FeedAnimal_NotWalk_Base_C::AnimalPOI' has a wrong offset!");
static_assert(offsetof(ANPC_FeedAnimal_NotWalk_Base_C, FindPlayerMontage_Soft) == 0x003B58, "Member 'ANPC_FeedAnimal_NotWalk_Base_C::FindPlayerMontage_Soft' has a wrong offset!");
static_assert(offsetof(ANPC_FeedAnimal_NotWalk_Base_C, FindFoodAndRewardMontage_Soft) == 0x003B80, "Member 'ANPC_FeedAnimal_NotWalk_Base_C::FindFoodAndRewardMontage_Soft' has a wrong offset!");

}

