#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ParticleFlyEffectBall

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass ParticleFlyEffectBall.ParticleFlyEffectBall_C
// 0x0028 (0x02B0 - 0x0288)
class AParticleFlyEffectBall_C : public AFlyBall
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0288(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         Timeline_0_NewTrack_0_2B5C64AD4FE80AD506CDD18E371A9611; // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_2B5C64AD4FE80AD506CDD18E371A9611; // 0x0294(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59B8[0x3];                                     // 0x0295(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x0298(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CurVector;                                         // 0x02A0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_ParticleFlyEffectBall(int32 EntryPoint);
	void BndEvt__ProjectileMovement_K2Node_ComponentBoundEvent_0_OnProjectileBounceDelegate__DelegateSignature(const struct FHitResult& ImpactResult, const struct FVector& ImpactVelocity);
	void Timeline_0__UpdateFunc();
	void Timeline_0__FinishedFunc();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"ParticleFlyEffectBall_C">();
	}
	static class AParticleFlyEffectBall_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AParticleFlyEffectBall_C>();
	}
};
static_assert(alignof(AParticleFlyEffectBall_C) == 0x000008, "Wrong alignment on AParticleFlyEffectBall_C");
static_assert(sizeof(AParticleFlyEffectBall_C) == 0x0002B0, "Wrong size on AParticleFlyEffectBall_C");
static_assert(offsetof(AParticleFlyEffectBall_C, UberGraphFrame) == 0x000288, "Member 'AParticleFlyEffectBall_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AParticleFlyEffectBall_C, Timeline_0_NewTrack_0_2B5C64AD4FE80AD506CDD18E371A9611) == 0x000290, "Member 'AParticleFlyEffectBall_C::Timeline_0_NewTrack_0_2B5C64AD4FE80AD506CDD18E371A9611' has a wrong offset!");
static_assert(offsetof(AParticleFlyEffectBall_C, Timeline_0__Direction_2B5C64AD4FE80AD506CDD18E371A9611) == 0x000294, "Member 'AParticleFlyEffectBall_C::Timeline_0__Direction_2B5C64AD4FE80AD506CDD18E371A9611' has a wrong offset!");
static_assert(offsetof(AParticleFlyEffectBall_C, Timeline_0) == 0x000298, "Member 'AParticleFlyEffectBall_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AParticleFlyEffectBall_C, CurVector) == 0x0002A0, "Member 'AParticleFlyEffectBall_C::CurVector' has a wrong offset!");

}

