#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayTriggerEffectConfig

#include "Basic.hpp"


namespace SDK
{

// UserDefinedStruct PlayTriggerEffectConfig.PlayTriggerEffectConfig
// 0x0020 (0x0020 - 0x0000)
struct FPlayTriggerEffectConfig final
{
public:
	int32                                         TriggerMask_2_0984BD7E4E6A5BFA903E3E8A8AC0F0F6;    // 0x0000(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Mode_4_DA418A72414719CB4B99D1BFF30DDB83;           // 0x0004(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Position_6_01B10ABC477EBB25EBAED089744190AB;       // 0x0008(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Amplitude_8_EB58753248BB804174B953B681E971E6;      // 0x000C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Frequency_11_C2B686D948482141AB8768A2D50F2DD0;     // 0x0010(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EndPosition_12_142570FA45B4DA6125BB3183E6CC8B2C;   // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         StartStrength_14_9C5051C046C470BF7B40ACAD76E96594; // 0x0018(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         EndStrength_16_1A568D6A405DC9C5704E1A81602DCE14;   // 0x001C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(FPlayTriggerEffectConfig) == 0x000004, "Wrong alignment on FPlayTriggerEffectConfig");
static_assert(sizeof(FPlayTriggerEffectConfig) == 0x000020, "Wrong size on FPlayTriggerEffectConfig");
static_assert(offsetof(FPlayTriggerEffectConfig, TriggerMask_2_0984BD7E4E6A5BFA903E3E8A8AC0F0F6) == 0x000000, "Member 'FPlayTriggerEffectConfig::TriggerMask_2_0984BD7E4E6A5BFA903E3E8A8AC0F0F6' has a wrong offset!");
static_assert(offsetof(FPlayTriggerEffectConfig, Mode_4_DA418A72414719CB4B99D1BFF30DDB83) == 0x000004, "Member 'FPlayTriggerEffectConfig::Mode_4_DA418A72414719CB4B99D1BFF30DDB83' has a wrong offset!");
static_assert(offsetof(FPlayTriggerEffectConfig, Position_6_01B10ABC477EBB25EBAED089744190AB) == 0x000008, "Member 'FPlayTriggerEffectConfig::Position_6_01B10ABC477EBB25EBAED089744190AB' has a wrong offset!");
static_assert(offsetof(FPlayTriggerEffectConfig, Amplitude_8_EB58753248BB804174B953B681E971E6) == 0x00000C, "Member 'FPlayTriggerEffectConfig::Amplitude_8_EB58753248BB804174B953B681E971E6' has a wrong offset!");
static_assert(offsetof(FPlayTriggerEffectConfig, Frequency_11_C2B686D948482141AB8768A2D50F2DD0) == 0x000010, "Member 'FPlayTriggerEffectConfig::Frequency_11_C2B686D948482141AB8768A2D50F2DD0' has a wrong offset!");
static_assert(offsetof(FPlayTriggerEffectConfig, EndPosition_12_142570FA45B4DA6125BB3183E6CC8B2C) == 0x000014, "Member 'FPlayTriggerEffectConfig::EndPosition_12_142570FA45B4DA6125BB3183E6CC8B2C' has a wrong offset!");
static_assert(offsetof(FPlayTriggerEffectConfig, StartStrength_14_9C5051C046C470BF7B40ACAD76E96594) == 0x000018, "Member 'FPlayTriggerEffectConfig::StartStrength_14_9C5051C046C470BF7B40ACAD76E96594' has a wrong offset!");
static_assert(offsetof(FPlayTriggerEffectConfig, EndStrength_16_1A568D6A405DC9C5704E1A81602DCE14) == 0x00001C, "Member 'FPlayTriggerEffectConfig::EndStrength_16_1A568D6A405DC9C5704E1A81602DCE14' has a wrong offset!");

}

