#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: PlayTriggerEffect

#include "Basic.hpp"


namespace SDK::Params
{

// Function PlayTriggerEffect.PlayTriggerEffect_C.Received_NotifyBegin
// 0x0040 (0x0040 - 0x0000)
struct PlayTriggerEffect_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0015(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1A[0x2];                                     // 0x0016(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAimming_ReturnValue;                    // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1B[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UQRSLHandleOperationManager*            CallFunc_K2_GetHandleOperatorManager_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsClientOrStandalone_ReturnValue;         // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayTriggerEffect_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on PlayTriggerEffect_C_Received_NotifyBegin");
static_assert(sizeof(PlayTriggerEffect_C_Received_NotifyBegin) == 0x000040, "Wrong size on PlayTriggerEffect_C_Received_NotifyBegin");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000015, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000020, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, CallFunc_IsAimming_ReturnValue) == 0x000029, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::CallFunc_IsAimming_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, CallFunc_K2_GetHandleOperatorManager_ReturnValue) == 0x000030, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::CallFunc_K2_GetHandleOperatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue_1) == 0x000038, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, CallFunc_IsClientOrStandalone_ReturnValue) == 0x000039, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::CallFunc_IsClientOrStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, CallFunc_BooleanAND_ReturnValue) == 0x00003A, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyBegin, CallFunc_BooleanAND_ReturnValue_1) == 0x00003B, "Member 'PlayTriggerEffect_C_Received_NotifyBegin::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

// Function PlayTriggerEffect.PlayTriggerEffect_C.Received_NotifyEnd
// 0x0040 (0x0040 - 0x0000)
struct PlayTriggerEffect_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1C[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsAimming_ReturnValue;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E1D[0x5];                                     // 0x002B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class UQRSLHandleOperationManager*            CallFunc_K2_GetHandleOperatorManager_ReturnValue;  // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsClientOrStandalone_ReturnValue;         // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayTriggerEffect_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on PlayTriggerEffect_C_Received_NotifyEnd");
static_assert(sizeof(PlayTriggerEffect_C_Received_NotifyEnd) == 0x000040, "Wrong size on PlayTriggerEffect_C_Received_NotifyEnd");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000020, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, CallFunc_IsValid_ReturnValue) == 0x000029, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, CallFunc_IsAimming_ReturnValue) == 0x00002A, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::CallFunc_IsAimming_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, CallFunc_K2_GetHandleOperatorManager_ReturnValue) == 0x000030, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::CallFunc_K2_GetHandleOperatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, CallFunc_IsClientOrStandalone_ReturnValue) == 0x000038, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::CallFunc_IsClientOrStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyEnd, CallFunc_BooleanAND_ReturnValue) == 0x000039, "Member 'PlayTriggerEffect_C_Received_NotifyEnd::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");

// Function PlayTriggerEffect.PlayTriggerEffect_C.Received_NotifyTick
// 0x0018 (0x0018 - 0x0000)
struct PlayTriggerEffect_C_Received_NotifyTick final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         FrameDeltaTime;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(PlayTriggerEffect_C_Received_NotifyTick) == 0x000008, "Wrong alignment on PlayTriggerEffect_C_Received_NotifyTick");
static_assert(sizeof(PlayTriggerEffect_C_Received_NotifyTick) == 0x000018, "Wrong size on PlayTriggerEffect_C_Received_NotifyTick");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyTick, MeshComp) == 0x000000, "Member 'PlayTriggerEffect_C_Received_NotifyTick::MeshComp' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyTick, Animation) == 0x000008, "Member 'PlayTriggerEffect_C_Received_NotifyTick::Animation' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyTick, FrameDeltaTime) == 0x000010, "Member 'PlayTriggerEffect_C_Received_NotifyTick::FrameDeltaTime' has a wrong offset!");
static_assert(offsetof(PlayTriggerEffect_C_Received_NotifyTick, ReturnValue) == 0x000014, "Member 'PlayTriggerEffect_C_Received_NotifyTick::ReturnValue' has a wrong offset!");

}

