#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: QRSLPlayerAnimBase

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "KawaiiPhysics_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "QRSL_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass QRSLPlayerAnimBase.QRSLPlayerAnimBase_C
// 0x1F870 (0x20BA0 - 0x1330)
class UQRSLPlayerAnimBase_C : public UQRSLAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1330(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_47;                   // 0x1338(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_46;                   // 0x1490(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_186;                // 0x15E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_185;                // 0x1610(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_184;                // 0x1638(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_183;                // 0x1660(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_182;                // 0x1688(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_181;                // 0x16B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_180;                // 0x16D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_179;                // 0x1700(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_74;                    // 0x1728(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_93;                      // 0x1750(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_73;                    // 0x1780(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_92;                      // 0x17A8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_72;                    // 0x17D8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_91;                      // 0x1800(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_71;                    // 0x1830(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_90;                      // 0x1858(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_70;                    // 0x1888(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_89;                      // 0x18B0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_11;                     // 0x18E0(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_69;                    // 0x1990(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_68;                    // 0x19B8(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_72;                  // 0x19E0(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_45;                   // 0x1A80(0x0158)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_4;                     // 0x1BD8(0x00C8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_54;                 // 0x1CA0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_71;                  // 0x1D88(0x00A0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_56;                       // 0x1E28(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_14;            // 0x1F30(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_14;            // 0x1F50(0x0020)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_67;                    // 0x1F70(0x0028)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_15;                  // 0x1F98(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_44;                   // 0x20B0(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_14;                  // 0x2208(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_43;                   // 0x2320(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_70;                  // 0x2478(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_53;                 // 0x2518(0x00E8)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2;                              // 0x2600(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_13;                  // 0x2630(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_12;                  // 0x2748(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_42;                   // 0x2860(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_41;                   // 0x29B8(0x0158)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_178;                // 0x2B10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_177;                // 0x2B38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_176;                // 0x2B60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_175;                // 0x2B88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_174;                // 0x2BB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_173;                // 0x2BD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_172;                // 0x2C00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_171;                // 0x2C28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_170;                // 0x2C50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_169;                // 0x2C78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_168;                // 0x2CA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_167;                // 0x2CC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_166;                // 0x2CF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_165;                // 0x2D18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_164;                // 0x2D40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_163;                // 0x2D68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_162;                // 0x2D90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_161;                // 0x2DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_160;                // 0x2DE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_159;                // 0x2E08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_158;                // 0x2E30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_157;                // 0x2E58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_156;                // 0x2E80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_155;                // 0x2EA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_154;                // 0x2ED0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_153;                // 0x2EF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_152;                // 0x2F20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_151;                // 0x2F48(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_69;                  // 0x2F70(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_52;                 // 0x3010(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_51;                 // 0x30F8(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_88;                      // 0x31E0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_66;                    // 0x3210(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_87;                      // 0x3238(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_65;                    // 0x3268(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_86;                      // 0x3290(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_83;                   // 0x32C0(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_68;                  // 0x3340(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_82;                   // 0x33E0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_85;                      // 0x3460(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_64;                    // 0x3490(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_84;                      // 0x34B8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_81;                   // 0x34E8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_83;                      // 0x3568(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_63;                    // 0x3598(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_82;                      // 0x35C0(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_62;                    // 0x35F0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_81;                      // 0x3618(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_61;                    // 0x3648(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_80;                      // 0x3670(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_60;                    // 0x36A0(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_79;                      // 0x36C8(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_59;                    // 0x36F8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_78;                      // 0x3720(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_58;                    // 0x3750(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_77;                      // 0x3778(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_80;                   // 0x37A8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_76;                      // 0x3828(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_57;                    // 0x3858(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_75;                      // 0x3880(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_10;                     // 0x38B0(0x00B0)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_11;                  // 0x3960(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_10;                  // 0x3A78(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_9;                   // 0x3B90(0x0118)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_8;                   // 0x3CA8(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_40;                   // 0x3DC0(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_39;                   // 0x3F18(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_38;                   // 0x4070(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_37;                   // 0x41C8(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_7;                   // 0x4320(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_36;                   // 0x4438(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_6;                   // 0x4590(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_35;                   // 0x46A8(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_5;                   // 0x4800(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_34;                   // 0x4918(0x0158)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose_4;                   // 0x4A70(0x0118)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_33;                   // 0x4B88(0x0158)()
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x4CE0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_150;                // 0x4D10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_149;                // 0x4D38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_148;                // 0x4D60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_147;                // 0x4D88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_146;                // 0x4DB0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_145;                // 0x4DD8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_144;                // 0x4E00(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_143;                // 0x4E28(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_142;                // 0x4E50(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_141;                // 0x4E78(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_140;                // 0x4EA0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_139;                // 0x4EC8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_138;                // 0x4EF0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_137;                // 0x4F18(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_136;                // 0x4F40(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_135;                // 0x4F68(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_134;                // 0x4F90(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_133;                // 0x4FB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_132;                // 0x4FE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_131;                // 0x5008(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_130;                // 0x5030(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_129;                // 0x5058(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_128;                // 0x5080(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_127;                // 0x50A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_126;                // 0x50D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_125;                // 0x50F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_124;                // 0x5120(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_123;                // 0x5148(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_122;                // 0x5170(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_121;                // 0x5198(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_120;                // 0x51C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_119;                // 0x51E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_118;                // 0x5210(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_117;                // 0x5238(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_116;                // 0x5260(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_115;                // 0x5288(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_114;                // 0x52B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_113;                // 0x52D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_112;                // 0x5300(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_111;                // 0x5328(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_110;                // 0x5350(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_109;                // 0x5378(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_108;                // 0x53A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_107;                // 0x53C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_106;                // 0x53F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_105;                // 0x5418(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_104;                // 0x5440(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_103;                // 0x5468(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_102;                // 0x5490(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_101;                // 0x54B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_100;                // 0x54E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_99;                 // 0x5508(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_98;                 // 0x5530(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_97;                 // 0x5558(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_96;                 // 0x5580(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_95;                 // 0x55A8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_94;                 // 0x55D0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_93;                 // 0x55F8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_92;                 // 0x5620(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_91;                 // 0x5648(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_90;                 // 0x5670(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_89;                 // 0x5698(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_88;                 // 0x56C0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_87;                 // 0x56E8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_86;                 // 0x5710(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_85;                 // 0x5738(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_84;                 // 0x5760(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_83;                 // 0x5788(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_82;                 // 0x57B0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_81;                 // 0x57D8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_80;                 // 0x5800(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_79;                 // 0x5828(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_78;                 // 0x5850(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_77;                 // 0x5878(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_76;                 // 0x58A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_75;                 // 0x58C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_74;                 // 0x58F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_73;                 // 0x5918(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_72;                 // 0x5940(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_71;                 // 0x5968(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_70;                 // 0x5990(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_69;                 // 0x59B8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_68;                 // 0x59E0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_67;                 // 0x5A08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_66;                 // 0x5A30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_65;                 // 0x5A58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_64;                 // 0x5A80(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_63;                 // 0x5AA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_62;                 // 0x5AD0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_61;                 // 0x5AF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_60;                 // 0x5B20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_59;                 // 0x5B48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_58;                 // 0x5B70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_57;                 // 0x5B98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_56;                 // 0x5BC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_55;                 // 0x5BE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_54;                 // 0x5C10(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_53;                 // 0x5C38(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_52;                 // 0x5C60(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_51;                 // 0x5C88(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_50;                 // 0x5CB0(0x0028)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_4;                   // 0x5CD8(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_74;                      // 0x5D78(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_50;                 // 0x5DA8(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_73;                      // 0x5E90(0x0030)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_3;                   // 0x5EC0(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_72;                      // 0x5F60(0x0030)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_2;                   // 0x5F90(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_71;                      // 0x6030(0x0030)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph_1;                   // 0x6060(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_70;                      // 0x6100(0x0030)()
	struct FAnimNode_Inertialization              AnimGraphNode_Inertialization_1;                   // 0x6130(0x0070)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_49;                 // 0x61A0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_48;                 // 0x61C8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_47;                 // 0x61F0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_46;                 // 0x6218(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_45;                 // 0x6240(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_44;                 // 0x6268(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_43;                 // 0x6290(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_42;                 // 0x62B8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_69;                      // 0x62E0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_79;                   // 0x6310(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_68;                      // 0x6390(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_78;                   // 0x63C0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_67;                      // 0x6440(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_9;                      // 0x6470(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_66;                      // 0x6520(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_49;                 // 0x6550(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_48;                 // 0x6638(0x00E8)()
	struct FAnimNode_ApplyAdditive                AnimGraphNode_ApplyAdditive_3;                     // 0x6720(0x00C8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_65;                      // 0x67E8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_47;                 // 0x6818(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_64;                      // 0x6900(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_46;                 // 0x6930(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_63;                      // 0x6A18(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_8;                      // 0x6A48(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_62;                      // 0x6AF8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_77;                   // 0x6B28(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_61;                      // 0x6BA8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_76;                   // 0x6BD8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_75;                   // 0x6C58(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_74;                   // 0x6CD8(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_3;                    // 0x6D58(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_73;                   // 0x6DF8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_60;                      // 0x6E78(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_41;                 // 0x6EA8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_40;                 // 0x6ED0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_39;                 // 0x6EF8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_38;                 // 0x6F20(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_37;                 // 0x6F48(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_36;                 // 0x6F70(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_35;                 // 0x6F98(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_34;                 // 0x6FC0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_33;                 // 0x6FE8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_32;                 // 0x7010(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_72;                   // 0x7038(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_59;                      // 0x70B8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_71;                   // 0x70E8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_58;                      // 0x7168(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_70;                   // 0x7198(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_57;                      // 0x7218(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_69;                   // 0x7248(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_56;                      // 0x72C8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_45;                 // 0x72F8(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_67;                  // 0x73E0(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_44;                 // 0x7480(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_55;                      // 0x7568(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_68;                   // 0x7598(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_54;                      // 0x7618(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_43;                 // 0x7648(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_66;                  // 0x7730(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_42;                 // 0x77D0(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_53;                      // 0x78B8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_7;                      // 0x78E8(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_52;                      // 0x7998(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_41;                 // 0x79C8(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_51;                      // 0x7AB0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_40;                 // 0x7AE0(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_50;                      // 0x7BC8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_39;                 // 0x7BF8(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_49;                      // 0x7CE0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_38;                 // 0x7D10(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_48;                      // 0x7DF8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_67;                   // 0x7E28(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_65;                  // 0x7EA8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_66;                   // 0x7F48(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_64;                  // 0x7FC8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_65;                   // 0x8068(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_63;                  // 0x80E8(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_62;                  // 0x8188(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_56;                    // 0x8228(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_64;                   // 0x8250(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_47;                      // 0x82D0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_31;                 // 0x8300(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_30;                 // 0x8328(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_46;                      // 0x8350(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_63;                   // 0x8380(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_45;                      // 0x8400(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_61;                  // 0x8430(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_62;                   // 0x84D0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_61;                   // 0x8550(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_44;                      // 0x85D0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_6;                      // 0x8600(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_43;                      // 0x86B0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_29;                 // 0x86E0(0x0028)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_37;                 // 0x8708(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_42;                      // 0x87F0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_36;                 // 0x8820(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_41;                      // 0x8908(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_60;                   // 0x8938(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_40;                      // 0x89B8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_35;                 // 0x89E8(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_39;                      // 0x8AD0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_59;                   // 0x8B00(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_38;                      // 0x8B80(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_55;                    // 0x8BB0(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_60;                  // 0x8BD8(0x00A0)()
	struct FAnimNode_LinkedAnimGraph              AnimGraphNode_LinkedAnimGraph;                     // 0x8C78(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_59;                  // 0x8D18(0x00A0)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_28;                 // 0x8DB8(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_27;                 // 0x8DE0(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_26;                 // 0x8E08(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_25;                 // 0x8E30(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_24;                 // 0x8E58(0x0028)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_23;                 // 0x8E80(0x0028)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_58;                  // 0x8EA8(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_34;                 // 0x8F48(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_33;                 // 0x9030(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_37;                      // 0x9118(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_57;                  // 0x9148(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_58;                   // 0x91E8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_57;                   // 0x9268(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_36;                      // 0x92E8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_32;                 // 0x9318(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_35;                      // 0x9400(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_5;                      // 0x9430(0x00B0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_34;                      // 0x94E0(0x0030)()
	struct FAnimNode_TransitionResult             AnimGraphNode_TransitionResult_22;                 // 0x9510(0x0028)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_56;                   // 0x9538(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_56;                  // 0x95B8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_55;                   // 0x9658(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_33;                      // 0x96D8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_31;                 // 0x9708(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_32;                      // 0x97F0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_54;                   // 0x9820(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_31;                      // 0x98A0(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_53;                   // 0x98D0(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_30;                      // 0x9950(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_52;                   // 0x9980(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_29;                      // 0x9A00(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_30;                 // 0x9A30(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_28;                      // 0x9B18(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_29;                 // 0x9B48(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_55;                  // 0x9C30(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_28;                 // 0x9CD0(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_27;                 // 0x9DB8(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_54;                  // 0x9EA0(0x00A0)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_53;                  // 0x9F40(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_26;                 // 0x9FE0(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_52;                  // 0xA0C8(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_25;                 // 0xA168(0x00E8)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_24;                 // 0xA250(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_51;                  // 0xA338(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_27;                      // 0xA3D8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_51;                   // 0xA408(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_50;                   // 0xA488(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_49;                   // 0xA508(0x0080)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_2;                    // 0xA588(0x00A0)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_26;                      // 0xA628(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_50;                  // 0xA658(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48;                   // 0xA6F8(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_47;                   // 0xA778(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_25;                      // 0xA7F8(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_23;                 // 0xA828(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_24;                      // 0xA910(0x0030)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_49;                  // 0xA940(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_46;                   // 0xA9E0(0x0080)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_45;                   // 0xAA60(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_23;                      // 0xAAE0(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_22;                 // 0xAB10(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_22;                      // 0xABF8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_44;                   // 0xAC28(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_21;                      // 0xACA8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_43;                   // 0xACD8(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_48;                  // 0xAD58(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_42;                   // 0xADF8(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_20;                      // 0xAE78(0x0030)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_21;                 // 0xAEA8(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_47;                  // 0xAF90(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_20;                 // 0xB030(0x00E8)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_19;                      // 0xB118(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_41;                   // 0xB148(0x0080)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_46;                  // 0xB1C8(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_40;                   // 0xB268(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_18;                      // 0xB2E8(0x0030)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_39;                   // 0xB318(0x0080)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_17;                      // 0xB398(0x0030)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_54;                    // 0xB3C8(0x0028)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_16;                      // 0xB3F0(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_4;                      // 0xB420(0x00B0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_32;                   // 0xB4D0(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_13;            // 0xB628(0x0020)()
	uint8                                         Pad_5830[0x8];                                     // 0xB648(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_20;                        // 0xB650(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_19;                        // 0xB830(0x01E0)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_55;                       // 0xBA10(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_54;                       // 0xBB18(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_53;                       // 0xBC20(0x0108)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_13;            // 0xBD28(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_31;                   // 0xBD48(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_9;                              // 0xBEA0(0x0048)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_12;            // 0xBEE8(0x0020)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_30;                   // 0xBF08(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_29;                   // 0xC060(0x0158)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_8;                              // 0xC1B8(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_28;                   // 0xC200(0x0158)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_3;                  // 0xC358(0x00C0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_53;                    // 0xC418(0x0028)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_27;                   // 0xC440(0x0158)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_45;                  // 0xC598(0x00A0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_52;                    // 0xC638(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7;                              // 0xC660(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_26;                   // 0xC6A8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_51;                    // 0xC800(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_6;                              // 0xC828(0x0048)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_25;                   // 0xC870(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_50;                    // 0xC9C8(0x0028)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_2;                  // 0xC9F0(0x00C0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_18;                        // 0xCAB0(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_17;                        // 0xCC90(0x01E0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_49;                    // 0xCE70(0x0028)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_12;            // 0xCE98(0x0020)()
	uint8                                         Pad_5831[0x8];                                     // 0xCEB8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_16;                        // 0xCEC0(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_15;                        // 0xD0A0(0x01E0)()
	struct FAnimNode_TwoBoneIK                    AnimGraphNode_TwoBoneIK_14;                        // 0xD280(0x01E0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_24;                   // 0xD460(0x0158)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_11;            // 0xD5B8(0x0020)()
	struct FAnimNode_RotationOffsetBlendSpace     AnimGraphNode_RotationOffsetBlendSpace_5;          // 0xD5D8(0x0190)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_44;                  // 0xD768(0x00A0)()
	struct FAnimNode_BlendSpacePlayer             AnimGraphNode_BlendSpacePlayer_19;                 // 0xD808(0x00E8)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_43;                  // 0xD8F0(0x00A0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_38;                   // 0xD990(0x0080)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_23;                   // 0xDA10(0x0158)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_11;            // 0xDB68(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_52;                       // 0xDB88(0x0108)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_22;                   // 0xDC90(0x0158)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_21;                   // 0xDDE8(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_48;                    // 0xDF40(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_47;                    // 0xDF68(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_51;                       // 0xDF90(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_50;                       // 0xE098(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_49;                       // 0xE1A0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_48;                       // 0xE2A8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_47;                       // 0xE3B0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_46;                       // 0xE4B8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_45;                       // 0xE5C0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_44;                       // 0xE6C8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_43;                       // 0xE7D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_42;                       // 0xE8D8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_41;                       // 0xE9E0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_40;                       // 0xEAE8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_39;                       // 0xEBF0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_38;                       // 0xECF8(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_37;                       // 0xEE00(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_36;                       // 0xEF08(0x0108)()
	struct FAnimNode_BlendListByBool              AnimGraphNode_BlendListByBool_42;                  // 0xF010(0x00A0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_20;                   // 0xF0B0(0x0158)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_46;                    // 0xF208(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_45;                    // 0xF230(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_44;                    // 0xF258(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_43;                    // 0xF280(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_42;                    // 0xF2A8(0x0028)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_35;                       // 0xF2D0(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_34;                       // 0xF3D8(0x0108)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_25;                    // 0xF4E0(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_24;                    // 0xF800(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_23;                    // 0xFB20(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_22;                    // 0xFE40(0x0320)()
	struct FAnimNode_KawaiiPhysics                AnimGraphNode_KawaiiPhysics_21;                    // 0x10160(0x0320)()
