#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: ReplicatedSublevelInstances

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK
{

// ScriptStruct ReplicatedSublevelInstances.LevelStreamInstanceInfo
// 0x0030 (0x0030 - 0x0000)
struct FLevelStreamInstanceInfo final
{
public:
	class FName                                   PackageName;                                       // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                   PackageNameToLoad;                                 // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                                Location;                                          // 0x0010(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                               Rotation;                                          // 0x001C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                         bShouldBeLoaded : 1;                               // 0x0028(0x0001)(BitIndex: 0x00, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldBeVisible : 1;                              // 0x0028(0x0001)(BitIndex: 0x01, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         bShouldBlockOnLoad : 1;                            // 0x0028(0x0001)(BitIndex: 0x02, PropSize: 0x0001 (NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic))
	uint8                                         Pad_E91[0x3];                                      // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         LODIndex;                                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(FLevelStreamInstanceInfo) == 0x000004, "Wrong alignment on FLevelStreamInstanceInfo");
static_assert(sizeof(FLevelStreamInstanceInfo) == 0x000030, "Wrong size on FLevelStreamInstanceInfo");
static_assert(offsetof(FLevelStreamInstanceInfo, PackageName) == 0x000000, "Member 'FLevelStreamInstanceInfo::PackageName' has a wrong offset!");
static_assert(offsetof(FLevelStreamInstanceInfo, PackageNameToLoad) == 0x000008, "Member 'FLevelStreamInstanceInfo::PackageNameToLoad' has a wrong offset!");
static_assert(offsetof(FLevelStreamInstanceInfo, Location) == 0x000010, "Member 'FLevelStreamInstanceInfo::Location' has a wrong offset!");
static_assert(offsetof(FLevelStreamInstanceInfo, Rotation) == 0x00001C, "Member 'FLevelStreamInstanceInfo::Rotation' has a wrong offset!");
static_assert(offsetof(FLevelStreamInstanceInfo, LODIndex) == 0x00002C, "Member 'FLevelStreamInstanceInfo::LODIndex' has a wrong offset!");

}

