#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scanner_honeybee

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "BP_DialogueNpcBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Scanner_honeybee.Scanner_honeybee_C
// 0x0130 (0x3C10 - 0x3AE0)
class AScanner_honeybee_C final : public ABP_DialogueNpcBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Scanner_honeybee_C;                 // 0x3AD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          GuideTriggerBox;                                   // 0x3AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x3AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere_on_stop;                                    // 0x3AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x3AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 Out_Interact_Entries;                              // 0x3B00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsOn;                                              // 0x3B10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D02[0x7];                                     // 0x3B11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Begin;                                             // 0x3B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Idle;                                              // 0x3B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Chibang;                                           // 0x3B28(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Diedie;                                            // 0x3B50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsOver;                                            // 0x3B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D03[0x7];                                     // 0x3B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPOI                                   AnimalPOI;                                         // 0x3B80(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x3BE0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAnimSequence*                          Scanning;                                          // 0x3C08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Scanner_honeybee(int32 EntryPoint);
	void BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void ReceiveBeginPlay();
	void Scanner_honeybee_EndReward();
	void Scanner_honeybee_Reward();
	void BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPInteractFinished(class AHottaPlayerController* ByPC, int32 InteractIndex);
	void OnLoaded_A3F656AA4ED4AA4238B117B50D55DBB6(class UObject* Loaded);
	void OnLoaded_D5E6C120460EB956E7FEF29778BC63AB(class UObject* Loaded);
	void BPGetInteractEntries(class AHottaPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void ClientAddPOI_Scanner_Base(class AQRSLPlayerCharacter* Play);
	void ClientDelPOI_Scanner_Base(class AQRSLPlayerCharacter* Play);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Scanner_honeybee_C">();
	}
	static class AScanner_honeybee_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AScanner_honeybee_C>();
	}
};
static_assert(alignof(AScanner_honeybee_C) == 0x000010, "Wrong alignment on AScanner_honeybee_C");
static_assert(sizeof(AScanner_honeybee_C) == 0x003C10, "Wrong size on AScanner_honeybee_C");
static_assert(offsetof(AScanner_honeybee_C, UberGraphFrame_Scanner_honeybee_C) == 0x003AD8, "Member 'AScanner_honeybee_C::UberGraphFrame_Scanner_honeybee_C' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, GuideTriggerBox) == 0x003AE0, "Member 'AScanner_honeybee_C::GuideTriggerBox' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, ParticleSystem) == 0x003AE8, "Member 'AScanner_honeybee_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, Sphere_on_stop) == 0x003AF0, "Member 'AScanner_honeybee_C::Sphere_on_stop' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, Sphere) == 0x003AF8, "Member 'AScanner_honeybee_C::Sphere' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, Out_Interact_Entries) == 0x003B00, "Member 'AScanner_honeybee_C::Out_Interact_Entries' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, IsOn) == 0x003B10, "Member 'AScanner_honeybee_C::IsOn' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, Begin) == 0x003B18, "Member 'AScanner_honeybee_C::Begin' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, Idle) == 0x003B20, "Member 'AScanner_honeybee_C::Idle' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, Chibang) == 0x003B28, "Member 'AScanner_honeybee_C::Chibang' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, Diedie) == 0x003B50, "Member 'AScanner_honeybee_C::Diedie' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, IsOver) == 0x003B78, "Member 'AScanner_honeybee_C::IsOver' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, AnimalPOI) == 0x003B80, "Member 'AScanner_honeybee_C::AnimalPOI' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, Asset) == 0x003BE0, "Member 'AScanner_honeybee_C::Asset' has a wrong offset!");
static_assert(offsetof(AScanner_honeybee_C, Scanning) == 0x003C08, "Member 'AScanner_honeybee_C::Scanning' has a wrong offset!");

}

