#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scanner_honeybee

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Scanner_honeybee.Scanner_honeybee_C.ExecuteUbergraph_Scanner_honeybee
// 0x0260 (0x0260 - 0x0000)
struct Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D04[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ___object_Variable;                                // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_As____;                         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D05[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ___object_Variable_1;                              // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_As_____1;                       // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D06[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerController*                 K2Node_Event_ByPC;                                 // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D07[0x4];                                     // 0x0054(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x0058(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x0068(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x0070(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D08[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0078(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6D09[0x4];                                     // 0x0104(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x0108(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0110(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0118(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0120(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6D0A[0x4];                                     // 0x0124(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D0B[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0140(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0141(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0142(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D0C[0x5];                                     // 0x0143(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0148(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0150(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D0D[0x3];                                     // 0x0151(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x0154(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6D0E[0x4];                                     // 0x0164(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_1;   // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0170(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D0F[0x3];                                     // 0x0171(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x0174(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0184(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocationEx_ReturnValue;     // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0198(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x01A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x01A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x01B0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x01B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x01BC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D10[0x3];                                     // 0x01BD(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x01C0(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_6D11[0x4];                                     // 0x024C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_2;       // 0x0250(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0258(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee) == 0x000008, "Wrong alignment on Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee");
static_assert(sizeof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee) == 0x000260, "Wrong size on Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, EntryPoint) == 0x000000, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::EntryPoint' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_CustomEvent_Loaded_1) == 0x000008, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, ___object_Variable) == 0x000010, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::___object_Variable' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_DynamicCast_As____) == 0x000018, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_CustomEvent_Loaded) == 0x000028, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, ___object_Variable_1) == 0x000030, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::___object_Variable_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_DynamicCast_As_____1) == 0x000038, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_DynamicCast_As_____1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_DynamicCast_bSuccess_1) == 0x000040, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_Event_ByPC) == 0x000048, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_Event_ByPC' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_Event_InteractIndex) == 0x000050, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_Event_InteractIndex' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x000058, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OtherActor_2) == 0x000060, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OtherComp_2) == 0x000068, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x000070, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000074, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000078, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x000108, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000110, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000118, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000120, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000128, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_DynamicCast_bSuccess_2) == 0x000130, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000138, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_DynamicCast_bSuccess_3) == 0x000140, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, CallFunc_IsValid_ReturnValue) == 0x000141, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, CallFunc_IsValid_ReturnValue_1) == 0x000142, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000148, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000150, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_CreateDelegate_OutputDelegate) == 0x000154, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, CallFunc_GetClientPlayerCharacter_ReturnValue_1) == 0x000168, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::CallFunc_GetClientPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000170, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_CreateDelegate_OutputDelegate_1) == 0x000174, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000184, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, CallFunc_SpawnEmitterAtLocationEx_ReturnValue) == 0x000190, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::CallFunc_SpawnEmitterAtLocationEx_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000198, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x0001A0, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OtherActor) == 0x0001A8, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OtherComp) == 0x0001B0, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x0001B8, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_bFromSweep) == 0x0001BC, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_ComponentBoundEvent_SweepResult) == 0x0001C0, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_DynamicCast_AsQRSLPlayer_Character_2) == 0x000250, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_DynamicCast_AsQRSLPlayer_Character_2' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee, K2Node_DynamicCast_bSuccess_4) == 0x000258, "Member 'Scanner_honeybee_C_ExecuteUbergraph_Scanner_honeybee::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");

// Function Scanner_honeybee.Scanner_honeybee_C.BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D12[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Scanner_honeybee.Scanner_honeybee_C.BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Scanner_honeybee.Scanner_honeybee_C.BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6D13[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Scanner_honeybee_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Scanner_honeybee.Scanner_honeybee_C.BPInteractFinished
// 0x0010 (0x0010 - 0x0000)
struct Scanner_honeybee_C_BPInteractFinished final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_honeybee_C_BPInteractFinished) == 0x000008, "Wrong alignment on Scanner_honeybee_C_BPInteractFinished");
static_assert(sizeof(Scanner_honeybee_C_BPInteractFinished) == 0x000010, "Wrong size on Scanner_honeybee_C_BPInteractFinished");
static_assert(offsetof(Scanner_honeybee_C_BPInteractFinished, ByPC) == 0x000000, "Member 'Scanner_honeybee_C_BPInteractFinished::ByPC' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BPInteractFinished, InteractIndex) == 0x000008, "Member 'Scanner_honeybee_C_BPInteractFinished::InteractIndex' has a wrong offset!");

// Function Scanner_honeybee.Scanner_honeybee_C.OnLoaded_A3F656AA4ED4AA4238B117B50D55DBB6
// 0x0008 (0x0008 - 0x0000)
struct Scanner_honeybee_C_OnLoaded_A3F656AA4ED4AA4238B117B50D55DBB6 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_honeybee_C_OnLoaded_A3F656AA4ED4AA4238B117B50D55DBB6) == 0x000008, "Wrong alignment on Scanner_honeybee_C_OnLoaded_A3F656AA4ED4AA4238B117B50D55DBB6");
static_assert(sizeof(Scanner_honeybee_C_OnLoaded_A3F656AA4ED4AA4238B117B50D55DBB6) == 0x000008, "Wrong size on Scanner_honeybee_C_OnLoaded_A3F656AA4ED4AA4238B117B50D55DBB6");
static_assert(offsetof(Scanner_honeybee_C_OnLoaded_A3F656AA4ED4AA4238B117B50D55DBB6, Loaded) == 0x000000, "Member 'Scanner_honeybee_C_OnLoaded_A3F656AA4ED4AA4238B117B50D55DBB6::Loaded' has a wrong offset!");

// Function Scanner_honeybee.Scanner_honeybee_C.OnLoaded_D5E6C120460EB956E7FEF29778BC63AB
// 0x0008 (0x0008 - 0x0000)
struct Scanner_honeybee_C_OnLoaded_D5E6C120460EB956E7FEF29778BC63AB final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_honeybee_C_OnLoaded_D5E6C120460EB956E7FEF29778BC63AB) == 0x000008, "Wrong alignment on Scanner_honeybee_C_OnLoaded_D5E6C120460EB956E7FEF29778BC63AB");
static_assert(sizeof(Scanner_honeybee_C_OnLoaded_D5E6C120460EB956E7FEF29778BC63AB) == 0x000008, "Wrong size on Scanner_honeybee_C_OnLoaded_D5E6C120460EB956E7FEF29778BC63AB");
static_assert(offsetof(Scanner_honeybee_C_OnLoaded_D5E6C120460EB956E7FEF29778BC63AB, Loaded) == 0x000000, "Member 'Scanner_honeybee_C_OnLoaded_D5E6C120460EB956E7FEF29778BC63AB::Loaded' has a wrong offset!");

// Function Scanner_honeybee.Scanner_honeybee_C.BPGetInteractEntries
// 0x0018 (0x0018 - 0x0000)
struct Scanner_honeybee_C_BPGetInteractEntries final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 OutInteractEntries;                                // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(Scanner_honeybee_C_BPGetInteractEntries) == 0x000008, "Wrong alignment on Scanner_honeybee_C_BPGetInteractEntries");
static_assert(sizeof(Scanner_honeybee_C_BPGetInteractEntries) == 0x000018, "Wrong size on Scanner_honeybee_C_BPGetInteractEntries");
static_assert(offsetof(Scanner_honeybee_C_BPGetInteractEntries, ByPC) == 0x000000, "Member 'Scanner_honeybee_C_BPGetInteractEntries::ByPC' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_BPGetInteractEntries, OutInteractEntries) == 0x000008, "Member 'Scanner_honeybee_C_BPGetInteractEntries::OutInteractEntries' has a wrong offset!");

// Function Scanner_honeybee.Scanner_honeybee_C.ClientAddPOI_Scanner_Base
// 0x0068 (0x0068 - 0x0000)
struct Scanner_honeybee_C_ClientAddPOI_Scanner_Base final
{
public:
	class AQRSLPlayerCharacter*                   Play;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPOI                                   K2Node_MakeStruct_POI;                             // 0x0008(0x0060)()
};
static_assert(alignof(Scanner_honeybee_C_ClientAddPOI_Scanner_Base) == 0x000008, "Wrong alignment on Scanner_honeybee_C_ClientAddPOI_Scanner_Base");
static_assert(sizeof(Scanner_honeybee_C_ClientAddPOI_Scanner_Base) == 0x000068, "Wrong size on Scanner_honeybee_C_ClientAddPOI_Scanner_Base");
static_assert(offsetof(Scanner_honeybee_C_ClientAddPOI_Scanner_Base, Play) == 0x000000, "Member 'Scanner_honeybee_C_ClientAddPOI_Scanner_Base::Play' has a wrong offset!");
static_assert(offsetof(Scanner_honeybee_C_ClientAddPOI_Scanner_Base, K2Node_MakeStruct_POI) == 0x000008, "Member 'Scanner_honeybee_C_ClientAddPOI_Scanner_Base::K2Node_MakeStruct_POI' has a wrong offset!");

// Function Scanner_honeybee.Scanner_honeybee_C.ClientDelPOI_Scanner_Base
// 0x0008 (0x0008 - 0x0000)
struct Scanner_honeybee_C_ClientDelPOI_Scanner_Base final
{
public:
	class AQRSLPlayerCharacter*                   Play;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_honeybee_C_ClientDelPOI_Scanner_Base) == 0x000008, "Wrong alignment on Scanner_honeybee_C_ClientDelPOI_Scanner_Base");
static_assert(sizeof(Scanner_honeybee_C_ClientDelPOI_Scanner_Base) == 0x000008, "Wrong size on Scanner_honeybee_C_ClientDelPOI_Scanner_Base");
static_assert(offsetof(Scanner_honeybee_C_ClientDelPOI_Scanner_Base, Play) == 0x000000, "Member 'Scanner_honeybee_C_ClientDelPOI_Scanner_Base::Play' has a wrong offset!");

}

