#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scanner_Base

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function Scanner_Base.Scanner_Base_C.ExecuteUbergraph_Scanner_Base
// 0x0298 (0x0298 - 0x0000)
struct Scanner_Base_C_ExecuteUbergraph_Scanner_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57D6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent;    // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor;             // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp;              // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex;         // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep;             // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D7[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult;            // 0x0028(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_57D8[0x4];                                     // 0x00B4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D9[0x7];                                     // 0x00C1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_2;                       // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate;              // 0x00D0(0x0010)(ZeroConstructor, NoDestructor)
	class UObject*                                ___object_Variable;                                // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_As____;                         // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57DA[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded_1;                       // 0x00F8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ___object_Variable_1;                              // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_As_____1;                       // 0x0108(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0110(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57DB[0x7];                                     // 0x0111(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UObject*                                K2Node_CustomEvent_Loaded;                         // 0x0118(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                                ___object_Variable_2;                              // 0x0120(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystem*                        K2Node_DynamicCast_As_____2;                       // 0x0128(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0130(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57DC[0x7];                                     // 0x0131(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerController*                 K2Node_Event_ByPC;                                 // 0x0138(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x0140(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57DD[0x4];                                     // 0x0144(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_2;  // 0x0148(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_2;           // 0x0150(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_2;            // 0x0158(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_2;       // 0x0160(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_ComponentBoundEvent_bFromSweep_1;           // 0x0164(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57DE[0x3];                                     // 0x0165(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             K2Node_ComponentBoundEvent_SweepResult_1;          // 0x0168(0x008C)(ConstParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	uint8                                         Pad_57DF[0x4];                                     // 0x01F4(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OverlappedComponent_1;  // 0x01F8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_ComponentBoundEvent_OtherActor_1;           // 0x0200(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    K2Node_ComponentBoundEvent_OtherComp_1;            // 0x0208(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_ComponentBoundEvent_OtherBodyIndex_1;       // 0x0210(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_57E0[0x4];                                     // 0x0214(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0218(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0220(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E1[0x7];                                     // 0x0221(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_2;       // 0x0228(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0230(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0231(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0232(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E2[0x5];                                     // 0x0233(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0238(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_1;   // 0x0240(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0248(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x0249(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E3[0x2];                                     // 0x024A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_1;            // 0x024C(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class UObject* Loaded)>        K2Node_CreateDelegate_OutputDelegate_2;            // 0x025C(0x0010)(ZeroConstructor, NoDestructor)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x026C(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue;         // 0x0278(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAtLocationEx_ReturnValue;     // 0x0280(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               CallFunc_SpawnEmitterAttached_ReturnValue_1;       // 0x0288(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimMontage_ReturnValue;              // 0x0290(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base) == 0x000008, "Wrong alignment on Scanner_Base_C_ExecuteUbergraph_Scanner_Base");
static_assert(sizeof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base) == 0x000298, "Wrong size on Scanner_Base_C_ExecuteUbergraph_Scanner_Base");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, EntryPoint) == 0x000000, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OverlappedComponent) == 0x000008, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OtherActor) == 0x000010, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OtherActor' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OtherComp) == 0x000018, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OtherComp' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OtherBodyIndex) == 0x000020, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_bFromSweep) == 0x000024, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_bFromSweep' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_SweepResult) == 0x000028, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_SweepResult' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x0000B8, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_bSuccess) == 0x0000C0, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_CustomEvent_Loaded_2) == 0x0000C8, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_CustomEvent_Loaded_2' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_CreateDelegate_OutputDelegate) == 0x0000D0, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, ___object_Variable) == 0x0000E0, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::___object_Variable' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_As____) == 0x0000E8, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_As____' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_bSuccess_1) == 0x0000F0, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_CustomEvent_Loaded_1) == 0x0000F8, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_CustomEvent_Loaded_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, ___object_Variable_1) == 0x000100, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::___object_Variable_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_As_____1) == 0x000108, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_As_____1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_bSuccess_2) == 0x000110, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_CustomEvent_Loaded) == 0x000118, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_CustomEvent_Loaded' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, ___object_Variable_2) == 0x000120, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::___object_Variable_2' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_As_____2) == 0x000128, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_As_____2' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_bSuccess_3) == 0x000130, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_Event_ByPC) == 0x000138, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_Event_ByPC' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_Event_InteractIndex) == 0x000140, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_Event_InteractIndex' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OverlappedComponent_2) == 0x000148, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OverlappedComponent_2' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OtherActor_2) == 0x000150, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OtherActor_2' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OtherComp_2) == 0x000158, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OtherComp_2' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OtherBodyIndex_2) == 0x000160, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OtherBodyIndex_2' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_bFromSweep_1) == 0x000164, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_bFromSweep_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_SweepResult_1) == 0x000168, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_SweepResult_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OverlappedComponent_1) == 0x0001F8, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OverlappedComponent_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OtherActor_1) == 0x000200, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OtherActor_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OtherComp_1) == 0x000208, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OtherComp_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_ComponentBoundEvent_OtherBodyIndex_1) == 0x000210, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_ComponentBoundEvent_OtherBodyIndex_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000218, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_bSuccess_4) == 0x000220, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_AsQRSLPlayer_Character_2) == 0x000228, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_AsQRSLPlayer_Character_2' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_DynamicCast_bSuccess_5) == 0x000230, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_IsValid_ReturnValue) == 0x000231, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_IsValid_ReturnValue_1) == 0x000232, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000238, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_GetClientPlayerCharacter_ReturnValue_1) == 0x000240, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_GetClientPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000248, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x000249, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x00024C, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x00025C, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_K2_GetActorLocation_ReturnValue) == 0x00026C, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_SpawnEmitterAttached_ReturnValue) == 0x000278, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_SpawnEmitterAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_SpawnEmitterAtLocationEx_ReturnValue) == 0x000280, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_SpawnEmitterAtLocationEx_ReturnValue' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_SpawnEmitterAttached_ReturnValue_1) == 0x000288, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_SpawnEmitterAttached_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ExecuteUbergraph_Scanner_Base, CallFunc_PlayAnimMontage_ReturnValue) == 0x000290, "Member 'Scanner_Base_C_ExecuteUbergraph_Scanner_Base::CallFunc_PlayAnimMontage_ReturnValue' has a wrong offset!");

// Function Scanner_Base.Scanner_Base_C.BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E4[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Scanner_Base.Scanner_Base_C.BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature
// 0x0020 (0x0020 - 0x0000)
struct Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(sizeof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature) == 0x000020, "Wrong size on Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");

// Function Scanner_Base.Scanner_Base_C.BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature
// 0x00B0 (0x00B0 - 0x0000)
struct Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature final
{
public:
	class UPrimitiveComponent*                    OverlappedComponent;                               // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 OtherActor;                                        // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPrimitiveComponent*                    OtherComp;                                         // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         OtherBodyIndex;                                    // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          bFromSweep;                                        // 0x001C(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57E5[0x3];                                     // 0x001D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FHitResult                             SweepResult;                                       // 0x0020(0x008C)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, IsPlainOldData, NoDestructor, ContainsInstancedReference)
};
static_assert(alignof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x000008, "Wrong alignment on Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(sizeof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature) == 0x0000B0, "Wrong size on Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OverlappedComponent) == 0x000000, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OverlappedComponent' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherActor) == 0x000008, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherActor' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherComp) == 0x000010, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherComp' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, OtherBodyIndex) == 0x000018, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::OtherBodyIndex' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, bFromSweep) == 0x00001C, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::bFromSweep' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature, SweepResult) == 0x000020, "Member 'Scanner_Base_C_BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature::SweepResult' has a wrong offset!");

// Function Scanner_Base.Scanner_Base_C.BPInteractFinished
// 0x0010 (0x0010 - 0x0000)
struct Scanner_Base_C_BPInteractFinished final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Base_C_BPInteractFinished) == 0x000008, "Wrong alignment on Scanner_Base_C_BPInteractFinished");
static_assert(sizeof(Scanner_Base_C_BPInteractFinished) == 0x000010, "Wrong size on Scanner_Base_C_BPInteractFinished");
static_assert(offsetof(Scanner_Base_C_BPInteractFinished, ByPC) == 0x000000, "Member 'Scanner_Base_C_BPInteractFinished::ByPC' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BPInteractFinished, InteractIndex) == 0x000008, "Member 'Scanner_Base_C_BPInteractFinished::InteractIndex' has a wrong offset!");

// Function Scanner_Base.Scanner_Base_C.OnLoaded_9E3B252542E4122AC828E4AE09F65C27
// 0x0008 (0x0008 - 0x0000)
struct Scanner_Base_C_OnLoaded_9E3B252542E4122AC828E4AE09F65C27 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Base_C_OnLoaded_9E3B252542E4122AC828E4AE09F65C27) == 0x000008, "Wrong alignment on Scanner_Base_C_OnLoaded_9E3B252542E4122AC828E4AE09F65C27");
static_assert(sizeof(Scanner_Base_C_OnLoaded_9E3B252542E4122AC828E4AE09F65C27) == 0x000008, "Wrong size on Scanner_Base_C_OnLoaded_9E3B252542E4122AC828E4AE09F65C27");
static_assert(offsetof(Scanner_Base_C_OnLoaded_9E3B252542E4122AC828E4AE09F65C27, Loaded) == 0x000000, "Member 'Scanner_Base_C_OnLoaded_9E3B252542E4122AC828E4AE09F65C27::Loaded' has a wrong offset!");

// Function Scanner_Base.Scanner_Base_C.OnLoaded_18307AFD419111986525048AA8115269
// 0x0008 (0x0008 - 0x0000)
struct Scanner_Base_C_OnLoaded_18307AFD419111986525048AA8115269 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Base_C_OnLoaded_18307AFD419111986525048AA8115269) == 0x000008, "Wrong alignment on Scanner_Base_C_OnLoaded_18307AFD419111986525048AA8115269");
static_assert(sizeof(Scanner_Base_C_OnLoaded_18307AFD419111986525048AA8115269) == 0x000008, "Wrong size on Scanner_Base_C_OnLoaded_18307AFD419111986525048AA8115269");
static_assert(offsetof(Scanner_Base_C_OnLoaded_18307AFD419111986525048AA8115269, Loaded) == 0x000000, "Member 'Scanner_Base_C_OnLoaded_18307AFD419111986525048AA8115269::Loaded' has a wrong offset!");

// Function Scanner_Base.Scanner_Base_C.OnLoaded_B669BE1249D1921B0ED0EEA1F1D96763
// 0x0008 (0x0008 - 0x0000)
struct Scanner_Base_C_OnLoaded_B669BE1249D1921B0ED0EEA1F1D96763 final
{
public:
	class UObject*                                Loaded;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Base_C_OnLoaded_B669BE1249D1921B0ED0EEA1F1D96763) == 0x000008, "Wrong alignment on Scanner_Base_C_OnLoaded_B669BE1249D1921B0ED0EEA1F1D96763");
static_assert(sizeof(Scanner_Base_C_OnLoaded_B669BE1249D1921B0ED0EEA1F1D96763) == 0x000008, "Wrong size on Scanner_Base_C_OnLoaded_B669BE1249D1921B0ED0EEA1F1D96763");
static_assert(offsetof(Scanner_Base_C_OnLoaded_B669BE1249D1921B0ED0EEA1F1D96763, Loaded) == 0x000000, "Member 'Scanner_Base_C_OnLoaded_B669BE1249D1921B0ED0EEA1F1D96763::Loaded' has a wrong offset!");

// Function Scanner_Base.Scanner_Base_C.BPGetInteractEntries
// 0x0018 (0x0018 - 0x0000)
struct Scanner_Base_C_BPGetInteractEntries final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 OutInteractEntries;                                // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
};
static_assert(alignof(Scanner_Base_C_BPGetInteractEntries) == 0x000008, "Wrong alignment on Scanner_Base_C_BPGetInteractEntries");
static_assert(sizeof(Scanner_Base_C_BPGetInteractEntries) == 0x000018, "Wrong size on Scanner_Base_C_BPGetInteractEntries");
static_assert(offsetof(Scanner_Base_C_BPGetInteractEntries, ByPC) == 0x000000, "Member 'Scanner_Base_C_BPGetInteractEntries::ByPC' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_BPGetInteractEntries, OutInteractEntries) == 0x000008, "Member 'Scanner_Base_C_BPGetInteractEntries::OutInteractEntries' has a wrong offset!");

// Function Scanner_Base.Scanner_Base_C.ClientAddPOI_Scanner_Base
// 0x0068 (0x0068 - 0x0000)
struct Scanner_Base_C_ClientAddPOI_Scanner_Base final
{
public:
	class AQRSLPlayerCharacter*                   Play;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FPOI                                   K2Node_MakeStruct_POI;                             // 0x0008(0x0060)()
};
static_assert(alignof(Scanner_Base_C_ClientAddPOI_Scanner_Base) == 0x000008, "Wrong alignment on Scanner_Base_C_ClientAddPOI_Scanner_Base");
static_assert(sizeof(Scanner_Base_C_ClientAddPOI_Scanner_Base) == 0x000068, "Wrong size on Scanner_Base_C_ClientAddPOI_Scanner_Base");
static_assert(offsetof(Scanner_Base_C_ClientAddPOI_Scanner_Base, Play) == 0x000000, "Member 'Scanner_Base_C_ClientAddPOI_Scanner_Base::Play' has a wrong offset!");
static_assert(offsetof(Scanner_Base_C_ClientAddPOI_Scanner_Base, K2Node_MakeStruct_POI) == 0x000008, "Member 'Scanner_Base_C_ClientAddPOI_Scanner_Base::K2Node_MakeStruct_POI' has a wrong offset!");

// Function Scanner_Base.Scanner_Base_C.ClientDelPOI_Scanner_Base
// 0x0008 (0x0008 - 0x0000)
struct Scanner_Base_C_ClientDelPOI_Scanner_Base final
{
public:
	class AQRSLPlayerCharacter*                   Play;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scanner_Base_C_ClientDelPOI_Scanner_Base) == 0x000008, "Wrong alignment on Scanner_Base_C_ClientDelPOI_Scanner_Base");
static_assert(sizeof(Scanner_Base_C_ClientDelPOI_Scanner_Base) == 0x000008, "Wrong size on Scanner_Base_C_ClientDelPOI_Scanner_Base");
static_assert(offsetof(Scanner_Base_C_ClientDelPOI_Scanner_Base, Play) == 0x000000, "Member 'Scanner_Base_C_ClientDelPOI_Scanner_Base::Play' has a wrong offset!");

}

