#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scanner_jellyfish

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "BP_DialogueNpcBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Scanner_jellyfish.Scanner_jellyfish_C
// 0x0110 (0x3BF0 - 0x3AE0)
class AScanner_jellyfish_C final : public ABP_DialogueNpcBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Scanner_jellyfish_C;                // 0x3AD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x3AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                          GuideTriggerBox;                                   // 0x3AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere_on_stop;                                    // 0x3AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x3AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 Out_Interact_Entries;                              // 0x3B00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsOn;                                              // 0x3B10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CF1[0x7];                                     // 0x3B11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Begin;                                             // 0x3B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Idle;                                              // 0x3B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Chibang;                                           // 0x3B28(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Diedie;                                            // 0x3B50(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsOver;                                            // 0x3B78(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CF2[0x7];                                     // 0x3B79(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPOI                                   AnimalPOI;                                         // 0x3B80(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAnimSequence*                          Scanning;                                          // 0x3BE0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Scanner_jellyfish(int32 EntryPoint);
	void BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Scanner_jellyfish_EndReward();
	void Scanner_jellyfish_Reward();
	void BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPInteractFinished(class AHottaPlayerController* ByPC, int32 InteractIndex);
	void ReceiveBeginPlay();
	void OnCompleted_66474FB44C186E41B7F90F9473425417(class FName NotifyName);
	void OnBlendOut_66474FB44C186E41B7F90F9473425417(class FName NotifyName);
	void OnInterrupted_66474FB44C186E41B7F90F9473425417(class FName NotifyName);
	void OnNotifyBegin_66474FB44C186E41B7F90F9473425417(class FName NotifyName);
	void OnNotifyEnd_66474FB44C186E41B7F90F9473425417(class FName NotifyName);
	void OnCompleted_9964D9CE42429DD1F4C0E08CB88545B3(class FName NotifyName);
	void OnBlendOut_9964D9CE42429DD1F4C0E08CB88545B3(class FName NotifyName);
	void OnInterrupted_9964D9CE42429DD1F4C0E08CB88545B3(class FName NotifyName);
	void OnNotifyBegin_9964D9CE42429DD1F4C0E08CB88545B3(class FName NotifyName);
	void OnNotifyEnd_9964D9CE42429DD1F4C0E08CB88545B3(class FName NotifyName);
	void OnCompleted_29B6033342CF84ACAB06D8940BC80C31(class FName NotifyName);
	void OnBlendOut_29B6033342CF84ACAB06D8940BC80C31(class FName NotifyName);
	void OnInterrupted_29B6033342CF84ACAB06D8940BC80C31(class FName NotifyName);
	void OnNotifyBegin_29B6033342CF84ACAB06D8940BC80C31(class FName NotifyName);
	void OnNotifyEnd_29B6033342CF84ACAB06D8940BC80C31(class FName NotifyName);
	void OnLoaded_B28F0C644D8DA5CD9ABE29AFCF399732(class UObject* Loaded);
	void BPGetInteractEntries(class AHottaPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void ClientAddPOI_Scanner_Base(class AQRSLPlayerCharacter* Play);
	void ClientDelPOI_Scanner_Base(class AQRSLPlayerCharacter* Play);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Scanner_jellyfish_C">();
	}
	static class AScanner_jellyfish_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AScanner_jellyfish_C>();
	}
};
static_assert(alignof(AScanner_jellyfish_C) == 0x000010, "Wrong alignment on AScanner_jellyfish_C");
static_assert(sizeof(AScanner_jellyfish_C) == 0x003BF0, "Wrong size on AScanner_jellyfish_C");
static_assert(offsetof(AScanner_jellyfish_C, UberGraphFrame_Scanner_jellyfish_C) == 0x003AD8, "Member 'AScanner_jellyfish_C::UberGraphFrame_Scanner_jellyfish_C' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, ParticleSystem) == 0x003AE0, "Member 'AScanner_jellyfish_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, GuideTriggerBox) == 0x003AE8, "Member 'AScanner_jellyfish_C::GuideTriggerBox' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, Sphere_on_stop) == 0x003AF0, "Member 'AScanner_jellyfish_C::Sphere_on_stop' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, Sphere) == 0x003AF8, "Member 'AScanner_jellyfish_C::Sphere' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, Out_Interact_Entries) == 0x003B00, "Member 'AScanner_jellyfish_C::Out_Interact_Entries' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, IsOn) == 0x003B10, "Member 'AScanner_jellyfish_C::IsOn' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, Begin) == 0x003B18, "Member 'AScanner_jellyfish_C::Begin' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, Idle) == 0x003B20, "Member 'AScanner_jellyfish_C::Idle' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, Chibang) == 0x003B28, "Member 'AScanner_jellyfish_C::Chibang' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, Diedie) == 0x003B50, "Member 'AScanner_jellyfish_C::Diedie' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, IsOver) == 0x003B78, "Member 'AScanner_jellyfish_C::IsOver' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, AnimalPOI) == 0x003B80, "Member 'AScanner_jellyfish_C::AnimalPOI' has a wrong offset!");
static_assert(offsetof(AScanner_jellyfish_C, Scanning) == 0x003BE0, "Member 'AScanner_jellyfish_C::Scanning' has a wrong offset!");

}

