#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scanner_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "BP_DialogueNpcBase_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass Scanner_Base.Scanner_Base_C
// 0x0140 (0x3C20 - 0x3AE0)
class AScanner_Base_C final : public ABP_DialogueNpcBase_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_Scanner_Base_C;                     // 0x3AD8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                          GuideTriggerBox;                                   // 0x3AE0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*               ParticleSystem;                                    // 0x3AE8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere_on_stop;                                    // 0x3AF0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x3AF8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 Out_Interact_Entries;                              // 0x3B00(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                          IsOn;                                              // 0x3B10(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D4[0x7];                                     // 0x3B11(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UAnimSequence*                          Begin;                                             // 0x3B18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Idle;                                              // 0x3B20(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Chibang;                                           // 0x3B28(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAnimSequence*                          Scanner;                                           // 0x3B50(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                          Die;                                               // 0x3B58(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                 Diedie;                                            // 0x3B60(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                          IsOver;                                            // 0x3B88(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57D5[0x7];                                     // 0x3B89(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPOI                                   AnimalPOI;                                         // 0x3B90(0x0060)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UObject>                 Asset;                                             // 0x3BF0(0x0028)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UAnimMontage*                           Anim_Montage;                                      // 0x3C18(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Scanner_Base(int32 EntryPoint);
	void BndEvt__Scanner_Base_GuideTriggerBox_K2Node_ComponentBoundEvent_2_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void Scanner_Base_EndReward();
	void Scanner_Base_Reward();
	void BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_1_ComponentEndOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void BndEvt__Scanner_Base_Sphere_on_stop_K2Node_ComponentBoundEvent_0_ComponentBeginOverlapSignature__DelegateSignature(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, const struct FHitResult& SweepResult);
	void BPInteractFinished(class AHottaPlayerController* ByPC, int32 InteractIndex);
	void OnLoaded_9E3B252542E4122AC828E4AE09F65C27(class UObject* Loaded);
	void OnLoaded_18307AFD419111986525048AA8115269(class UObject* Loaded);
	void OnLoaded_B669BE1249D1921B0ED0EEA1F1D96763(class UObject* Loaded);
	void BPGetInteractEntries(class AHottaPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);
	void ClientAddPOI_Scanner_Base(class AQRSLPlayerCharacter* Play);
	void ClientDelPOI_Scanner_Base(class AQRSLPlayerCharacter* Play);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Scanner_Base_C">();
	}
	static class AScanner_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AScanner_Base_C>();
	}
};
static_assert(alignof(AScanner_Base_C) == 0x000010, "Wrong alignment on AScanner_Base_C");
static_assert(sizeof(AScanner_Base_C) == 0x003C20, "Wrong size on AScanner_Base_C");
static_assert(offsetof(AScanner_Base_C, UberGraphFrame_Scanner_Base_C) == 0x003AD8, "Member 'AScanner_Base_C::UberGraphFrame_Scanner_Base_C' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, GuideTriggerBox) == 0x003AE0, "Member 'AScanner_Base_C::GuideTriggerBox' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, ParticleSystem) == 0x003AE8, "Member 'AScanner_Base_C::ParticleSystem' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Sphere_on_stop) == 0x003AF0, "Member 'AScanner_Base_C::Sphere_on_stop' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Sphere) == 0x003AF8, "Member 'AScanner_Base_C::Sphere' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Out_Interact_Entries) == 0x003B00, "Member 'AScanner_Base_C::Out_Interact_Entries' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, IsOn) == 0x003B10, "Member 'AScanner_Base_C::IsOn' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Begin) == 0x003B18, "Member 'AScanner_Base_C::Begin' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Idle) == 0x003B20, "Member 'AScanner_Base_C::Idle' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Chibang) == 0x003B28, "Member 'AScanner_Base_C::Chibang' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Scanner) == 0x003B50, "Member 'AScanner_Base_C::Scanner' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Die) == 0x003B58, "Member 'AScanner_Base_C::Die' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Diedie) == 0x003B60, "Member 'AScanner_Base_C::Diedie' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, IsOver) == 0x003B88, "Member 'AScanner_Base_C::IsOver' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, AnimalPOI) == 0x003B90, "Member 'AScanner_Base_C::AnimalPOI' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Asset) == 0x003BF0, "Member 'AScanner_Base_C::Asset' has a wrong offset!");
static_assert(offsetof(AScanner_Base_C, Anim_Montage) == 0x003C18, "Member 'AScanner_Base_C::Anim_Montage' has a wrong offset!");

}

