#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SceneEffectCutTree37

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SceneEffectCutTree37.SceneEffectCutTree37_C.ExecuteUbergraph_SceneEffectCutTree37
// 0x0044 (0x0044 - 0x0000)
struct SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                K2Node_Event_HitLocation;                          // 0x0004(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         K2Node_Event_EffectScale;                          // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetComponentLocation_ReturnValue;      // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X_1;                          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y_1;                          // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z_1;                          // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_MakeVector_ReturnValue;                   // 0x0038(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37) == 0x000004, "Wrong alignment on SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37");
static_assert(sizeof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37) == 0x000044, "Wrong size on SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, EntryPoint) == 0x000000, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::EntryPoint' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, K2Node_Event_HitLocation) == 0x000004, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::K2Node_Event_HitLocation' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, K2Node_Event_EffectScale) == 0x000010, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::K2Node_Event_EffectScale' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, CallFunc_BreakVector_X) == 0x000014, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, CallFunc_BreakVector_Y) == 0x000018, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, CallFunc_BreakVector_Z) == 0x00001C, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, CallFunc_K2_GetComponentLocation_ReturnValue) == 0x000020, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::CallFunc_K2_GetComponentLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, CallFunc_BreakVector_X_1) == 0x00002C, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::CallFunc_BreakVector_X_1' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, CallFunc_BreakVector_Y_1) == 0x000030, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::CallFunc_BreakVector_Y_1' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, CallFunc_BreakVector_Z_1) == 0x000034, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::CallFunc_BreakVector_Z_1' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37, CallFunc_MakeVector_ReturnValue) == 0x000038, "Member 'SceneEffectCutTree37_C_ExecuteUbergraph_SceneEffectCutTree37::CallFunc_MakeVector_ReturnValue' has a wrong offset!");

// Function SceneEffectCutTree37.SceneEffectCutTree37_C.OpenCutTreeEffectEvent
// 0x0010 (0x0010 - 0x0000)
struct SceneEffectCutTree37_C_OpenCutTreeEffectEvent final
{
public:
	struct FVector                                HitLocation;                                       // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         EffectScale;                                       // 0x000C(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SceneEffectCutTree37_C_OpenCutTreeEffectEvent) == 0x000004, "Wrong alignment on SceneEffectCutTree37_C_OpenCutTreeEffectEvent");
static_assert(sizeof(SceneEffectCutTree37_C_OpenCutTreeEffectEvent) == 0x000010, "Wrong size on SceneEffectCutTree37_C_OpenCutTreeEffectEvent");
static_assert(offsetof(SceneEffectCutTree37_C_OpenCutTreeEffectEvent, HitLocation) == 0x000000, "Member 'SceneEffectCutTree37_C_OpenCutTreeEffectEvent::HitLocation' has a wrong offset!");
static_assert(offsetof(SceneEffectCutTree37_C_OpenCutTreeEffectEvent, EffectScale) == 0x00000C, "Member 'SceneEffectCutTree37_C_OpenCutTreeEffectEvent::EffectScale' has a wrong offset!");

}

