#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Scene_Box_OnceOnly_002_Vera

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function Scene_Box_OnceOnly_002_Vera.Scene_Box_OnceOnly_002_Vera_C.ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera
// 0x0028 (0x0028 - 0x0000)
struct Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_586D[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_thePlayer;                            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsTreasureBoxOpened_ReturnValue;          // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera) == 0x000008, "Wrong alignment on Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera");
static_assert(sizeof(Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera) == 0x000028, "Wrong size on Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera");
static_assert(offsetof(Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera, EntryPoint) == 0x000000, "Member 'Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera::EntryPoint' has a wrong offset!");
static_assert(offsetof(Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera, CallFunc_SwitchNetMode_OutNetMode) == 0x000004, "Member 'Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera, K2Node_Event_thePlayer) == 0x000008, "Member 'Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera::K2Node_Event_thePlayer' has a wrong offset!");
static_assert(offsetof(Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera, K2Node_Event_MainPlayer) == 0x000010, "Member 'Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000018, "Member 'Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera, K2Node_DynamicCast_bSuccess) == 0x000020, "Member 'Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera, CallFunc_IsTreasureBoxOpened_ReturnValue) == 0x000021, "Member 'Scene_Box_OnceOnly_002_Vera_C_ExecuteUbergraph_Scene_Box_OnceOnly_002_Vera::CallFunc_IsTreasureBoxOpened_ReturnValue' has a wrong offset!");

// Function Scene_Box_OnceOnly_002_Vera.Scene_Box_OnceOnly_002_Vera_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct Scene_Box_OnceOnly_002_Vera_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scene_Box_OnceOnly_002_Vera_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on Scene_Box_OnceOnly_002_Vera_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(Scene_Box_OnceOnly_002_Vera_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on Scene_Box_OnceOnly_002_Vera_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(Scene_Box_OnceOnly_002_Vera_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'Scene_Box_OnceOnly_002_Vera_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

// Function Scene_Box_OnceOnly_002_Vera.Scene_Box_OnceOnly_002_Vera_C.OnExplore
// 0x0008 (0x0008 - 0x0000)
struct Scene_Box_OnceOnly_002_Vera_C_OnExplore final
{
public:
	class AHottaPlayerCharacter*                  ThePlayer;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Scene_Box_OnceOnly_002_Vera_C_OnExplore) == 0x000008, "Wrong alignment on Scene_Box_OnceOnly_002_Vera_C_OnExplore");
static_assert(sizeof(Scene_Box_OnceOnly_002_Vera_C_OnExplore) == 0x000008, "Wrong size on Scene_Box_OnceOnly_002_Vera_C_OnExplore");
static_assert(offsetof(Scene_Box_OnceOnly_002_Vera_C_OnExplore, ThePlayer) == 0x000000, "Member 'Scene_Box_OnceOnly_002_Vera_C_OnExplore::ThePlayer' has a wrong offset!");

}

