#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SelfIsInControl

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function SelfIsInControl.SelfIsInControl_C.CanApplyGameplayEffectContent
// 0x0058 (0x0058 - 0x0000)
struct SelfIsInControl_C_CanApplyGameplayEffectContent final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InstigatorActor;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_189B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FGameplayTagContainer                  NewLocalVar_0;                                     // 0x0028(0x0020)(Edit, BlueprintVisible)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_HasMatchingGameplayTag_ReturnValue;    // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInHitDownEffect_ReturnValue;            // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInFloatingEffect_ReturnValue;           // 0x0053(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x0054(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue_1;                  // 0x0055(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SelfIsInControl_C_CanApplyGameplayEffectContent) == 0x000008, "Wrong alignment on SelfIsInControl_C_CanApplyGameplayEffectContent");
static_assert(sizeof(SelfIsInControl_C_CanApplyGameplayEffectContent) == 0x000058, "Wrong size on SelfIsInControl_C_CanApplyGameplayEffectContent");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, SourceActor) == 0x000000, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::SourceActor' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, TargetActor) == 0x000008, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::TargetActor' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, InstigatorActor) == 0x000010, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::InstigatorActor' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, GameplayEffect) == 0x000018, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::GameplayEffect' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, ReturnValue) == 0x000020, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, NewLocalVar_0) == 0x000028, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::NewLocalVar_0' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000048, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, CallFunc_K2_HasMatchingGameplayTag_ReturnValue) == 0x000051, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::CallFunc_K2_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, CallFunc_IsInHitDownEffect_ReturnValue) == 0x000052, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::CallFunc_IsInHitDownEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, CallFunc_IsInFloatingEffect_ReturnValue) == 0x000053, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::CallFunc_IsInFloatingEffect_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, CallFunc_BooleanOR_ReturnValue) == 0x000054, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");
static_assert(offsetof(SelfIsInControl_C_CanApplyGameplayEffectContent, CallFunc_BooleanOR_ReturnValue_1) == 0x000055, "Member 'SelfIsInControl_C_CanApplyGameplayEffectContent::CallFunc_BooleanOR_ReturnValue_1' has a wrong offset!");

}

