#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SendBowAttackTargNS

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"


namespace SDK::Params
{

// Function SendBowAttackTargNS.SendBowAttackTargNS_C.Received_NotifyBegin
// 0x0050 (0x0050 - 0x0000)
struct SendBowAttackTargNS_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E18[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsForceAimming_ReturnValue;               // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsForceAimming_ReturnValue_1;             // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_K2_CheckTriggerTime_ReturnValue;          // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E19[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeaponBase*                            CallFunc_GetCurrentWeapon_ReturnValue;             // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable;                                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable_1;                                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FGameplayTag                           K2Node_Select_Default;                             // 0x003C(0x0008)(NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           K2Node_Select_Default_1;                           // 0x0044(0x0008)(NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(SendBowAttackTargNS_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on SendBowAttackTargNS_C_Received_NotifyBegin");
static_assert(sizeof(SendBowAttackTargNS_C_Received_NotifyBegin) == 0x000050, "Wrong size on SendBowAttackTargNS_C_Received_NotifyBegin");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000020, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, CallFunc_IsForceAimming_ReturnValue) == 0x000029, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::CallFunc_IsForceAimming_ReturnValue' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, CallFunc_IsForceAimming_ReturnValue_1) == 0x00002A, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::CallFunc_IsForceAimming_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, CallFunc_K2_CheckTriggerTime_ReturnValue) == 0x00002B, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::CallFunc_K2_CheckTriggerTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, CallFunc_GetCurrentWeapon_ReturnValue) == 0x000030, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::CallFunc_GetCurrentWeapon_ReturnValue' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, CallFunc_IsValid_ReturnValue) == 0x000038, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000039, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, ___bool_Variable) == 0x00003A, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::___bool_Variable' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, ___bool_Variable_1) == 0x00003B, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, K2Node_Select_Default) == 0x00003C, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(SendBowAttackTargNS_C_Received_NotifyBegin, K2Node_Select_Default_1) == 0x000044, "Member 'SendBowAttackTargNS_C_Received_NotifyBegin::K2Node_Select_Default_1' has a wrong offset!");

}

