#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SendBowAttackTargNS

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SendBowAttackTargNS.SendBowAttackTargNS_C
// 0x0030 (0x0068 - 0x0038)
class USendBowAttackTargNS_C final : public UAnimNotifyState_SendAttackTarget
{
public:
	struct FGameplayTag                           EventTag;                                          // 0x0038(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           ForceAttackEventTag;                               // 0x0040(0x0008)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGameplayTag>                   FireAttackEventTag;                                // 0x0048(0x0010)(Edit, BlueprintVisible)
	TArray<struct FGameplayTag>                   FireForceAttackEventTag;                           // 0x0058(0x0010)(Edit, BlueprintVisible)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SendBowAttackTargNS_C">();
	}
	static class USendBowAttackTargNS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USendBowAttackTargNS_C>();
	}
};
static_assert(alignof(USendBowAttackTargNS_C) == 0x000008, "Wrong alignment on USendBowAttackTargNS_C");
static_assert(sizeof(USendBowAttackTargNS_C) == 0x000068, "Wrong size on USendBowAttackTargNS_C");
static_assert(offsetof(USendBowAttackTargNS_C, EventTag) == 0x000038, "Member 'USendBowAttackTargNS_C::EventTag' has a wrong offset!");
static_assert(offsetof(USendBowAttackTargNS_C, ForceAttackEventTag) == 0x000040, "Member 'USendBowAttackTargNS_C::ForceAttackEventTag' has a wrong offset!");
static_assert(offsetof(USendBowAttackTargNS_C, FireAttackEventTag) == 0x000048, "Member 'USendBowAttackTargNS_C::FireAttackEventTag' has a wrong offset!");
static_assert(offsetof(USendBowAttackTargNS_C, FireForceAttackEventTag) == 0x000058, "Member 'USendBowAttackTargNS_C::FireForceAttackEventTag' has a wrong offset!");

}

