#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetAxisInputScaleNS

#include "Basic.hpp"

#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass SetAxisInputScaleNS.SetAxisInputScaleNS_C
// 0x0010 (0x0040 - 0x0030)
class USetAxisInputScaleNS_C final : public UAnimNotifyState
{
public:
	float                                         ForwardAxisInputScale;                             // 0x0030(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RightAxisInputScale;                               // 0x0034(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         RotationSacle;                                     // 0x0038(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	bool Received_NotifyBegin(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation, float TotalDuration) const;
	bool Received_NotifyEnd(class USkeletalMeshComponent* MeshComp, class UAnimSequenceBase* Animation) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SetAxisInputScaleNS_C">();
	}
	static class USetAxisInputScaleNS_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USetAxisInputScaleNS_C>();
	}
};
static_assert(alignof(USetAxisInputScaleNS_C) == 0x000008, "Wrong alignment on USetAxisInputScaleNS_C");
static_assert(sizeof(USetAxisInputScaleNS_C) == 0x000040, "Wrong size on USetAxisInputScaleNS_C");
static_assert(offsetof(USetAxisInputScaleNS_C, ForwardAxisInputScale) == 0x000030, "Member 'USetAxisInputScaleNS_C::ForwardAxisInputScale' has a wrong offset!");
static_assert(offsetof(USetAxisInputScaleNS_C, RightAxisInputScale) == 0x000034, "Member 'USetAxisInputScaleNS_C::RightAxisInputScale' has a wrong offset!");
static_assert(offsetof(USetAxisInputScaleNS_C, RotationSacle) == 0x000038, "Member 'USetAxisInputScaleNS_C::RotationSacle' has a wrong offset!");

}

