#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SetVelocityNS

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function SetVelocityNS.SetVelocityNS_C.Received_NotifyBegin
// 0x0090 (0x0090 - 0x0000)
struct SetVelocityNS_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1755[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1756[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             CallFunc_GetTransform_ReturnValue;                 // 0x0030(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UPawnMovementComponent*                 CallFunc_GetMovementComponent_ReturnValue;         // 0x0060(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_TransformDirection_ReturnValue;           // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1757[0x4];                                     // 0x0074(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaCharacterMovementComponent*       K2Node_DynamicCast_AsHotta_Character_Movement_Component; // 0x0078(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SetVelocityNS_C_Received_NotifyBegin) == 0x000010, "Wrong alignment on SetVelocityNS_C_Received_NotifyBegin");
static_assert(sizeof(SetVelocityNS_C_Received_NotifyBegin) == 0x000090, "Wrong size on SetVelocityNS_C_Received_NotifyBegin");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'SetVelocityNS_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'SetVelocityNS_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'SetVelocityNS_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'SetVelocityNS_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'SetVelocityNS_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, K2Node_DynamicCast_AsHotta_Character) == 0x000020, "Member 'SetVelocityNS_C_Received_NotifyBegin::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'SetVelocityNS_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, CallFunc_GetTransform_ReturnValue) == 0x000030, "Member 'SetVelocityNS_C_Received_NotifyBegin::CallFunc_GetTransform_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, CallFunc_GetMovementComponent_ReturnValue) == 0x000060, "Member 'SetVelocityNS_C_Received_NotifyBegin::CallFunc_GetMovementComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, CallFunc_TransformDirection_ReturnValue) == 0x000068, "Member 'SetVelocityNS_C_Received_NotifyBegin::CallFunc_TransformDirection_ReturnValue' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, K2Node_DynamicCast_AsHotta_Character_Movement_Component) == 0x000078, "Member 'SetVelocityNS_C_Received_NotifyBegin::K2Node_DynamicCast_AsHotta_Character_Movement_Component' has a wrong offset!");
static_assert(offsetof(SetVelocityNS_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess_1) == 0x000080, "Member 'SetVelocityNS_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");

}

