#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SK_Wolf_Shake

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_Wolf_Shake.SK_Wolf_Shake_C
// 0x0C20 (0x0EE0 - 0x02C0)
class USK_Wolf_Shake_C final : public UAnimInstance
{
public:
	uint8                                         Pad_6CD3[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_1;                              // 0x02C8(0x0030)()
	struct FAnimNode_LinkedInputPose              AnimGraphNode_LinkedInputPose;                     // 0x02F8(0x0118)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x0410(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x0430(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_9;                        // 0x0450(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_8;                        // 0x0558(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_7;                        // 0x0660(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_6;                        // 0x0768(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_5;                        // 0x0870(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_4;                        // 0x0978(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_3;                        // 0x0A80(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2;                        // 0x0B88(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_1;                        // 0x0C90(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone;                          // 0x0D98(0x0108)()
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x0EA0(0x0030)()
	float                                         BlendAlpha;                                        // 0x0ED0(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         PushScale;                                         // 0x0ED4(0x0004)(BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SK_Wolf_Shake(int32 EntryPoint);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Shake_AnimGraphNode_ModifyBone_0013AD3A4FEA128D71ABDF96391B459B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Shake_AnimGraphNode_ModifyBone_C5912FC744156E7579E6FC92D0CD3085();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Shake_AnimGraphNode_ModifyBone_FFC05C2E4BE0135F3704B5A460AA550D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Shake_AnimGraphNode_ModifyBone_66DDC2C54D05FD41D2DFADBBFF12EF19();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Shake_AnimGraphNode_ModifyBone_BFF4195349B007B9F5FE3DAAC5944FE7();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Shake_AnimGraphNode_ModifyBone_6F65CE4543CC1DB788F8269A5349094D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Shake_AnimGraphNode_ModifyBone_45AF58894A3A638BEF35DF8AC12B5A34();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Shake_AnimGraphNode_ModifyBone_853591F34AD5F2D11FA4DDBF1F17B562();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Shake_AnimGraphNode_ModifyBone_891C2AE4414B8F27C220DEA31E361167();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_Wolf_Shake_AnimGraphNode_ModifyBone_0ED543CD48940CF0893C02B1557D5F77();
	void AnimGraph(struct FPoseLink* Param_AnimGraph);
	void BoneShakeLayer(const struct FPoseLink& InPose, float Param_PushScale, float Param_BlendAlpha, struct FPoseLink* Param_BoneShakeLayer);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_Wolf_Shake_C">();
	}
	static class USK_Wolf_Shake_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Wolf_Shake_C>();
	}
};
static_assert(alignof(USK_Wolf_Shake_C) == 0x000010, "Wrong alignment on USK_Wolf_Shake_C");
static_assert(sizeof(USK_Wolf_Shake_C) == 0x000EE0, "Wrong size on USK_Wolf_Shake_C");
static_assert(offsetof(USK_Wolf_Shake_C, UberGraphFrame) == 0x0002C0, "Member 'USK_Wolf_Shake_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_Root_1) == 0x0002C8, "Member 'USK_Wolf_Shake_C::AnimGraphNode_Root_1' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_LinkedInputPose) == 0x0002F8, "Member 'USK_Wolf_Shake_C::AnimGraphNode_LinkedInputPose' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_LocalToComponentSpace) == 0x000410, "Member 'USK_Wolf_Shake_C::AnimGraphNode_LocalToComponentSpace' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ComponentToLocalSpace) == 0x000430, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ComponentToLocalSpace' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ModifyBone_9) == 0x000450, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ModifyBone_9' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ModifyBone_8) == 0x000558, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ModifyBone_8' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ModifyBone_7) == 0x000660, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ModifyBone_7' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ModifyBone_6) == 0x000768, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ModifyBone_6' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ModifyBone_5) == 0x000870, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ModifyBone_5' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ModifyBone_4) == 0x000978, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ModifyBone_4' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ModifyBone_3) == 0x000A80, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ModifyBone_3' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ModifyBone_2) == 0x000B88, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ModifyBone_2' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ModifyBone_1) == 0x000C90, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ModifyBone_1' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_ModifyBone) == 0x000D98, "Member 'USK_Wolf_Shake_C::AnimGraphNode_ModifyBone' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, AnimGraphNode_Root) == 0x000EA0, "Member 'USK_Wolf_Shake_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, BlendAlpha) == 0x000ED0, "Member 'USK_Wolf_Shake_C::BlendAlpha' has a wrong offset!");
static_assert(offsetof(USK_Wolf_Shake_C, PushScale) == 0x000ED4, "Member 'USK_Wolf_Shake_C::PushScale' has a wrong offset!");

}

