#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint.SM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C
// 0x0160 (0x0420 - 0x02C0)
class USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C final : public UAnimInstance
{
public:
	uint8                                         Pad_6C88[0x8];                                     // 0x02B8(0x0008)(Fixing Size After Last Property [ Dumper-7 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x02C0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root;                                // 0x02C8(0x0030)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult;                         // 0x02F8(0x0030)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine;                        // 0x0328(0x00B0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot;                                // 0x03D8(0x0048)()

public:
	void ExecuteUbergraph_SM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint(int32 EntryPoint);
	void AnimGraph(struct FPoseLink* Param_AnimGraph);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C">();
	}
	static class USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C>();
	}
};
static_assert(alignof(USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C) == 0x000010, "Wrong alignment on USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C");
static_assert(sizeof(USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C) == 0x000420, "Wrong size on USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C");
static_assert(offsetof(USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C, UberGraphFrame) == 0x0002C0, "Member 'USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C, AnimGraphNode_Root) == 0x0002C8, "Member 'USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C::AnimGraphNode_Root' has a wrong offset!");
static_assert(offsetof(USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C, AnimGraphNode_StateResult) == 0x0002F8, "Member 'USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C::AnimGraphNode_StateResult' has a wrong offset!");
static_assert(offsetof(USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C, AnimGraphNode_StateMachine) == 0x000328, "Member 'USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C::AnimGraphNode_StateMachine' has a wrong offset!");
static_assert(offsetof(USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C, AnimGraphNode_Slot) == 0x0003D8, "Member 'USM_X_jianshiqi_01_Skin_Skeleton_AnimBlueprint_C::AnimGraphNode_Slot' has a wrong offset!");

}

