#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Snipe_PowerAttack_Aim

#include "Basic.hpp"


namespace SDK::Params
{

// Function Snipe_PowerAttack_Aim.Snipe_PowerAttack_Aim_C.HottaCalculateBaseMagnitude
// 0x0040 (0x0040 - 0x0000)
struct Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude final
{
public:
	const class AActor*                           OwnerActor;                                        // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           HitActor;                                          // 0x0008(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class AActor*                           InstigatorActor;                                   // 0x0010(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59B6[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59B7[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaGamePlayEffect*                   K2Node_DynamicCast_AsHotta_Game_Play_Effect;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue_2;            // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude) == 0x000008, "Wrong alignment on Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude");
static_assert(sizeof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude) == 0x000040, "Wrong size on Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, OwnerActor) == 0x000000, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::OwnerActor' has a wrong offset!");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, HitActor) == 0x000008, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::HitActor' has a wrong offset!");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, InstigatorActor) == 0x000010, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::InstigatorActor' has a wrong offset!");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, ReturnValue) == 0x000018, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::ReturnValue' has a wrong offset!");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000020, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_AsHotta_Game_Play_Effect) == 0x000030, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_AsHotta_Game_Play_Effect' has a wrong offset!");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, CallFunc_Less_FloatFloat_ReturnValue) == 0x000039, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::CallFunc_Less_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, CallFunc_Less_FloatFloat_ReturnValue_1) == 0x00003A, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::CallFunc_Less_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude, CallFunc_Less_FloatFloat_ReturnValue_2) == 0x00003B, "Member 'Snipe_PowerAttack_Aim_C_HottaCalculateBaseMagnitude::CallFunc_Less_FloatFloat_ReturnValue_2' has a wrong offset!");

}

