#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: SpearDefaultDamage_SSR

#include "Basic.hpp"


namespace SDK::Params
{

// Function SpearDefaultDamage_SSR.SpearDefaultDamage_SSR_C.CalcExtraDamage
// 0x0018 (0x0018 - 0x0000)
struct SpearDefaultDamage_SSR_C_CalcExtraDamage final
{
public:
	class AHottaCharacter*                        TargetActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAbilitySystemComponent*                SourceAbilityComp;                                 // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ReturnValue;                                       // 0x0010(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsInFloatingEffect_ReturnValue;           // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(SpearDefaultDamage_SSR_C_CalcExtraDamage) == 0x000008, "Wrong alignment on SpearDefaultDamage_SSR_C_CalcExtraDamage");
static_assert(sizeof(SpearDefaultDamage_SSR_C_CalcExtraDamage) == 0x000018, "Wrong size on SpearDefaultDamage_SSR_C_CalcExtraDamage");
static_assert(offsetof(SpearDefaultDamage_SSR_C_CalcExtraDamage, TargetActor) == 0x000000, "Member 'SpearDefaultDamage_SSR_C_CalcExtraDamage::TargetActor' has a wrong offset!");
static_assert(offsetof(SpearDefaultDamage_SSR_C_CalcExtraDamage, SourceAbilityComp) == 0x000008, "Member 'SpearDefaultDamage_SSR_C_CalcExtraDamage::SourceAbilityComp' has a wrong offset!");
static_assert(offsetof(SpearDefaultDamage_SSR_C_CalcExtraDamage, ReturnValue) == 0x000010, "Member 'SpearDefaultDamage_SSR_C_CalcExtraDamage::ReturnValue' has a wrong offset!");
static_assert(offsetof(SpearDefaultDamage_SSR_C_CalcExtraDamage, CallFunc_IsInFloatingEffect_ReturnValue) == 0x000014, "Member 'SpearDefaultDamage_SSR_C_CalcExtraDamage::CallFunc_IsInFloatingEffect_ReturnValue' has a wrong offset!");

}

