#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: StateSleep_mon_hum_009_AlwaysPeace

#include "Basic.hpp"


namespace SDK::Params
{

// Function StateSleep_mon_hum_009_AlwaysPeace.StateSleep_mon_hum_009_AlwaysPeace_C.ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace
// 0x0030 (0x0030 - 0x0000)
struct StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetStateElapsedTime_ReturnValue;          // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CCC[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AMon_hum_009_C*                         K2Node_DynamicCast_AsMon_Hum_009;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CCD[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetGameTimeSinceCreation_ReturnValue;     // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_FloatFloat_ReturnValue;           // 0x0024(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6CCE[0x3];                                     // 0x0025(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_PlayAnimMontageEx_ReturnValue;            // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_PlayAnimMontageEx_ReturnValue_1;          // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace) == 0x000008, "Wrong alignment on StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace");
static_assert(sizeof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace) == 0x000030, "Wrong size on StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace");
static_assert(offsetof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace, EntryPoint) == 0x000000, "Member 'StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace::EntryPoint' has a wrong offset!");
static_assert(offsetof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace, CallFunc_GetStateElapsedTime_ReturnValue) == 0x000004, "Member 'StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace::CallFunc_GetStateElapsedTime_ReturnValue' has a wrong offset!");
static_assert(offsetof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000008, "Member 'StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace, K2Node_DynamicCast_AsMon_Hum_009) == 0x000010, "Member 'StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace::K2Node_DynamicCast_AsMon_Hum_009' has a wrong offset!");
static_assert(offsetof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace, CallFunc_GetGameTimeSinceCreation_ReturnValue) == 0x00001C, "Member 'StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace::CallFunc_GetGameTimeSinceCreation_ReturnValue' has a wrong offset!");
static_assert(offsetof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000020, "Member 'StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace, CallFunc_Greater_FloatFloat_ReturnValue) == 0x000024, "Member 'StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace::CallFunc_Greater_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace, CallFunc_PlayAnimMontageEx_ReturnValue) == 0x000028, "Member 'StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace::CallFunc_PlayAnimMontageEx_ReturnValue' has a wrong offset!");
static_assert(offsetof(StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace, CallFunc_PlayAnimMontageEx_ReturnValue_1) == 0x00002C, "Member 'StateSleep_mon_hum_009_AlwaysPeace_C_ExecuteUbergraph_StateSleep_mon_hum_009_AlwaysPeace::CallFunc_PlayAnimMontageEx_ReturnValue_1' has a wrong offset!");

}

