#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TargetIsInCatching

#include "Basic.hpp"


namespace SDK::Params
{

// Function TargetIsInCatching.TargetIsInCatching_C.CanApplyGameplayEffectContent
// 0x0040 (0x0040 - 0x0000)
struct TargetIsInCatching_C_CanApplyGameplayEffectContent final
{
public:
	class AActor*                                 SourceActor;                                       // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 TargetActor;                                       // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 InstigatorActor;                                   // 0x0010(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	const class UGameplayEffect*                  GameplayEffect;                                    // 0x0018(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0020(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_588B[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        SourceHottaPlayerCharacter;                        // 0x0028(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGlidChargeAiming_ReturnValue;           // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsInSkateboardState_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x003E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x003F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TargetIsInCatching_C_CanApplyGameplayEffectContent) == 0x000008, "Wrong alignment on TargetIsInCatching_C_CanApplyGameplayEffectContent");
static_assert(sizeof(TargetIsInCatching_C_CanApplyGameplayEffectContent) == 0x000040, "Wrong size on TargetIsInCatching_C_CanApplyGameplayEffectContent");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, SourceActor) == 0x000000, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::SourceActor' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, TargetActor) == 0x000008, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::TargetActor' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, InstigatorActor) == 0x000010, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::InstigatorActor' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, GameplayEffect) == 0x000018, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::GameplayEffect' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, ReturnValue) == 0x000020, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, SourceHottaPlayerCharacter) == 0x000028, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::SourceHottaPlayerCharacter' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000030, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, CallFunc_IsGlidChargeAiming_ReturnValue) == 0x000039, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::CallFunc_IsGlidChargeAiming_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, CallFunc_Not_PreBool_ReturnValue) == 0x00003A, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, CallFunc_Not_PreBool_ReturnValue_1) == 0x00003B, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::CallFunc_Not_PreBool_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, CallFunc_IsInSkateboardState_ReturnValue) == 0x00003C, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::CallFunc_IsInSkateboardState_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, CallFunc_Not_PreBool_ReturnValue_2) == 0x00003D, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::CallFunc_Not_PreBool_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, CallFunc_BooleanAND_ReturnValue) == 0x00003E, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(TargetIsInCatching_C_CanApplyGameplayEffectContent, CallFunc_BooleanAND_ReturnValue_1) == 0x00003F, "Member 'TargetIsInCatching_C_CanApplyGameplayEffectContent::CallFunc_BooleanAND_ReturnValue_1' has a wrong offset!");

}

