#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskTriggerMinusclient

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function TaskTrigger-client.TaskTrigger-client_C.ExecuteUbergraph_TaskTrigger-client
// 0x00E8 (0x00E8 - 0x0000)
struct TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC8[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 K2Node_Event_OtherActor_1;                         // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DC9[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character;              // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCA[0x6];                                     // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCB[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCC[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLMountCharacter*                    K2Node_DynamicCast_AsQRSLMount_Character;          // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_3;                     // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCD[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaCharacter*                        K2Node_DynamicCast_AsHotta_Character_1;            // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_4;                     // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0071(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCE[0x6];                                     // 0x0072(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_2;       // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_5;                     // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DCF[0x7];                                     // 0x0081(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLMountCharacter*                    K2Node_DynamicCast_AsQRSLMount_Character_1;        // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_6;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0091(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0092(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DD0[0x5];                                     // 0x0093(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_3;       // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_7;                     // 0x00A0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode_1;               // 0x00A1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x00A2(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DD1[0x5];                                     // 0x00A3(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_1;   // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_2;   // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class FName& QuestID, class AHottaPlayerCharacter* ThePlayer)> K2Node_CreateDelegate_OutputDelegate;              // 0x00B8(0x0010)(ZeroConstructor, NoDestructor)
	class FName                                   K2Node_CustomEvent_QuestID;                        // 0x00C8(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  K2Node_CustomEvent_thePlayer;                      // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue_3;   // 0x00D8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient) == 0x000008, "Wrong alignment on TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient");
static_assert(sizeof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient) == 0x0000E8, "Wrong size on TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, EntryPoint) == 0x000000, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::EntryPoint' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000008, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_Event_OtherActor_1) == 0x000010, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_Event_OtherActor_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, CallFunc_SwitchNetMode_OutNetMode) == 0x000018, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_AsHotta_Character) == 0x000020, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_AsHotta_Character' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_SwitchEnum_CmpSuccess) == 0x000029, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000030, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_bSuccess_1) == 0x000038, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000040, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_bSuccess_2) == 0x000048, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_AsQRSLMount_Character) == 0x000050, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_AsQRSLMount_Character' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_bSuccess_3) == 0x000058, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_bSuccess_3' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_Event_OtherActor) == 0x000060, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_AsHotta_Character_1) == 0x000068, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_AsHotta_Character_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_bSuccess_4) == 0x000070, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_bSuccess_4' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, CallFunc_IsValid_ReturnValue) == 0x000071, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_AsQRSLPlayer_Character_2) == 0x000078, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_AsQRSLPlayer_Character_2' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_bSuccess_5) == 0x000080, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_bSuccess_5' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_AsQRSLMount_Character_1) == 0x000088, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_AsQRSLMount_Character_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_bSuccess_6) == 0x000090, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_bSuccess_6' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000091, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, CallFunc_IsValid_ReturnValue_1) == 0x000092, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_AsQRSLPlayer_Character_3) == 0x000098, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_AsQRSLPlayer_Character_3' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_DynamicCast_bSuccess_7) == 0x0000A0, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_DynamicCast_bSuccess_7' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, CallFunc_SwitchNetMode_OutNetMode_1) == 0x0000A1, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::CallFunc_SwitchNetMode_OutNetMode_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_SwitchEnum_CmpSuccess_1) == 0x0000A2, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, CallFunc_GetClientPlayerCharacter_ReturnValue_1) == 0x0000A8, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::CallFunc_GetClientPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, CallFunc_GetClientPlayerCharacter_ReturnValue_2) == 0x0000B0, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::CallFunc_GetClientPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_CreateDelegate_OutputDelegate) == 0x0000B8, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_CustomEvent_QuestID) == 0x0000C8, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_CustomEvent_QuestID' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, K2Node_CustomEvent_thePlayer) == 0x0000D0, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::K2Node_CustomEvent_thePlayer' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, CallFunc_GetClientPlayerCharacter_ReturnValue_3) == 0x0000D8, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::CallFunc_GetClientPlayerCharacter_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient, CallFunc_EqualEqual_ObjectObject_ReturnValue_1) == 0x0000E0, "Member 'TaskTriggerMinusclient_C_ExecuteUbergraph_TaskTriggerMinusclient::CallFunc_EqualEqual_ObjectObject_ReturnValue_1' has a wrong offset!");

// Function TaskTrigger-client.TaskTrigger-client_C.TryUpdateQuestProgess
// 0x0010 (0x0010 - 0x0000)
struct TaskTriggerMinusclient_C_TryUpdateQuestProgess final
{
public:
	class FName                                   QuestID;                                           // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  ThePlayer;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskTriggerMinusclient_C_TryUpdateQuestProgess) == 0x000008, "Wrong alignment on TaskTriggerMinusclient_C_TryUpdateQuestProgess");
static_assert(sizeof(TaskTriggerMinusclient_C_TryUpdateQuestProgess) == 0x000010, "Wrong size on TaskTriggerMinusclient_C_TryUpdateQuestProgess");
static_assert(offsetof(TaskTriggerMinusclient_C_TryUpdateQuestProgess, QuestID) == 0x000000, "Member 'TaskTriggerMinusclient_C_TryUpdateQuestProgess::QuestID' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_TryUpdateQuestProgess, ThePlayer) == 0x000008, "Member 'TaskTriggerMinusclient_C_TryUpdateQuestProgess::ThePlayer' has a wrong offset!");

// Function TaskTrigger-client.TaskTrigger-client_C.ReceiveActorEndOverlap
// 0x0008 (0x0008 - 0x0000)
struct TaskTriggerMinusclient_C_ReceiveActorEndOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskTriggerMinusclient_C_ReceiveActorEndOverlap) == 0x000008, "Wrong alignment on TaskTriggerMinusclient_C_ReceiveActorEndOverlap");
static_assert(sizeof(TaskTriggerMinusclient_C_ReceiveActorEndOverlap) == 0x000008, "Wrong size on TaskTriggerMinusclient_C_ReceiveActorEndOverlap");
static_assert(offsetof(TaskTriggerMinusclient_C_ReceiveActorEndOverlap, OtherActor) == 0x000000, "Member 'TaskTriggerMinusclient_C_ReceiveActorEndOverlap::OtherActor' has a wrong offset!");

// Function TaskTrigger-client.TaskTrigger-client_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct TaskTriggerMinusclient_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(TaskTriggerMinusclient_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on TaskTriggerMinusclient_C_ReceiveActorBeginOverlap");
static_assert(sizeof(TaskTriggerMinusclient_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on TaskTriggerMinusclient_C_ReceiveActorBeginOverlap");
static_assert(offsetof(TaskTriggerMinusclient_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'TaskTriggerMinusclient_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

// Function TaskTrigger-client.TaskTrigger-client_C.UpdateQuestProgress
// 0x0068 (0x0068 - 0x0000)
struct TaskTriggerMinusclient_C_UpdateQuestProgress final
{
public:
	class AHottaPlayerCharacter*                  PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AController*                            CallFunc_GetController_ReturnValue;                // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerController*                  K2Node_DynamicCast_AsQRSLPlayer_Controller;        // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DD2[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DD3[0x7];                                     // 0x0029(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLHUD*                               CallFunc_GetQRSLHUD_ReturnValue;                   // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0038(0x0018)()
	bool                                          CallFunc_EntryClientGroup_ReturnValue;             // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue;            // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_NotEqual_NameName_ReturnValue_1;          // 0x0052(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DD4[0x1];                                     // 0x0053(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMapPointInfo                          K2Node_MakeStruct_MapPointInfo;                    // 0x0054(0x000C)(NoDestructor)
	bool                                          CallFunc_UpdateQuestProgress_ReturnValue;          // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestObjectInProgress_ReturnValue;      // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TaskTriggerMinusclient_C_UpdateQuestProgress) == 0x000008, "Wrong alignment on TaskTriggerMinusclient_C_UpdateQuestProgress");
static_assert(sizeof(TaskTriggerMinusclient_C_UpdateQuestProgress) == 0x000068, "Wrong size on TaskTriggerMinusclient_C_UpdateQuestProgress");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, PlayerCharacter) == 0x000000, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, CallFunc_GetController_ReturnValue) == 0x000008, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::CallFunc_GetController_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, K2Node_DynamicCast_AsQRSLPlayer_Controller) == 0x000010, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::K2Node_DynamicCast_AsQRSLPlayer_Controller' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000020, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, K2Node_DynamicCast_bSuccess_1) == 0x000028, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, CallFunc_GetQRSLHUD_ReturnValue) == 0x000030, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::CallFunc_GetQRSLHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, CallFunc_GetEmptyText_ReturnValue) == 0x000038, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, CallFunc_EntryClientGroup_ReturnValue) == 0x000050, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::CallFunc_EntryClientGroup_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, CallFunc_NotEqual_NameName_ReturnValue) == 0x000051, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::CallFunc_NotEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, CallFunc_NotEqual_NameName_ReturnValue_1) == 0x000052, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::CallFunc_NotEqual_NameName_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, K2Node_MakeStruct_MapPointInfo) == 0x000054, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::K2Node_MakeStruct_MapPointInfo' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, CallFunc_UpdateQuestProgress_ReturnValue) == 0x000060, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::CallFunc_UpdateQuestProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(TaskTriggerMinusclient_C_UpdateQuestProgress, CallFunc_IsQuestObjectInProgress_ReturnValue) == 0x000061, "Member 'TaskTriggerMinusclient_C_UpdateQuestProgress::CallFunc_IsQuestObjectInProgress_ReturnValue' has a wrong offset!");

}

