#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TaskTriggerMinusclient

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass TaskTrigger-client.TaskTrigger-client_C
// 0x0050 (0x0290 - 0x0240)
class ATaskTriggerMinusclient_C final : public ATriggerBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   StartTask;                                         // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   ObjID;                                             // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 TargetClass;                                       // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ISBeginOverLap;                                    // 0x0260(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC5[0x7];                                     // 0x0261(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerCharacter*                   CurChar;                                           // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNeedPlayer;                                      // 0x0270(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC6[0x3];                                     // 0x0271(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ActiveTransferPointID;                             // 0x0274(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNeedCustomEntryGroup;                            // 0x027C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DC7[0x3];                                     // 0x027D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CustomEnterGroupName;                              // 0x0280(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsNeedFade;                                        // 0x0288(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_TaskTriggerMinusclient(int32 EntryPoint);
	void TryUpdateQuestProgess(const class FName& QuestID, class AHottaPlayerCharacter* ThePlayer);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void UpdateQuestProgress(class AHottaPlayerCharacter* PlayerCharacter);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"TaskTrigger-client_C">();
	}
	static class ATaskTriggerMinusclient_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATaskTriggerMinusclient_C>();
	}
};
static_assert(alignof(ATaskTriggerMinusclient_C) == 0x000008, "Wrong alignment on ATaskTriggerMinusclient_C");
static_assert(sizeof(ATaskTriggerMinusclient_C) == 0x000290, "Wrong size on ATaskTriggerMinusclient_C");
static_assert(offsetof(ATaskTriggerMinusclient_C, UberGraphFrame) == 0x000240, "Member 'ATaskTriggerMinusclient_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATaskTriggerMinusclient_C, StartTask) == 0x000248, "Member 'ATaskTriggerMinusclient_C::StartTask' has a wrong offset!");
static_assert(offsetof(ATaskTriggerMinusclient_C, ObjID) == 0x000250, "Member 'ATaskTriggerMinusclient_C::ObjID' has a wrong offset!");
static_assert(offsetof(ATaskTriggerMinusclient_C, TargetClass) == 0x000258, "Member 'ATaskTriggerMinusclient_C::TargetClass' has a wrong offset!");
static_assert(offsetof(ATaskTriggerMinusclient_C, ISBeginOverLap) == 0x000260, "Member 'ATaskTriggerMinusclient_C::ISBeginOverLap' has a wrong offset!");
static_assert(offsetof(ATaskTriggerMinusclient_C, CurChar) == 0x000268, "Member 'ATaskTriggerMinusclient_C::CurChar' has a wrong offset!");
static_assert(offsetof(ATaskTriggerMinusclient_C, IsNeedPlayer) == 0x000270, "Member 'ATaskTriggerMinusclient_C::IsNeedPlayer' has a wrong offset!");
static_assert(offsetof(ATaskTriggerMinusclient_C, ActiveTransferPointID) == 0x000274, "Member 'ATaskTriggerMinusclient_C::ActiveTransferPointID' has a wrong offset!");
static_assert(offsetof(ATaskTriggerMinusclient_C, IsNeedCustomEntryGroup) == 0x00027C, "Member 'ATaskTriggerMinusclient_C::IsNeedCustomEntryGroup' has a wrong offset!");
static_assert(offsetof(ATaskTriggerMinusclient_C, CustomEnterGroupName) == 0x000280, "Member 'ATaskTriggerMinusclient_C::CustomEnterGroupName' has a wrong offset!");
static_assert(offsetof(ATaskTriggerMinusclient_C, IsNeedFade) == 0x000288, "Member 'ATaskTriggerMinusclient_C::IsNeedFade' has a wrong offset!");

}

