#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TridentStats

#include "Basic.hpp"

#include "TridentStats_structs.hpp"


namespace SDK::Params
{

// Function TridentStats.TridentDeviceLibrary.GetBatteryInfo
// 0x0008 (0x0008 - 0x0000)
struct TridentDeviceLibrary_GetBatteryInfo final
{
public:
	struct FBatteryInfo                           ReturnValue;                                       // 0x0000(0x0008)(Parm, OutParm, ReturnParm, NoDestructor, NativeAccessSpecifierPublic)
};
static_assert(alignof(TridentDeviceLibrary_GetBatteryInfo) == 0x000004, "Wrong alignment on TridentDeviceLibrary_GetBatteryInfo");
static_assert(sizeof(TridentDeviceLibrary_GetBatteryInfo) == 0x000008, "Wrong size on TridentDeviceLibrary_GetBatteryInfo");
static_assert(offsetof(TridentDeviceLibrary_GetBatteryInfo, ReturnValue) == 0x000000, "Member 'TridentDeviceLibrary_GetBatteryInfo::ReturnValue' has a wrong offset!");

// Function TridentStats.TridentDeviceLibrary.ShowAllCPUThermalSensor
// 0x0010 (0x0010 - 0x0000)
struct TridentDeviceLibrary_ShowAllCPUThermalSensor final
{
public:
	TArray<class FString>                         ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, NativeAccessSpecifierPublic)
};
static_assert(alignof(TridentDeviceLibrary_ShowAllCPUThermalSensor) == 0x000008, "Wrong alignment on TridentDeviceLibrary_ShowAllCPUThermalSensor");
static_assert(sizeof(TridentDeviceLibrary_ShowAllCPUThermalSensor) == 0x000010, "Wrong size on TridentDeviceLibrary_ShowAllCPUThermalSensor");
static_assert(offsetof(TridentDeviceLibrary_ShowAllCPUThermalSensor, ReturnValue) == 0x000000, "Member 'TridentDeviceLibrary_ShowAllCPUThermalSensor::ReturnValue' has a wrong offset!");

// Function TridentStats.TridentStatsBlueprintLibrary.Base64ConvertImgae
// 0x0020 (0x0020 - 0x0000)
struct TridentStatsBlueprintLibrary_Base64ConvertImgae final
{
public:
	class FString                                 InBase64String;                                    // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InImgPath;                                         // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TridentStatsBlueprintLibrary_Base64ConvertImgae) == 0x000008, "Wrong alignment on TridentStatsBlueprintLibrary_Base64ConvertImgae");
static_assert(sizeof(TridentStatsBlueprintLibrary_Base64ConvertImgae) == 0x000020, "Wrong size on TridentStatsBlueprintLibrary_Base64ConvertImgae");
static_assert(offsetof(TridentStatsBlueprintLibrary_Base64ConvertImgae, InBase64String) == 0x000000, "Member 'TridentStatsBlueprintLibrary_Base64ConvertImgae::InBase64String' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_Base64ConvertImgae, InImgPath) == 0x000010, "Member 'TridentStatsBlueprintLibrary_Base64ConvertImgae::InImgPath' has a wrong offset!");

// Function TridentStats.TridentStatsBlueprintLibrary.GetTridentPointFrameInterval
// 0x0004 (0x0004 - 0x0000)
struct TridentStatsBlueprintLibrary_GetTridentPointFrameInterval final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TridentStatsBlueprintLibrary_GetTridentPointFrameInterval) == 0x000004, "Wrong alignment on TridentStatsBlueprintLibrary_GetTridentPointFrameInterval");
static_assert(sizeof(TridentStatsBlueprintLibrary_GetTridentPointFrameInterval) == 0x000004, "Wrong size on TridentStatsBlueprintLibrary_GetTridentPointFrameInterval");
static_assert(offsetof(TridentStatsBlueprintLibrary_GetTridentPointFrameInterval, ReturnValue) == 0x000000, "Member 'TridentStatsBlueprintLibrary_GetTridentPointFrameInterval::ReturnValue' has a wrong offset!");

// Function TridentStats.TridentStatsBlueprintLibrary.GetTridentRemarkMsg
// 0x0010 (0x0010 - 0x0000)
struct TridentStatsBlueprintLibrary_GetTridentRemarkMsg final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TridentStatsBlueprintLibrary_GetTridentRemarkMsg) == 0x000008, "Wrong alignment on TridentStatsBlueprintLibrary_GetTridentRemarkMsg");
static_assert(sizeof(TridentStatsBlueprintLibrary_GetTridentRemarkMsg) == 0x000010, "Wrong size on TridentStatsBlueprintLibrary_GetTridentRemarkMsg");
static_assert(offsetof(TridentStatsBlueprintLibrary_GetTridentRemarkMsg, ReturnValue) == 0x000000, "Member 'TridentStatsBlueprintLibrary_GetTridentRemarkMsg::ReturnValue' has a wrong offset!");

// Function TridentStats.TridentStatsBlueprintLibrary.GetTridentScreenShotInterval
// 0x0004 (0x0004 - 0x0000)
struct TridentStatsBlueprintLibrary_GetTridentScreenShotInterval final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TridentStatsBlueprintLibrary_GetTridentScreenShotInterval) == 0x000004, "Wrong alignment on TridentStatsBlueprintLibrary_GetTridentScreenShotInterval");
static_assert(sizeof(TridentStatsBlueprintLibrary_GetTridentScreenShotInterval) == 0x000004, "Wrong size on TridentStatsBlueprintLibrary_GetTridentScreenShotInterval");
static_assert(offsetof(TridentStatsBlueprintLibrary_GetTridentScreenShotInterval, ReturnValue) == 0x000000, "Member 'TridentStatsBlueprintLibrary_GetTridentScreenShotInterval::ReturnValue' has a wrong offset!");

// Function TridentStats.TridentStatsBlueprintLibrary.GetTridentScreenShotMinRes
// 0x0004 (0x0004 - 0x0000)
struct TridentStatsBlueprintLibrary_GetTridentScreenShotMinRes final
{
public:
	int32                                         ReturnValue;                                       // 0x0000(0x0004)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TridentStatsBlueprintLibrary_GetTridentScreenShotMinRes) == 0x000004, "Wrong alignment on TridentStatsBlueprintLibrary_GetTridentScreenShotMinRes");
static_assert(sizeof(TridentStatsBlueprintLibrary_GetTridentScreenShotMinRes) == 0x000004, "Wrong size on TridentStatsBlueprintLibrary_GetTridentScreenShotMinRes");
static_assert(offsetof(TridentStatsBlueprintLibrary_GetTridentScreenShotMinRes, ReturnValue) == 0x000000, "Member 'TridentStatsBlueprintLibrary_GetTridentScreenShotMinRes::ReturnValue' has a wrong offset!");

// Function TridentStats.TridentStatsBlueprintLibrary.GetTridentUrl
// 0x0010 (0x0010 - 0x0000)
struct TridentStatsBlueprintLibrary_GetTridentUrl final
{
public:
	class FString                                 ReturnValue;                                       // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor, ReturnParm, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(TridentStatsBlueprintLibrary_GetTridentUrl) == 0x000008, "Wrong alignment on TridentStatsBlueprintLibrary_GetTridentUrl");
static_assert(sizeof(TridentStatsBlueprintLibrary_GetTridentUrl) == 0x000010, "Wrong size on TridentStatsBlueprintLibrary_GetTridentUrl");
static_assert(offsetof(TridentStatsBlueprintLibrary_GetTridentUrl, ReturnValue) == 0x000000, "Member 'TridentStatsBlueprintLibrary_GetTridentUrl::ReturnValue' has a wrong offset!");

// Function TridentStats.TridentStatsBlueprintLibrary.InitTridentData
// 0x0058 (0x0058 - 0x0000)
struct TridentStatsBlueprintLibrary_InitTridentData final
{
public:
	class FString                                 InAppID;                                           // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InAppVersion;                                      // 0x0010(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InAppProgramVersion;                               // 0x0020(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InAppResVersion;                                   // 0x0030(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                 InCustomMsg;                                       // 0x0040(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0050(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A41[0x7];                                     // 0x0051(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TridentStatsBlueprintLibrary_InitTridentData) == 0x000008, "Wrong alignment on TridentStatsBlueprintLibrary_InitTridentData");
static_assert(sizeof(TridentStatsBlueprintLibrary_InitTridentData) == 0x000058, "Wrong size on TridentStatsBlueprintLibrary_InitTridentData");
static_assert(offsetof(TridentStatsBlueprintLibrary_InitTridentData, InAppID) == 0x000000, "Member 'TridentStatsBlueprintLibrary_InitTridentData::InAppID' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_InitTridentData, InAppVersion) == 0x000010, "Member 'TridentStatsBlueprintLibrary_InitTridentData::InAppVersion' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_InitTridentData, InAppProgramVersion) == 0x000020, "Member 'TridentStatsBlueprintLibrary_InitTridentData::InAppProgramVersion' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_InitTridentData, InAppResVersion) == 0x000030, "Member 'TridentStatsBlueprintLibrary_InitTridentData::InAppResVersion' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_InitTridentData, InCustomMsg) == 0x000040, "Member 'TridentStatsBlueprintLibrary_InitTridentData::InCustomMsg' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_InitTridentData, ReturnValue) == 0x000050, "Member 'TridentStatsBlueprintLibrary_InitTridentData::ReturnValue' has a wrong offset!");

// Function TridentStats.TridentStatsBlueprintLibrary.TakeCustomScreenshot
// 0x0018 (0x0018 - 0x0000)
struct TridentStatsBlueprintLibrary_TakeCustomScreenshot final
{
public:
	class FString                                 InScreenshotFile;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMinScreenshotResolution;                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A42[0x3];                                     // 0x0015(0x0003)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TridentStatsBlueprintLibrary_TakeCustomScreenshot) == 0x000008, "Wrong alignment on TridentStatsBlueprintLibrary_TakeCustomScreenshot");
static_assert(sizeof(TridentStatsBlueprintLibrary_TakeCustomScreenshot) == 0x000018, "Wrong size on TridentStatsBlueprintLibrary_TakeCustomScreenshot");
static_assert(offsetof(TridentStatsBlueprintLibrary_TakeCustomScreenshot, InScreenshotFile) == 0x000000, "Member 'TridentStatsBlueprintLibrary_TakeCustomScreenshot::InScreenshotFile' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_TakeCustomScreenshot, InMinScreenshotResolution) == 0x000010, "Member 'TridentStatsBlueprintLibrary_TakeCustomScreenshot::InMinScreenshotResolution' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_TakeCustomScreenshot, ReturnValue) == 0x000014, "Member 'TridentStatsBlueprintLibrary_TakeCustomScreenshot::ReturnValue' has a wrong offset!");

// Function TridentStats.TridentStatsBlueprintLibrary.TakeCustomScreenshotJpg
// 0x0020 (0x0020 - 0x0000)
struct TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg final
{
public:
	class FString                                 InScreenshotFile;                                  // 0x0000(0x0010)(Parm, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InMinScreenshotResolution;                         // 0x0010(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                         InQuality;                                         // 0x0014(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                          ReturnValue;                                       // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                         Pad_1A43[0x7];                                     // 0x0019(0x0007)(Fixing Struct Size After Last Property [ Dumper-7 ])
};
static_assert(alignof(TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg) == 0x000008, "Wrong alignment on TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg");
static_assert(sizeof(TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg) == 0x000020, "Wrong size on TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg");
static_assert(offsetof(TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg, InScreenshotFile) == 0x000000, "Member 'TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg::InScreenshotFile' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg, InMinScreenshotResolution) == 0x000010, "Member 'TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg::InMinScreenshotResolution' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg, InQuality) == 0x000014, "Member 'TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg::InQuality' has a wrong offset!");
static_assert(offsetof(TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg, ReturnValue) == 0x000018, "Member 'TridentStatsBlueprintLibrary_TakeCustomScreenshotJpg::ReturnValue' has a wrong offset!");

}

