#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TridentStats

#include "Basic.hpp"

#include "Engine_classes.hpp"
#include "CoreUObject_classes.hpp"


namespace SDK
{

// Class TridentStats.TridentDeviceLibrary
// 0x0000 (0x0028 - 0x0028)
class UTridentDeviceLibrary final : public UBlueprintFunctionLibrary
{
public:
	static struct FBatteryInfo GetBatteryInfo();
	static TArray<class FString> ShowAllCPUThermalSensor();

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TridentDeviceLibrary">();
	}
	static class UTridentDeviceLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTridentDeviceLibrary>();
	}
};
static_assert(alignof(UTridentDeviceLibrary) == 0x000008, "Wrong alignment on UTridentDeviceLibrary");
static_assert(sizeof(UTridentDeviceLibrary) == 0x000028, "Wrong size on UTridentDeviceLibrary");

// Class TridentStats.TridentStatsBlueprintLibrary
// 0x0000 (0x0028 - 0x0028)
class UTridentStatsBlueprintLibrary final : public UBlueprintFunctionLibrary
{
public:
	static void Base64ConvertImgae(const class FString& InBase64String, const class FString& InImgPath);
	static int32 GetTridentPointFrameInterval();
	static class FString GetTridentRemarkMsg();
	static int32 GetTridentScreenShotInterval();
	static int32 GetTridentScreenShotMinRes();
	static class FString GetTridentUrl();
	static bool InitTridentData(const class FString& InAppID, const class FString& InAppVersion, const class FString& InAppProgramVersion, const class FString& InAppResVersion, const class FString& InCustomMsg);
	static bool TakeCustomScreenshot(const class FString& InScreenshotFile, int32 InMinScreenshotResolution);
	static bool TakeCustomScreenshotJpg(const class FString& InScreenshotFile, int32 InMinScreenshotResolution, int32 InQuality);

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TridentStatsBlueprintLibrary">();
	}
	static class UTridentStatsBlueprintLibrary* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTridentStatsBlueprintLibrary>();
	}
};
static_assert(alignof(UTridentStatsBlueprintLibrary) == 0x000008, "Wrong alignment on UTridentStatsBlueprintLibrary");
static_assert(sizeof(UTridentStatsBlueprintLibrary) == 0x000028, "Wrong size on UTridentStatsBlueprintLibrary");

// Class TridentStats.TridentStatsManager
// 0x00D0 (0x00F8 - 0x0028)
class UTridentStatsManager final : public UObject
{
public:
	uint8                                         Pad_1A44[0xD0];                                    // 0x0028(0x00D0)(Fixing Struct Size After Last Property [ Dumper-7 ])

public:
	static class UClass* StaticClass()
	{
		return StaticClassImpl<"TridentStatsManager">();
	}
	static class UTridentStatsManager* GetDefaultObj()
	{
		return GetDefaultObjImpl<UTridentStatsManager>();
	}
};
static_assert(alignof(UTridentStatsManager) == 0x000008, "Wrong alignment on UTridentStatsManager");
static_assert(sizeof(UTridentStatsManager) == 0x0000F8, "Wrong size on UTridentStatsManager");

}

