#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Triggerbox_questupdate

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function triggerbox_questupdate.triggerbox_questupdate_C.ExecuteUbergraph_triggerbox_questupdate
// 0x0078 (0x0078 - 0x0000)
struct Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C99[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_GetEmptyText_ReturnValue;                 // 0x0008(0x0018)()
	class AActor*                                 K2Node_Event_OtherActor;                           // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestObjectInProgress_ReturnValue;      // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_UpdateQuestProgress_ReturnValue;          // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaNetMode                                 CallFunc_SwitchNetMode_OutNetMode;                 // 0x0033(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6C9A[0x4];                                     // 0x0034(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9B[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerController*                 CallFunc_GetHottaPlayerController_ReturnValue;     // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9C[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLPlayerController*                  K2Node_DynamicCast_AsQRSLPlayer_Controller;        // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C9D[0x7];                                     // 0x0061(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLHUD*                               CallFunc_GetQRSLHUD_ReturnValue;                   // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate) == 0x000008, "Wrong alignment on Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate");
static_assert(sizeof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate) == 0x000078, "Wrong size on Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, EntryPoint) == 0x000000, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::EntryPoint' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, CallFunc_GetEmptyText_ReturnValue) == 0x000008, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::CallFunc_GetEmptyText_ReturnValue' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, K2Node_Event_OtherActor) == 0x000020, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::K2Node_Event_OtherActor' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000028, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, CallFunc_IsQuestObjectInProgress_ReturnValue) == 0x000031, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::CallFunc_IsQuestObjectInProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, CallFunc_UpdateQuestProgress_ReturnValue) == 0x000032, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::CallFunc_UpdateQuestProgress_ReturnValue' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, CallFunc_SwitchNetMode_OutNetMode) == 0x000033, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::CallFunc_SwitchNetMode_OutNetMode' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000038, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, K2Node_SwitchEnum_CmpSuccess) == 0x000040, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, CallFunc_GetHottaPlayerController_ReturnValue) == 0x000048, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::CallFunc_GetHottaPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, CallFunc_EqualEqual_ObjectObject_ReturnValue) == 0x000050, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::CallFunc_EqualEqual_ObjectObject_ReturnValue' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, K2Node_DynamicCast_AsQRSLPlayer_Controller) == 0x000058, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::K2Node_DynamicCast_AsQRSLPlayer_Controller' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, K2Node_DynamicCast_bSuccess_1) == 0x000060, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, CallFunc_GetQRSLHUD_ReturnValue) == 0x000068, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::CallFunc_GetQRSLHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate, CallFunc_IsValid_ReturnValue) == 0x000070, "Member 'Triggerbox_questupdate_C_ExecuteUbergraph_triggerbox_questupdate::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function triggerbox_questupdate.triggerbox_questupdate_C.ReceiveActorBeginOverlap
// 0x0008 (0x0008 - 0x0000)
struct Triggerbox_questupdate_C_ReceiveActorBeginOverlap final
{
public:
	class AActor*                                 OtherActor;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(Triggerbox_questupdate_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong alignment on Triggerbox_questupdate_C_ReceiveActorBeginOverlap");
static_assert(sizeof(Triggerbox_questupdate_C_ReceiveActorBeginOverlap) == 0x000008, "Wrong size on Triggerbox_questupdate_C_ReceiveActorBeginOverlap");
static_assert(offsetof(Triggerbox_questupdate_C_ReceiveActorBeginOverlap, OtherActor) == 0x000000, "Member 'Triggerbox_questupdate_C_ReceiveActorBeginOverlap::OtherActor' has a wrong offset!");

}

