#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: TriggerSprintingNS

#include "Basic.hpp"


namespace SDK::Params
{

// Function TriggerSprintingNS.TriggerSprintingNS_C.Received_NotifyBegin
// 0x0038 (0x0038 - 0x0000)
struct TriggerSprintingNS_C_Received_NotifyBegin final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         TotalDuration;                                     // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0014(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55EC[0x3];                                     // 0x0015(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55ED[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUnderWater_ReturnValue;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerSprintingNS_C_Received_NotifyBegin) == 0x000008, "Wrong alignment on TriggerSprintingNS_C_Received_NotifyBegin");
static_assert(sizeof(TriggerSprintingNS_C_Received_NotifyBegin) == 0x000038, "Wrong size on TriggerSprintingNS_C_Received_NotifyBegin");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyBegin, MeshComp) == 0x000000, "Member 'TriggerSprintingNS_C_Received_NotifyBegin::MeshComp' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyBegin, Animation) == 0x000008, "Member 'TriggerSprintingNS_C_Received_NotifyBegin::Animation' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyBegin, TotalDuration) == 0x000010, "Member 'TriggerSprintingNS_C_Received_NotifyBegin::TotalDuration' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyBegin, ReturnValue) == 0x000014, "Member 'TriggerSprintingNS_C_Received_NotifyBegin::ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyBegin, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'TriggerSprintingNS_C_Received_NotifyBegin::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyBegin, CallFunc_IsLocalClientRole_ReturnValue) == 0x000020, "Member 'TriggerSprintingNS_C_Received_NotifyBegin::CallFunc_IsLocalClientRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyBegin, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000028, "Member 'TriggerSprintingNS_C_Received_NotifyBegin::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyBegin, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TriggerSprintingNS_C_Received_NotifyBegin::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyBegin, CallFunc_IsUnderWater_ReturnValue) == 0x000031, "Member 'TriggerSprintingNS_C_Received_NotifyBegin::CallFunc_IsUnderWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyBegin, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'TriggerSprintingNS_C_Received_NotifyBegin::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

// Function TriggerSprintingNS.TriggerSprintingNS_C.Received_NotifyEnd
// 0x0038 (0x0038 - 0x0000)
struct TriggerSprintingNS_C_Received_NotifyEnd final
{
public:
	class USkeletalMeshComponent*                 MeshComp;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimSequenceBase*                      Animation;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0010(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55EE[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_55EF[0x7];                                     // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsUnderWater_ReturnValue;                 // 0x0031(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0032(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(TriggerSprintingNS_C_Received_NotifyEnd) == 0x000008, "Wrong alignment on TriggerSprintingNS_C_Received_NotifyEnd");
static_assert(sizeof(TriggerSprintingNS_C_Received_NotifyEnd) == 0x000038, "Wrong size on TriggerSprintingNS_C_Received_NotifyEnd");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyEnd, MeshComp) == 0x000000, "Member 'TriggerSprintingNS_C_Received_NotifyEnd::MeshComp' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyEnd, Animation) == 0x000008, "Member 'TriggerSprintingNS_C_Received_NotifyEnd::Animation' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyEnd, ReturnValue) == 0x000010, "Member 'TriggerSprintingNS_C_Received_NotifyEnd::ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyEnd, CallFunc_GetOwner_ReturnValue) == 0x000018, "Member 'TriggerSprintingNS_C_Received_NotifyEnd::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyEnd, CallFunc_IsLocalClientRole_ReturnValue) == 0x000020, "Member 'TriggerSprintingNS_C_Received_NotifyEnd::CallFunc_IsLocalClientRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyEnd, K2Node_DynamicCast_AsHotta_Player_Character) == 0x000028, "Member 'TriggerSprintingNS_C_Received_NotifyEnd::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyEnd, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'TriggerSprintingNS_C_Received_NotifyEnd::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyEnd, CallFunc_IsUnderWater_ReturnValue) == 0x000031, "Member 'TriggerSprintingNS_C_Received_NotifyEnd::CallFunc_IsUnderWater_ReturnValue' has a wrong offset!");
static_assert(offsetof(TriggerSprintingNS_C_Received_NotifyEnd, CallFunc_Not_PreBool_ReturnValue) == 0x000032, "Member 'TriggerSprintingNS_C_Received_NotifyEnd::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");

}

