#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Triggerbox_questupdate

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass triggerbox_questupdate.triggerbox_questupdate_C
// 0x0030 (0x0270 - 0x0240)
class ATriggerbox_questupdate_C final : public ATriggerBox
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                   IsQuestInProgress;                                 // 0x0248(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   IsQuestObjectInProgress;                           // 0x0250(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UpdateQuestID;                                     // 0x0258(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   UpdateQuestIDObject;                               // 0x0260(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          NeedBlackFade;                                     // 0x0268(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C98[0x3];                                     // 0x0269(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BlackFadeDelay;                                    // 0x026C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_triggerbox_questupdate(int32 EntryPoint);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"triggerbox_questupdate_C">();
	}
	static class ATriggerbox_questupdate_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ATriggerbox_questupdate_C>();
	}
};
static_assert(alignof(ATriggerbox_questupdate_C) == 0x000008, "Wrong alignment on ATriggerbox_questupdate_C");
static_assert(sizeof(ATriggerbox_questupdate_C) == 0x000270, "Wrong size on ATriggerbox_questupdate_C");
static_assert(offsetof(ATriggerbox_questupdate_C, UberGraphFrame) == 0x000240, "Member 'ATriggerbox_questupdate_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(ATriggerbox_questupdate_C, IsQuestInProgress) == 0x000248, "Member 'ATriggerbox_questupdate_C::IsQuestInProgress' has a wrong offset!");
static_assert(offsetof(ATriggerbox_questupdate_C, IsQuestObjectInProgress) == 0x000250, "Member 'ATriggerbox_questupdate_C::IsQuestObjectInProgress' has a wrong offset!");
static_assert(offsetof(ATriggerbox_questupdate_C, UpdateQuestID) == 0x000258, "Member 'ATriggerbox_questupdate_C::UpdateQuestID' has a wrong offset!");
static_assert(offsetof(ATriggerbox_questupdate_C, UpdateQuestIDObject) == 0x000260, "Member 'ATriggerbox_questupdate_C::UpdateQuestIDObject' has a wrong offset!");
static_assert(offsetof(ATriggerbox_questupdate_C, NeedBlackFade) == 0x000268, "Member 'ATriggerbox_questupdate_C::NeedBlackFade' has a wrong offset!");
static_assert(offsetof(ATriggerbox_questupdate_C, BlackFadeDelay) == 0x00026C, "Member 'ATriggerbox_questupdate_C::BlackFadeDelay' has a wrong offset!");

}

