#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ArtifactSkillPanel_pc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ArtifactSkillPanel_pc.UI_ArtifactSkillPanel_pc_C
// 0x0128 (0x0B68 - 0x0A40)
class UUI_ArtifactSkillPanel_pc_C final : public UQRSLUI_ArtifactSkillPanel
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0A40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Mingzou2;                                          // 0x0A48(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       Mingzou;                                           // 0x0A50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UArtifactSkillCoolDownButton_C*         ArtifactSkillButton01;                             // 0x0A58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArtifactSkillCoolDownButton_C*         ArtifactSkillButton02;                             // 0x0A60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArtifactSkillCoolDownButton_C*         ArtifactSkillButton03;                             // 0x0A68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ArtifactAmount_1;                      // 0x0A70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_ArtifactAmount_2;                      // 0x0A78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_FixedArtifactAmount_1;                 // 0x0A80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Skill_1;                               // 0x0A88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Skill_2;                               // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Skill_3;                               // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_AttackJoystick_BP_C*                FixedArtifactButtonSlot1;                          // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UArtifactSkillCoolDownButton_C*         FixedArtifactSkillButton01;                        // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_114;                                         // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_ys_3;                                        // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageElementIcon_3;                                // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           MPH_Skill_3;                                       // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key;                                            // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_1;                                          // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_2;                                          // 0x0B00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_3;                                          // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_44;                                         // 0x0B10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_108;                                        // 0x0B18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_142;                                        // 0x0B20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QualityImg_1;                                      // 0x0B28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QualityImg_2;                                      // 0x0B30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 QualityImg_3;                                      // 0x0B38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0B40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ArtifactAmount_1;                        // 0x0B48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_ArtifactAmount_2;                        // 0x0B50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             TextBlock_FixedArtifactAmount_1;                   // 0x0B58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 UI_zouming_weapon_bg1_1;                           // 0x0B60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_ArtifactSkillPanel_pc(int32 EntryPoint);
	void OnRefreshGuide();
	void CustomEvent_0(bool bInPeace);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void __I___0(class UHottaCDManagerComponent* CDManagerComponent, const class FString& CDName);
	void BPOnGamepadInputChanged(bool bGamepad);
	void SequenceEvent_0();
	void ShowArtifactGuide();
	void SequenceEvent__ENTRYPOINTUI_ArtifactSkillPanel_pc_0();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ArtifactSkillPanel_pc_C">();
	}
	static class UUI_ArtifactSkillPanel_pc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ArtifactSkillPanel_pc_C>();
	}
};
static_assert(alignof(UUI_ArtifactSkillPanel_pc_C) == 0x000008, "Wrong alignment on UUI_ArtifactSkillPanel_pc_C");
static_assert(sizeof(UUI_ArtifactSkillPanel_pc_C) == 0x000B68, "Wrong size on UUI_ArtifactSkillPanel_pc_C");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, UberGraphFrame) == 0x000A40, "Member 'UUI_ArtifactSkillPanel_pc_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, Mingzou2) == 0x000A48, "Member 'UUI_ArtifactSkillPanel_pc_C::Mingzou2' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, Mingzou) == 0x000A50, "Member 'UUI_ArtifactSkillPanel_pc_C::Mingzou' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, ArtifactSkillButton01) == 0x000A58, "Member 'UUI_ArtifactSkillPanel_pc_C::ArtifactSkillButton01' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, ArtifactSkillButton02) == 0x000A60, "Member 'UUI_ArtifactSkillPanel_pc_C::ArtifactSkillButton02' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, ArtifactSkillButton03) == 0x000A68, "Member 'UUI_ArtifactSkillPanel_pc_C::ArtifactSkillButton03' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, CanvasPanel_ArtifactAmount_1) == 0x000A70, "Member 'UUI_ArtifactSkillPanel_pc_C::CanvasPanel_ArtifactAmount_1' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, CanvasPanel_ArtifactAmount_2) == 0x000A78, "Member 'UUI_ArtifactSkillPanel_pc_C::CanvasPanel_ArtifactAmount_2' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, CanvasPanel_FixedArtifactAmount_1) == 0x000A80, "Member 'UUI_ArtifactSkillPanel_pc_C::CanvasPanel_FixedArtifactAmount_1' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, CanvasPanel_Skill_1) == 0x000A88, "Member 'UUI_ArtifactSkillPanel_pc_C::CanvasPanel_Skill_1' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, CanvasPanel_Skill_2) == 0x000A90, "Member 'UUI_ArtifactSkillPanel_pc_C::CanvasPanel_Skill_2' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, CanvasPanel_Skill_3) == 0x000A98, "Member 'UUI_ArtifactSkillPanel_pc_C::CanvasPanel_Skill_3' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, FixedArtifactButtonSlot1) == 0x000AA0, "Member 'UUI_ArtifactSkillPanel_pc_C::FixedArtifactButtonSlot1' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, FixedArtifactSkillButton01) == 0x000AA8, "Member 'UUI_ArtifactSkillPanel_pc_C::FixedArtifactSkillButton01' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, Image) == 0x000AB0, "Member 'UUI_ArtifactSkillPanel_pc_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, Image_1) == 0x000AB8, "Member 'UUI_ArtifactSkillPanel_pc_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, Image_2) == 0x000AC0, "Member 'UUI_ArtifactSkillPanel_pc_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, Image_3) == 0x000AC8, "Member 'UUI_ArtifactSkillPanel_pc_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, Image_114) == 0x000AD0, "Member 'UUI_ArtifactSkillPanel_pc_C::Image_114' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, Image_ys_3) == 0x000AD8, "Member 'UUI_ArtifactSkillPanel_pc_C::Image_ys_3' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, ImageElementIcon_3) == 0x000AE0, "Member 'UUI_ArtifactSkillPanel_pc_C::ImageElementIcon_3' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, MPH_Skill_3) == 0x000AE8, "Member 'UUI_ArtifactSkillPanel_pc_C::MPH_Skill_3' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, PC_Key) == 0x000AF0, "Member 'UUI_ArtifactSkillPanel_pc_C::PC_Key' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, PC_Key_1) == 0x000AF8, "Member 'UUI_ArtifactSkillPanel_pc_C::PC_Key_1' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, PC_Key_2) == 0x000B00, "Member 'UUI_ArtifactSkillPanel_pc_C::PC_Key_2' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, PC_Key_3) == 0x000B08, "Member 'UUI_ArtifactSkillPanel_pc_C::PC_Key_3' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, PC_Key_44) == 0x000B10, "Member 'UUI_ArtifactSkillPanel_pc_C::PC_Key_44' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, PC_Key_108) == 0x000B18, "Member 'UUI_ArtifactSkillPanel_pc_C::PC_Key_108' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, PC_Key_142) == 0x000B20, "Member 'UUI_ArtifactSkillPanel_pc_C::PC_Key_142' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, QualityImg_1) == 0x000B28, "Member 'UUI_ArtifactSkillPanel_pc_C::QualityImg_1' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, QualityImg_2) == 0x000B30, "Member 'UUI_ArtifactSkillPanel_pc_C::QualityImg_2' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, QualityImg_3) == 0x000B38, "Member 'UUI_ArtifactSkillPanel_pc_C::QualityImg_3' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, SafeZone_0) == 0x000B40, "Member 'UUI_ArtifactSkillPanel_pc_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, TextBlock_ArtifactAmount_1) == 0x000B48, "Member 'UUI_ArtifactSkillPanel_pc_C::TextBlock_ArtifactAmount_1' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, TextBlock_ArtifactAmount_2) == 0x000B50, "Member 'UUI_ArtifactSkillPanel_pc_C::TextBlock_ArtifactAmount_2' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, TextBlock_FixedArtifactAmount_1) == 0x000B58, "Member 'UUI_ArtifactSkillPanel_pc_C::TextBlock_FixedArtifactAmount_1' has a wrong offset!");
static_assert(offsetof(UUI_ArtifactSkillPanel_pc_C, UI_zouming_weapon_bg1_1) == 0x000B60, "Member 'UUI_ArtifactSkillPanel_pc_C::UI_zouming_weapon_bg1_1' has a wrong offset!");

}

