#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_AbilityScore_BP

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_AbilityScore_BP.UI_AbilityScore_BP_C
// 0x0018 (0x0890 - 0x0878)
class UUI_AbilityScore_BP_C final : public UQRSLUI_AbilityScore
{
public:
	class UImage*                                 Image_0;                                           // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle_256;                                    // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle_257;                                    // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_AbilityScore_BP_C">();
	}
	static class UUI_AbilityScore_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_AbilityScore_BP_C>();
	}
};
static_assert(alignof(UUI_AbilityScore_BP_C) == 0x000008, "Wrong alignment on UUI_AbilityScore_BP_C");
static_assert(sizeof(UUI_AbilityScore_BP_C) == 0x000890, "Wrong size on UUI_AbilityScore_BP_C");
static_assert(offsetof(UUI_AbilityScore_BP_C, Image_0) == 0x000878, "Member 'UUI_AbilityScore_BP_C::Image_0' has a wrong offset!");
static_assert(offsetof(UUI_AbilityScore_BP_C, UIParticle_256) == 0x000880, "Member 'UUI_AbilityScore_BP_C::UIParticle_256' has a wrong offset!");
static_assert(offsetof(UUI_AbilityScore_BP_C, UIParticle_257) == 0x000888, "Member 'UUI_AbilityScore_BP_C::UIParticle_257' has a wrong offset!");

}

