#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Button

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "Engine_structs.hpp"
#include "SlateCore_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Button.UI_Button_C
// 0x0190 (0x0ED8 - 0x0D48)
class UUI_Button_C : public UQRSLUI_Button
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D48(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Xunhuan;                                           // 0x0D50(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             GamepadKey;                                        // 0x0D58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Icon;                                              // 0x0D60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                             UI_E_Name;                                         // 0x0D68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          UseText;                                           // 0x0D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C8D[0x7];                                     // 0x0D71(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   Subtitle_Text;                                     // 0x0D78(0x0018)(Edit, BlueprintVisible)
	struct FSlateFontInfo                         SubTitle_Font;                                     // 0x0D90(0x0058)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FSlateColor                            SubTitle_Color;                                    // 0x0DE8(0x0028)(Edit, BlueprintVisible)
	struct FWidgetTransform                       SubTitle_Transform;                                // 0x0E10(0x001C)(Edit, BlueprintVisible, NoDestructor)
	bool                                          UseIcon;                                           // 0x0E2C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6C8E[0x3];                                     // 0x0E2D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSlateBrush                            Icon_Brush;                                        // 0x0E30(0x0088)(Edit, BlueprintVisible)
	struct FWidgetTransform                       Icon_Transform;                                    // 0x0EB8(0x001C)(Edit, BlueprintVisible, NoDestructor)
	bool                                          EnableGamepadSlot;                                 // 0x0ED4(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void SequenceEvent__ENTRYPOINTUI_Button_1();
	void SequenceEvent__ENTRYPOINTUI_Button_0();
	void ActivateGamepadSlot();
	void SequenceEvent_0();
	void SequenceEvent_2();
	void PreConstruct(bool IsDesignTime);
	void BP_ShowUseText(bool InUseText);
	void BP_SetUseText(const class FText& InText);
	void SetIconBrush(const struct FSlateBrush& Img, bool bSave);
	void ExecuteUbergraph_UI_Button(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Button_C">();
	}
	static class UUI_Button_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Button_C>();
	}
};
static_assert(alignof(UUI_Button_C) == 0x000008, "Wrong alignment on UUI_Button_C");
static_assert(sizeof(UUI_Button_C) == 0x000ED8, "Wrong size on UUI_Button_C");
static_assert(offsetof(UUI_Button_C, UberGraphFrame) == 0x000D48, "Member 'UUI_Button_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, Xunhuan) == 0x000D50, "Member 'UUI_Button_C::Xunhuan' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, GamepadKey) == 0x000D58, "Member 'UUI_Button_C::GamepadKey' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, Icon) == 0x000D60, "Member 'UUI_Button_C::Icon' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, UI_E_Name) == 0x000D68, "Member 'UUI_Button_C::UI_E_Name' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, UseText) == 0x000D70, "Member 'UUI_Button_C::UseText' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, Subtitle_Text) == 0x000D78, "Member 'UUI_Button_C::Subtitle_Text' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, SubTitle_Font) == 0x000D90, "Member 'UUI_Button_C::SubTitle_Font' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, SubTitle_Color) == 0x000DE8, "Member 'UUI_Button_C::SubTitle_Color' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, SubTitle_Transform) == 0x000E10, "Member 'UUI_Button_C::SubTitle_Transform' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, UseIcon) == 0x000E2C, "Member 'UUI_Button_C::UseIcon' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, Icon_Brush) == 0x000E30, "Member 'UUI_Button_C::Icon_Brush' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, Icon_Transform) == 0x000EB8, "Member 'UUI_Button_C::Icon_Transform' has a wrong offset!");
static_assert(offsetof(UUI_Button_C, EnableGamepadSlot) == 0x000ED4, "Member 'UUI_Button_C::EnableGamepadSlot' has a wrong offset!");

}

