#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Close_Button_BP

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Close_Button_BP.UI_Close_Button_BP_C
// 0x0018 (0x0D70 - 0x0D58)
class UUI_Close_Button_BP_C final : public UQRSLUI_CloseButton
{
public:
	class UImage*                                 back;                                              // 0x0D58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Close;                                       // 0x0D60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             KeySlot;                                           // 0x0D68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Close_Button_BP_C">();
	}
	static class UUI_Close_Button_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Close_Button_BP_C>();
	}
};
static_assert(alignof(UUI_Close_Button_BP_C) == 0x000008, "Wrong alignment on UUI_Close_Button_BP_C");
static_assert(sizeof(UUI_Close_Button_BP_C) == 0x000D70, "Wrong size on UUI_Close_Button_BP_C");
static_assert(offsetof(UUI_Close_Button_BP_C, back) == 0x000D58, "Member 'UUI_Close_Button_BP_C::back' has a wrong offset!");
static_assert(offsetof(UUI_Close_Button_BP_C, Image_Close) == 0x000D60, "Member 'UUI_Close_Button_BP_C::Image_Close' has a wrong offset!");
static_assert(offsetof(UUI_Close_Button_BP_C, KeySlot) == 0x000D68, "Member 'UUI_Close_Button_BP_C::KeySlot' has a wrong offset!");

}

