#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CloneFightInfo_BP

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CloneFightInfo_BP.UI_CloneFightInfo_BP_C
// 0x0020 (0x0940 - 0x0920)
class UUI_CloneFightInfo_BP_C final : public UQRSLUI_CloneFightInfo
{
public:
	class UImage*                                 Image_68;                                          // 0x0920(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_RadioBox_C*                         UI_RadioBox;                                       // 0x0928(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_RadioBox_C*                         UI_RadioBox_1;                                     // 0x0930(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_RadioBox_C*                         UI_RadioBox_2;                                     // 0x0938(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_CloneFightInfo_BP_C">();
	}
	static class UUI_CloneFightInfo_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CloneFightInfo_BP_C>();
	}
};
static_assert(alignof(UUI_CloneFightInfo_BP_C) == 0x000008, "Wrong alignment on UUI_CloneFightInfo_BP_C");
static_assert(sizeof(UUI_CloneFightInfo_BP_C) == 0x000940, "Wrong size on UUI_CloneFightInfo_BP_C");
static_assert(offsetof(UUI_CloneFightInfo_BP_C, Image_68) == 0x000920, "Member 'UUI_CloneFightInfo_BP_C::Image_68' has a wrong offset!");
static_assert(offsetof(UUI_CloneFightInfo_BP_C, UI_RadioBox) == 0x000928, "Member 'UUI_CloneFightInfo_BP_C::UI_RadioBox' has a wrong offset!");
static_assert(offsetof(UUI_CloneFightInfo_BP_C, UI_RadioBox_1) == 0x000930, "Member 'UUI_CloneFightInfo_BP_C::UI_RadioBox_1' has a wrong offset!");
static_assert(offsetof(UUI_CloneFightInfo_BP_C, UI_RadioBox_2) == 0x000938, "Member 'UUI_CloneFightInfo_BP_C::UI_RadioBox_2' has a wrong offset!");

}

