#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ChatViewFriend

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ChatViewFriend.UI_ChatViewFriend_C
// 0x0040 (0x0E38 - 0x0DF8)
class UUI_ChatViewFriend_C final : public UQRSLUI_ChatView
{
public:
	class UImage*                                 Image_157;                                         // 0x0DF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_199;                                         // 0x0E00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_youce_di;                                    // 0x0E08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_1;                                        // 0x0E10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_ImitationReplyWidget_C*             UI_ImitationReplyWidget;                           // 0x0E18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      WB_GamepadKeyboard_Tips_Single;                    // 0x0E20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      WB_GamepadKeyboard_Tips_Single_47;                 // 0x0E28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      WB_GamepadKeyboard_Tips_Single_63;                 // 0x0E30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ChatViewFriend_C">();
	}
	static class UUI_ChatViewFriend_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ChatViewFriend_C>();
	}
};
static_assert(alignof(UUI_ChatViewFriend_C) == 0x000008, "Wrong alignment on UUI_ChatViewFriend_C");
static_assert(sizeof(UUI_ChatViewFriend_C) == 0x000E38, "Wrong size on UUI_ChatViewFriend_C");
static_assert(offsetof(UUI_ChatViewFriend_C, Image_157) == 0x000DF8, "Member 'UUI_ChatViewFriend_C::Image_157' has a wrong offset!");
static_assert(offsetof(UUI_ChatViewFriend_C, Image_199) == 0x000E00, "Member 'UUI_ChatViewFriend_C::Image_199' has a wrong offset!");
static_assert(offsetof(UUI_ChatViewFriend_C, Image_youce_di) == 0x000E08, "Member 'UUI_ChatViewFriend_C::Image_youce_di' has a wrong offset!");
static_assert(offsetof(UUI_ChatViewFriend_C, SafeZone_1) == 0x000E10, "Member 'UUI_ChatViewFriend_C::SafeZone_1' has a wrong offset!");
static_assert(offsetof(UUI_ChatViewFriend_C, UI_ImitationReplyWidget) == 0x000E18, "Member 'UUI_ChatViewFriend_C::UI_ImitationReplyWidget' has a wrong offset!");
static_assert(offsetof(UUI_ChatViewFriend_C, WB_GamepadKeyboard_Tips_Single) == 0x000E20, "Member 'UUI_ChatViewFriend_C::WB_GamepadKeyboard_Tips_Single' has a wrong offset!");
static_assert(offsetof(UUI_ChatViewFriend_C, WB_GamepadKeyboard_Tips_Single_47) == 0x000E28, "Member 'UUI_ChatViewFriend_C::WB_GamepadKeyboard_Tips_Single_47' has a wrong offset!");
static_assert(offsetof(UUI_ChatViewFriend_C, WB_GamepadKeyboard_Tips_Single_63) == 0x000E30, "Member 'UUI_ChatViewFriend_C::WB_GamepadKeyboard_Tips_Single_63' has a wrong offset!");

}

