#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CloneInfoForm

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CloneInfoForm.UI_CloneInfoForm_C
// 0x0030 (0x0C58 - 0x0C28)
class UUI_CloneInfoForm_C final : public UQRSLUI_CloneInfoForm
{
public:
	class UImage*                                 Image_20;                                          // 0x0C28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_53;                                          // 0x0C30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_64;                                          // 0x0C38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_97;                                          // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_335;                                         // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImageBg;                                           // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_CloneInfoForm_C">();
	}
	static class UUI_CloneInfoForm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CloneInfoForm_C>();
	}
};
static_assert(alignof(UUI_CloneInfoForm_C) == 0x000008, "Wrong alignment on UUI_CloneInfoForm_C");
static_assert(sizeof(UUI_CloneInfoForm_C) == 0x000C58, "Wrong size on UUI_CloneInfoForm_C");
static_assert(offsetof(UUI_CloneInfoForm_C, Image_20) == 0x000C28, "Member 'UUI_CloneInfoForm_C::Image_20' has a wrong offset!");
static_assert(offsetof(UUI_CloneInfoForm_C, Image_53) == 0x000C30, "Member 'UUI_CloneInfoForm_C::Image_53' has a wrong offset!");
static_assert(offsetof(UUI_CloneInfoForm_C, Image_64) == 0x000C38, "Member 'UUI_CloneInfoForm_C::Image_64' has a wrong offset!");
static_assert(offsetof(UUI_CloneInfoForm_C, Image_97) == 0x000C40, "Member 'UUI_CloneInfoForm_C::Image_97' has a wrong offset!");
static_assert(offsetof(UUI_CloneInfoForm_C, Image_335) == 0x000C48, "Member 'UUI_CloneInfoForm_C::Image_335' has a wrong offset!");
static_assert(offsetof(UUI_CloneInfoForm_C, ImageBg) == 0x000C50, "Member 'UUI_CloneInfoForm_C::ImageBg' has a wrong offset!");

}

