#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_CoolDownButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_CoolDownButton.UI_CoolDownButton_C
// 0x0018 (0x0E30 - 0x0E18)
class UUI_CoolDownButton_C final : public UQRSLUI_CoolDownButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0E18(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UNamedSlot*                             GamepadKey;                                        // 0x0E20(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHottaButton*                           HottaButton;                                       // 0x0E28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_CoolDownButton(int32 EntryPoint);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_CoolDownButton_C">();
	}
	static class UUI_CoolDownButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_CoolDownButton_C>();
	}
};
static_assert(alignof(UUI_CoolDownButton_C) == 0x000008, "Wrong alignment on UUI_CoolDownButton_C");
static_assert(sizeof(UUI_CoolDownButton_C) == 0x000E30, "Wrong size on UUI_CoolDownButton_C");
static_assert(offsetof(UUI_CoolDownButton_C, UberGraphFrame) == 0x000E18, "Member 'UUI_CoolDownButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_CoolDownButton_C, GamepadKey) == 0x000E20, "Member 'UUI_CoolDownButton_C::GamepadKey' has a wrong offset!");
static_assert(offsetof(UUI_CoolDownButton_C, HottaButton) == 0x000E28, "Member 'UUI_CoolDownButton_C::HottaButton' has a wrong offset!");

}

