#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ChatDubbingGridSlot

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ChatDubbingGridSlot.UI_ChatDubbingGridSlot_C
// 0x0018 (0x0BD8 - 0x0BC0)
class UUI_ChatDubbingGridSlot_C final : public UQRSLUI_DubbingGridSlot
{
public:
	class UImage*                                 Image_91;                                          // 0x0BC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgDubbingPhoto;                                   // 0x0BC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgLock;                                           // 0x0BD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ChatDubbingGridSlot_C">();
	}
	static class UUI_ChatDubbingGridSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ChatDubbingGridSlot_C>();
	}
};
static_assert(alignof(UUI_ChatDubbingGridSlot_C) == 0x000008, "Wrong alignment on UUI_ChatDubbingGridSlot_C");
static_assert(sizeof(UUI_ChatDubbingGridSlot_C) == 0x000BD8, "Wrong size on UUI_ChatDubbingGridSlot_C");
static_assert(offsetof(UUI_ChatDubbingGridSlot_C, Image_91) == 0x000BC0, "Member 'UUI_ChatDubbingGridSlot_C::Image_91' has a wrong offset!");
static_assert(offsetof(UUI_ChatDubbingGridSlot_C, ImgDubbingPhoto) == 0x000BC8, "Member 'UUI_ChatDubbingGridSlot_C::ImgDubbingPhoto' has a wrong offset!");
static_assert(offsetof(UUI_ChatDubbingGridSlot_C, ImgLock) == 0x000BD0, "Member 'UUI_ChatDubbingGridSlot_C::ImgLock' has a wrong offset!");

}

