#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ChatPanel

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ChatPanel.UI_ChatPanel_C
// 0x0018 (0x0AB0 - 0x0A98)
class UUI_ChatPanel_C final : public UQRSLUI_ChatPanel
{
public:
	class UImage*                                 Image_520;                                         // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_680;                                         // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1760;                                        // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ChatPanel_C">();
	}
	static class UUI_ChatPanel_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ChatPanel_C>();
	}
};
static_assert(alignof(UUI_ChatPanel_C) == 0x000008, "Wrong alignment on UUI_ChatPanel_C");
static_assert(sizeof(UUI_ChatPanel_C) == 0x000AB0, "Wrong size on UUI_ChatPanel_C");
static_assert(offsetof(UUI_ChatPanel_C, Image_520) == 0x000A98, "Member 'UUI_ChatPanel_C::Image_520' has a wrong offset!");
static_assert(offsetof(UUI_ChatPanel_C, Image_680) == 0x000AA0, "Member 'UUI_ChatPanel_C::Image_680' has a wrong offset!");
static_assert(offsetof(UUI_ChatPanel_C, Image_1760) == 0x000AA8, "Member 'UUI_ChatPanel_C::Image_1760' has a wrong offset!");

}

