#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_DescriptionButton_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_DescriptionButton_BP.UI_DescriptionButton_BP_C
// 0x0018 (0x0850 - 0x0838)
class UUI_DescriptionButton_BP_C final : public UQRSLUI_DescriptionButton
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0838(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Xunhuan;                                           // 0x0840(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UNamedSlot*                             KeySlot;                                           // 0x0848(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void SequenceEvent__ENTRYPOINTUI_DescriptionButton_BP_1();
	void SequenceEvent__ENTRYPOINTUI_DescriptionButton_BP_0();
	void SequenceEvent_0();
	void SequenceEvent_2();
	void ExecuteUbergraph_UI_DescriptionButton_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_DescriptionButton_BP_C">();
	}
	static class UUI_DescriptionButton_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_DescriptionButton_BP_C>();
	}
};
static_assert(alignof(UUI_DescriptionButton_BP_C) == 0x000008, "Wrong alignment on UUI_DescriptionButton_BP_C");
static_assert(sizeof(UUI_DescriptionButton_BP_C) == 0x000850, "Wrong size on UUI_DescriptionButton_BP_C");
static_assert(offsetof(UUI_DescriptionButton_BP_C, UberGraphFrame) == 0x000838, "Member 'UUI_DescriptionButton_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_DescriptionButton_BP_C, Xunhuan) == 0x000840, "Member 'UUI_DescriptionButton_BP_C::Xunhuan' has a wrong offset!");
static_assert(offsetof(UUI_DescriptionButton_BP_C, KeySlot) == 0x000848, "Member 'UUI_DescriptionButton_BP_C::KeySlot' has a wrong offset!");

}

