#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_EightTeamQuickMemberWidget

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_EightTeamQuickMemberWidget.UI_EightTeamQuickMemberWidget_C
// 0x0040 (0x0FB8 - 0x0F78)
class UUI_EightTeamQuickMemberWidget_C final : public UQRSLUI_TeamQuickMemberWidget
{
public:
	class UImage*                                 Image;                                             // 0x0F78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_124;                                         // 0x0F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_198;                                         // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_344;                                         // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgSelfRegression;                                 // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_EightTeamQuickMemberWidget_C">();
	}
	static class UUI_EightTeamQuickMemberWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_EightTeamQuickMemberWidget_C>();
	}
};
static_assert(alignof(UUI_EightTeamQuickMemberWidget_C) == 0x000008, "Wrong alignment on UUI_EightTeamQuickMemberWidget_C");
static_assert(sizeof(UUI_EightTeamQuickMemberWidget_C) == 0x000FB8, "Wrong size on UUI_EightTeamQuickMemberWidget_C");
static_assert(offsetof(UUI_EightTeamQuickMemberWidget_C, Image) == 0x000F78, "Member 'UUI_EightTeamQuickMemberWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_EightTeamQuickMemberWidget_C, Image_2) == 0x000F80, "Member 'UUI_EightTeamQuickMemberWidget_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUI_EightTeamQuickMemberWidget_C, Image_3) == 0x000F88, "Member 'UUI_EightTeamQuickMemberWidget_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUI_EightTeamQuickMemberWidget_C, Image_5) == 0x000F90, "Member 'UUI_EightTeamQuickMemberWidget_C::Image_5' has a wrong offset!");
static_assert(offsetof(UUI_EightTeamQuickMemberWidget_C, Image_124) == 0x000F98, "Member 'UUI_EightTeamQuickMemberWidget_C::Image_124' has a wrong offset!");
static_assert(offsetof(UUI_EightTeamQuickMemberWidget_C, Image_198) == 0x000FA0, "Member 'UUI_EightTeamQuickMemberWidget_C::Image_198' has a wrong offset!");
static_assert(offsetof(UUI_EightTeamQuickMemberWidget_C, Image_344) == 0x000FA8, "Member 'UUI_EightTeamQuickMemberWidget_C::Image_344' has a wrong offset!");
static_assert(offsetof(UUI_EightTeamQuickMemberWidget_C, ImgSelfRegression) == 0x000FB0, "Member 'UUI_EightTeamQuickMemberWidget_C::ImgSelfRegression' has a wrong offset!");

}

