#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Friend

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Friend.UI_Friend_C.OnBP_OnGetItemChildren_0
// 0x0008 (0x0008 - 0x0000)
struct UI_Friend_C_OnBP_OnGetItemChildren_0 final
{
public:
	class UObject*                                Item;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Friend_C_OnBP_OnGetItemChildren_0) == 0x000008, "Wrong alignment on UI_Friend_C_OnBP_OnGetItemChildren_0");
static_assert(sizeof(UI_Friend_C_OnBP_OnGetItemChildren_0) == 0x000008, "Wrong size on UI_Friend_C_OnBP_OnGetItemChildren_0");
static_assert(offsetof(UI_Friend_C_OnBP_OnGetItemChildren_0, Item) == 0x000000, "Member 'UI_Friend_C_OnBP_OnGetItemChildren_0::Item' has a wrong offset!");

// Function UI_Friend.UI_Friend_C.ExecuteUbergraph_UI_Friend
// 0x0004 (0x0004 - 0x0000)
struct UI_Friend_C_ExecuteUbergraph_UI_Friend final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Friend_C_ExecuteUbergraph_UI_Friend) == 0x000004, "Wrong alignment on UI_Friend_C_ExecuteUbergraph_UI_Friend");
static_assert(sizeof(UI_Friend_C_ExecuteUbergraph_UI_Friend) == 0x000004, "Wrong size on UI_Friend_C_ExecuteUbergraph_UI_Friend");
static_assert(offsetof(UI_Friend_C_ExecuteUbergraph_UI_Friend, EntryPoint) == 0x000000, "Member 'UI_Friend_C_ExecuteUbergraph_UI_Friend::EntryPoint' has a wrong offset!");

}

