#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Interation

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_Interation.UI_Interation_C.ExecuteUbergraph_UI_Interation
// 0x0004 (0x0004 - 0x0000)
struct UI_Interation_C_ExecuteUbergraph_UI_Interation final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Interation_C_ExecuteUbergraph_UI_Interation) == 0x000004, "Wrong alignment on UI_Interation_C_ExecuteUbergraph_UI_Interation");
static_assert(sizeof(UI_Interation_C_ExecuteUbergraph_UI_Interation) == 0x000004, "Wrong size on UI_Interation_C_ExecuteUbergraph_UI_Interation");
static_assert(offsetof(UI_Interation_C_ExecuteUbergraph_UI_Interation, EntryPoint) == 0x000000, "Member 'UI_Interation_C_ExecuteUbergraph_UI_Interation::EntryPoint' has a wrong offset!");

// Function UI_Interation.UI_Interation_C.HiddenInGame
// 0x0008 (0x0008 - 0x0000)
struct UI_Interation_C_HiddenInGame final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Interation_C_HiddenInGame) == 0x000008, "Wrong alignment on UI_Interation_C_HiddenInGame");
static_assert(sizeof(UI_Interation_C_HiddenInGame) == 0x000008, "Wrong size on UI_Interation_C_HiddenInGame");
static_assert(offsetof(UI_Interation_C_HiddenInGame, CallFunc_PlayAnimation_ReturnValue) == 0x000000, "Member 'UI_Interation_C_HiddenInGame::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function UI_Interation.UI_Interation_C.ShowInGame
// 0x0008 (0x0008 - 0x0000)
struct UI_Interation_C_ShowInGame final
{
public:
	class UUMGSequencePlayer*                     CallFunc_PlayAnimationReverse_ReturnValue;         // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_Interation_C_ShowInGame) == 0x000008, "Wrong alignment on UI_Interation_C_ShowInGame");
static_assert(sizeof(UI_Interation_C_ShowInGame) == 0x000008, "Wrong size on UI_Interation_C_ShowInGame");
static_assert(offsetof(UI_Interation_C_ShowInGame, CallFunc_PlayAnimationReverse_ReturnValue) == 0x000000, "Member 'UI_Interation_C_ShowInGame::CallFunc_PlayAnimationReverse_ReturnValue' has a wrong offset!");

}

