#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ItemSlot

#include "Basic.hpp"

#include "SlateCore_structs.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function UI_ItemSlot.UI_ItemSlot_C.ExecuteUbergraph_UI_ItemSlot
// 0x0060 (0x0060 - 0x0000)
struct UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E60[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UTexture2D*                             K2Node_Event_texture;                              // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E61[0x7];                                     // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_BtnWidget_1;            // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_BtnWidget;              // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaItem*                             CallFunc_GetItemContain_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_1;              // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E62[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UHottaItem*                             CallFunc_GetItemContain_ReturnValue_1;             // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E63[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue_2;              // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot) == 0x000008, "Wrong alignment on UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot");
static_assert(sizeof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot) == 0x000060, "Wrong size on UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, EntryPoint) == 0x000000, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, K2Node_Event_texture) == 0x000008, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::K2Node_Event_texture' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, K2Node_Event_IsDesignTime) == 0x000010, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, K2Node_ComponentBoundEvent_BtnWidget_1) == 0x000018, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::K2Node_ComponentBoundEvent_BtnWidget_1' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, K2Node_ComponentBoundEvent_BtnWidget) == 0x000020, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::K2Node_ComponentBoundEvent_BtnWidget' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, CallFunc_GetItemContain_ReturnValue) == 0x000030, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::CallFunc_GetItemContain_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, CallFunc_PlayAnimation_ReturnValue_1) == 0x000038, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::CallFunc_PlayAnimation_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, CallFunc_IsValid_ReturnValue) == 0x000040, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, CallFunc_GetItemContain_ReturnValue_1) == 0x000048, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::CallFunc_GetItemContain_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, CallFunc_IsValid_ReturnValue_1) == 0x000050, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot, CallFunc_PlayAnimation_ReturnValue_2) == 0x000058, "Member 'UI_ItemSlot_C_ExecuteUbergraph_UI_ItemSlot::CallFunc_PlayAnimation_ReturnValue_2' has a wrong offset!");

// Function UI_ItemSlot.UI_ItemSlot_C.BP_SetBottomImg
// 0x0008 (0x0008 - 0x0000)
struct UI_ItemSlot_C_BP_SetBottomImg final
{
public:
	class UTexture2D*                             Texture;                                           // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemSlot_C_BP_SetBottomImg) == 0x000008, "Wrong alignment on UI_ItemSlot_C_BP_SetBottomImg");
static_assert(sizeof(UI_ItemSlot_C_BP_SetBottomImg) == 0x000008, "Wrong size on UI_ItemSlot_C_BP_SetBottomImg");
static_assert(offsetof(UI_ItemSlot_C_BP_SetBottomImg, Texture) == 0x000000, "Member 'UI_ItemSlot_C_BP_SetBottomImg::Texture' has a wrong offset!");

// Function UI_ItemSlot.UI_ItemSlot_C.BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_1_UIButtonDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_1_UIButtonDelegate__DelegateSignature final
{
public:
	class UWidget*                                BtnWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_1_UIButtonDelegate__DelegateSignature) == 0x000008, "Wrong alignment on UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_1_UIButtonDelegate__DelegateSignature");
static_assert(sizeof(UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_1_UIButtonDelegate__DelegateSignature) == 0x000008, "Wrong size on UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_1_UIButtonDelegate__DelegateSignature");
static_assert(offsetof(UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_1_UIButtonDelegate__DelegateSignature, BtnWidget) == 0x000000, "Member 'UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_1_UIButtonDelegate__DelegateSignature::BtnWidget' has a wrong offset!");

// Function UI_ItemSlot.UI_ItemSlot_C.BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature
// 0x0008 (0x0008 - 0x0000)
struct UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature final
{
public:
	class UWidget*                                BtnWidget;                                         // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature) == 0x000008, "Wrong alignment on UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature");
static_assert(sizeof(UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature) == 0x000008, "Wrong size on UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature");
static_assert(offsetof(UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature, BtnWidget) == 0x000000, "Member 'UI_ItemSlot_C_BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature::BtnWidget' has a wrong offset!");

// Function UI_ItemSlot.UI_ItemSlot_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_ItemSlot_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_ItemSlot_C_PreConstruct) == 0x000001, "Wrong alignment on UI_ItemSlot_C_PreConstruct");
static_assert(sizeof(UI_ItemSlot_C_PreConstruct) == 0x000001, "Wrong size on UI_ItemSlot_C_PreConstruct");
static_assert(offsetof(UI_ItemSlot_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_ItemSlot_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_ItemSlot.UI_ItemSlot_C.OnDragDetected
// 0x00E8 (0x00E8 - 0x0000)
struct UI_ItemSlot_C_OnDragDetected final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	struct FPointerEvent                          PointerEvent;                                      // 0x0038(0x0070)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	class UDragDropOperation*                     Operation;                                         // 0x00A8(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaDragDropOperation*                CallFunc_CreateDragDropOperation_ReturnValue;      // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaItem*                             CallFunc_GetItemContain_ReturnValue;               // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x00C0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EItemContainType                              CallFunc_GetContainType_ReturnValue;               // 0x00C1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E64[0x2];                                     // 0x00C2(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Conv_ByteToInt_ReturnValue;               // 0x00C4(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerController*                 CallFunc_BP_GetPC_ReturnValue;                     // 0x00C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaUserWidget*                       CallFunc_CreateUIByClass_ReturnValue;              // 0x00D0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQRSLUW_DragWidget*                     K2Node_DynamicCast_AsQRSLUW_Drag_Widget;           // 0x00D8(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00E0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_ItemSlot_C_OnDragDetected) == 0x000008, "Wrong alignment on UI_ItemSlot_C_OnDragDetected");
static_assert(sizeof(UI_ItemSlot_C_OnDragDetected) == 0x0000E8, "Wrong size on UI_ItemSlot_C_OnDragDetected");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, MyGeometry) == 0x000000, "Member 'UI_ItemSlot_C_OnDragDetected::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, PointerEvent) == 0x000038, "Member 'UI_ItemSlot_C_OnDragDetected::PointerEvent' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, Operation) == 0x0000A8, "Member 'UI_ItemSlot_C_OnDragDetected::Operation' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, CallFunc_CreateDragDropOperation_ReturnValue) == 0x0000B0, "Member 'UI_ItemSlot_C_OnDragDetected::CallFunc_CreateDragDropOperation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, CallFunc_GetItemContain_ReturnValue) == 0x0000B8, "Member 'UI_ItemSlot_C_OnDragDetected::CallFunc_GetItemContain_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, CallFunc_IsValid_ReturnValue) == 0x0000C0, "Member 'UI_ItemSlot_C_OnDragDetected::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, CallFunc_GetContainType_ReturnValue) == 0x0000C1, "Member 'UI_ItemSlot_C_OnDragDetected::CallFunc_GetContainType_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, CallFunc_Conv_ByteToInt_ReturnValue) == 0x0000C4, "Member 'UI_ItemSlot_C_OnDragDetected::CallFunc_Conv_ByteToInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, CallFunc_BP_GetPC_ReturnValue) == 0x0000C8, "Member 'UI_ItemSlot_C_OnDragDetected::CallFunc_BP_GetPC_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, CallFunc_CreateUIByClass_ReturnValue) == 0x0000D0, "Member 'UI_ItemSlot_C_OnDragDetected::CallFunc_CreateUIByClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, K2Node_DynamicCast_AsQRSLUW_Drag_Widget) == 0x0000D8, "Member 'UI_ItemSlot_C_OnDragDetected::K2Node_DynamicCast_AsQRSLUW_Drag_Widget' has a wrong offset!");
static_assert(offsetof(UI_ItemSlot_C_OnDragDetected, K2Node_DynamicCast_bSuccess) == 0x0000E0, "Member 'UI_ItemSlot_C_OnDragDetected::K2Node_DynamicCast_bSuccess' has a wrong offset!");

}

