#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ItemSlot

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ItemSlot.UI_ItemSlot_C
// 0x0060 (0x0950 - 0x08F0)
class UUI_ItemSlot_C final : public UQRSLUI_ItemSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08F0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Zhuangbeisuoweizhi;                                // 0x08F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       UnHorvedAni;                                       // 0x0900(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       HorvedAni;                                         // 0x0908(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 Image_43;                                          // 0x0910(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_91;                                          // 0x0918(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             NavigationSlot;                                    // 0x0920(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUINavigationWidget*                    NavigationWidget;                                  // 0x0928(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTexture2D*                             BackImage;                                         // 0x0930(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                             SelectedImage;                                     // 0x0938(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          QianghuaUIyong;                                    // 0x0940(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E5F[0x7];                                     // 0x0941(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            DragWidget;                                        // 0x0948(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_ItemSlot(int32 EntryPoint);
	void BP_SetBottomImg(class UTexture2D* Texture);
	void Construct();
	void BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_1_UIButtonDelegate__DelegateSignature(class UWidget* BtnWidget);
	void BndEvt__UI_ItemSlot_btn_back_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature(class UWidget* BtnWidget);
	void PreConstruct(bool IsDesignTime);
	void OnDragDetected(const struct FGeometry& MyGeometry, const struct FPointerEvent& PointerEvent, class UDragDropOperation** Operation);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ItemSlot_C">();
	}
	static class UUI_ItemSlot_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ItemSlot_C>();
	}
};
static_assert(alignof(UUI_ItemSlot_C) == 0x000008, "Wrong alignment on UUI_ItemSlot_C");
static_assert(sizeof(UUI_ItemSlot_C) == 0x000950, "Wrong size on UUI_ItemSlot_C");
static_assert(offsetof(UUI_ItemSlot_C, UberGraphFrame) == 0x0008F0, "Member 'UUI_ItemSlot_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, Zhuangbeisuoweizhi) == 0x0008F8, "Member 'UUI_ItemSlot_C::Zhuangbeisuoweizhi' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, UnHorvedAni) == 0x000900, "Member 'UUI_ItemSlot_C::UnHorvedAni' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, HorvedAni) == 0x000908, "Member 'UUI_ItemSlot_C::HorvedAni' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, Image_43) == 0x000910, "Member 'UUI_ItemSlot_C::Image_43' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, Image_91) == 0x000918, "Member 'UUI_ItemSlot_C::Image_91' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, NavigationSlot) == 0x000920, "Member 'UUI_ItemSlot_C::NavigationSlot' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, NavigationWidget) == 0x000928, "Member 'UUI_ItemSlot_C::NavigationWidget' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, BackImage) == 0x000930, "Member 'UUI_ItemSlot_C::BackImage' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, SelectedImage) == 0x000938, "Member 'UUI_ItemSlot_C::SelectedImage' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, QianghuaUIyong) == 0x000940, "Member 'UUI_ItemSlot_C::QianghuaUIyong' has a wrong offset!");
static_assert(offsetof(UUI_ItemSlot_C, DragWidget) == 0x000948, "Member 'UUI_ItemSlot_C::DragWidget' has a wrong offset!");

}

