#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ItemGridSlot_BP

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function UI_ItemGridSlot_BP.UI_ItemGridSlot_BP_C.BP_SetItemByItemID
// 0x000C (0x000C - 0x0000)
struct UI_ItemGridSlot_BP_C_BP_SetItemByItemID final
{
public:
	class FName                                   InItemId;                                          // 0x0000(0x0008)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InItemTotalAmount;                                 // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_ItemGridSlot_BP_C_BP_SetItemByItemID) == 0x000004, "Wrong alignment on UI_ItemGridSlot_BP_C_BP_SetItemByItemID");
static_assert(sizeof(UI_ItemGridSlot_BP_C_BP_SetItemByItemID) == 0x00000C, "Wrong size on UI_ItemGridSlot_BP_C_BP_SetItemByItemID");
static_assert(offsetof(UI_ItemGridSlot_BP_C_BP_SetItemByItemID, InItemId) == 0x000000, "Member 'UI_ItemGridSlot_BP_C_BP_SetItemByItemID::InItemId' has a wrong offset!");
static_assert(offsetof(UI_ItemGridSlot_BP_C_BP_SetItemByItemID, InItemTotalAmount) == 0x000008, "Member 'UI_ItemGridSlot_BP_C_BP_SetItemByItemID::InItemTotalAmount' has a wrong offset!");

// Function UI_ItemGridSlot_BP.UI_ItemGridSlot_BP_C.ExecuteUbergraph_UI_ItemGridSlot_BP
// 0x05B0 (0x05B0 - 0x0000)
struct UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   K2Node_Event_InItemID;                             // 0x0004(0x0008)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InItemTotalAmount;                    // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHottaGameData*                         CallFunc_GetGameData_ReturnValue;                  // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStaticItemData                        CallFunc_BP_GetStaticItemData_OutData;             // 0x0018(0x0590)()
	bool                                          CallFunc_BP_GetStaticItemData_ReturnValue;         // 0x05A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x05A9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x05AA(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x05AB(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x05AC(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP) == 0x000008, "Wrong alignment on UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP");
static_assert(sizeof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP) == 0x0005B0, "Wrong size on UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP");
static_assert(offsetof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP, EntryPoint) == 0x000000, "Member 'UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP, K2Node_Event_InItemID) == 0x000004, "Member 'UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP::K2Node_Event_InItemID' has a wrong offset!");
static_assert(offsetof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP, K2Node_Event_InItemTotalAmount) == 0x00000C, "Member 'UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP::K2Node_Event_InItemTotalAmount' has a wrong offset!");
static_assert(offsetof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP, CallFunc_GetGameData_ReturnValue) == 0x000010, "Member 'UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP::CallFunc_GetGameData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP, CallFunc_BP_GetStaticItemData_OutData) == 0x000018, "Member 'UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP::CallFunc_BP_GetStaticItemData_OutData' has a wrong offset!");
static_assert(offsetof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP, CallFunc_BP_GetStaticItemData_ReturnValue) == 0x0005A8, "Member 'UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP::CallFunc_BP_GetStaticItemData_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP, CallFunc_IsValid_ReturnValue) == 0x0005A9, "Member 'UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x0005AA, "Member 'UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP, CallFunc_EqualEqual_ByteByte_ReturnValue_1) == 0x0005AB, "Member 'UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP::CallFunc_EqualEqual_ByteByte_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP, CallFunc_BooleanOR_ReturnValue) == 0x0005AC, "Member 'UI_ItemGridSlot_BP_C_ExecuteUbergraph_UI_ItemGridSlot_BP::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

}

