#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_ItemGridSlot_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_ItemGridSlot_BP.UI_ItemGridSlot_BP_C
// 0x05A0 (0x1118 - 0x0B78)
class UUI_ItemGridSlot_BP_C final : public UQRSLUI_ItemGridSlot
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 ImageFragment;                                     // 0x0B80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FStaticItemData                        Out_Data;                                          // 0x0B88(0x0590)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void BP_SetItemByItemID(const class FName& InItemId, int32 InItemTotalAmount);
	void ExecuteUbergraph_UI_ItemGridSlot_BP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_ItemGridSlot_BP_C">();
	}
	static class UUI_ItemGridSlot_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_ItemGridSlot_BP_C>();
	}
};
static_assert(alignof(UUI_ItemGridSlot_BP_C) == 0x000008, "Wrong alignment on UUI_ItemGridSlot_BP_C");
static_assert(sizeof(UUI_ItemGridSlot_BP_C) == 0x001118, "Wrong size on UUI_ItemGridSlot_BP_C");
static_assert(offsetof(UUI_ItemGridSlot_BP_C, UberGraphFrame) == 0x000B78, "Member 'UUI_ItemGridSlot_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_ItemGridSlot_BP_C, ImageFragment) == 0x000B80, "Member 'UUI_ItemGridSlot_BP_C::ImageFragment' has a wrong offset!");
static_assert(offsetof(UUI_ItemGridSlot_BP_C, Out_Data) == 0x000B88, "Member 'UUI_ItemGridSlot_BP_C::Out_Data' has a wrong offset!");

}

