#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Loading_BP

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function UI_Loading_BP.UI_Loading_BP_C.ExecuteUbergraph_UI_Loading_BP
// 0x0008 (0x0008 - 0x0000)
struct UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaChannelTypeOversea                      CallFunc_SwitchChannelOversea_OutChannelTypeOversea; // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP) == 0x000004, "Wrong alignment on UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP");
static_assert(sizeof(UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP) == 0x000008, "Wrong size on UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP");
static_assert(offsetof(UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP, EntryPoint) == 0x000000, "Member 'UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP, CallFunc_SwitchChannelOversea_OutChannelTypeOversea) == 0x000004, "Member 'UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP::CallFunc_SwitchChannelOversea_OutChannelTypeOversea' has a wrong offset!");
static_assert(offsetof(UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP, K2Node_SwitchEnum_CmpSuccess) == 0x000005, "Member 'UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP, K2Node_Event_IsDesignTime) == 0x000006, "Member 'UI_Loading_BP_C_ExecuteUbergraph_UI_Loading_BP::K2Node_Event_IsDesignTime' has a wrong offset!");

// Function UI_Loading_BP.UI_Loading_BP_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_Loading_BP_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_Loading_BP_C_PreConstruct) == 0x000001, "Wrong alignment on UI_Loading_BP_C_PreConstruct");
static_assert(sizeof(UI_Loading_BP_C_PreConstruct) == 0x000001, "Wrong size on UI_Loading_BP_C_PreConstruct");
static_assert(offsetof(UI_Loading_BP_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_Loading_BP_C_PreConstruct::IsDesignTime' has a wrong offset!");

}

