#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Loading_BP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Loading_BP.UI_Loading_BP_C
// 0x00A0 (0x05B8 - 0x0518)
class UUI_Loading_BP_C final : public UQRSLUI_Loading
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0518(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Ani_Triangle;                                      // 0x0520(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCircularThrobber*                      CircularThrobber_76;                               // 0x0528(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x0530(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0538(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0540(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0548(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0550(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0558(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_16;                                          // 0x0560(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_18;                                          // 0x0568(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_19;                                          // 0x0570(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_22;                                          // 0x0578(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_23;                                          // 0x0580(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_24;                                          // 0x0588(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_128;                                         // 0x0590(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_180;                                         // 0x0598(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_220;                                         // 0x05A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_443;                                         // 0x05A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_69;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_Loading_BP(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Loading_BP_C">();
	}
	static class UUI_Loading_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Loading_BP_C>();
	}
};
static_assert(alignof(UUI_Loading_BP_C) == 0x000008, "Wrong alignment on UUI_Loading_BP_C");
static_assert(sizeof(UUI_Loading_BP_C) == 0x0005B8, "Wrong size on UUI_Loading_BP_C");
static_assert(offsetof(UUI_Loading_BP_C, UberGraphFrame) == 0x000518, "Member 'UUI_Loading_BP_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Ani_Triangle) == 0x000520, "Member 'UUI_Loading_BP_C::Ani_Triangle' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, CircularThrobber_76) == 0x000528, "Member 'UUI_Loading_BP_C::CircularThrobber_76' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image) == 0x000530, "Member 'UUI_Loading_BP_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_1) == 0x000538, "Member 'UUI_Loading_BP_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_3) == 0x000540, "Member 'UUI_Loading_BP_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_4) == 0x000548, "Member 'UUI_Loading_BP_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_5) == 0x000550, "Member 'UUI_Loading_BP_C::Image_5' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_6) == 0x000558, "Member 'UUI_Loading_BP_C::Image_6' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_16) == 0x000560, "Member 'UUI_Loading_BP_C::Image_16' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_18) == 0x000568, "Member 'UUI_Loading_BP_C::Image_18' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_19) == 0x000570, "Member 'UUI_Loading_BP_C::Image_19' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_22) == 0x000578, "Member 'UUI_Loading_BP_C::Image_22' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_23) == 0x000580, "Member 'UUI_Loading_BP_C::Image_23' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_24) == 0x000588, "Member 'UUI_Loading_BP_C::Image_24' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_128) == 0x000590, "Member 'UUI_Loading_BP_C::Image_128' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_180) == 0x000598, "Member 'UUI_Loading_BP_C::Image_180' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_220) == 0x0005A0, "Member 'UUI_Loading_BP_C::Image_220' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, Image_443) == 0x0005A8, "Member 'UUI_Loading_BP_C::Image_443' has a wrong offset!");
static_assert(offsetof(UUI_Loading_BP_C, SafeZone_69) == 0x0005B0, "Member 'UUI_Loading_BP_C::SafeZone_69' has a wrong offset!");

}

