#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MentorshipReward

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MentorshipReward.UI_MentorshipReward_C
// 0x0050 (0x08D0 - 0x0880)
class UUI_MentorshipReward_C final : public UQRSLUI_MentorshipReward
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0880(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_243;                                         // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_352;                                         // 0x08A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_653;                                         // 0x08A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_179;                                 // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Button_C*                           UI_Button;                                         // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      WB_GamepadKeyboard_Tips_Single_67;                 // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      WB_GamepadKeyboard_Tips_Single_141;                // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_MentorshipReward_UI_Button_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature(class UWidget* BtnWidget);
	void ExecuteUbergraph_UI_MentorshipReward(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MentorshipReward_C">();
	}
	static class UUI_MentorshipReward_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MentorshipReward_C>();
	}
};
static_assert(alignof(UUI_MentorshipReward_C) == 0x000008, "Wrong alignment on UUI_MentorshipReward_C");
static_assert(sizeof(UUI_MentorshipReward_C) == 0x0008D0, "Wrong size on UUI_MentorshipReward_C");
static_assert(offsetof(UUI_MentorshipReward_C, UberGraphFrame) == 0x000880, "Member 'UUI_MentorshipReward_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipReward_C, Image) == 0x000888, "Member 'UUI_MentorshipReward_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipReward_C, Image_1) == 0x000890, "Member 'UUI_MentorshipReward_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipReward_C, Image_243) == 0x000898, "Member 'UUI_MentorshipReward_C::Image_243' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipReward_C, Image_352) == 0x0008A0, "Member 'UUI_MentorshipReward_C::Image_352' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipReward_C, Image_653) == 0x0008A8, "Member 'UUI_MentorshipReward_C::Image_653' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipReward_C, RichTextBlock_179) == 0x0008B0, "Member 'UUI_MentorshipReward_C::RichTextBlock_179' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipReward_C, UI_Button) == 0x0008B8, "Member 'UUI_MentorshipReward_C::UI_Button' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipReward_C, WB_GamepadKeyboard_Tips_Single_67) == 0x0008C0, "Member 'UUI_MentorshipReward_C::WB_GamepadKeyboard_Tips_Single_67' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipReward_C, WB_GamepadKeyboard_Tips_Single_141) == 0x0008C8, "Member 'UUI_MentorshipReward_C::WB_GamepadKeyboard_Tips_Single_141' has a wrong offset!");

}

