#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MentorshipRelation

#include "Basic.hpp"

#include "QRSL_classes.hpp"
#include "HottaFramework_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MentorshipRelation.UI_MentorshipRelation_C
// 0x0190 (0x0A38 - 0x08A8)
class UUI_MentorshipRelation_C final : public UQRSLUI_MentorshipRelation
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UUI_Button_C*                           Btn_shop;                                          // 0x08B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x08B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x08C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_2;                                           // 0x08C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_103;                                         // 0x08D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_123;                                         // 0x08D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_230;                                         // 0x08E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_322;                                         // 0x08E8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_329;                                         // 0x08F0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_428;                                         // 0x08F8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_RedPointWidget_C*                   RedPoint;                                          // 0x0900(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_RedPointWidget_C*                   RedPoint_1;                                        // 0x0908(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_RedPointWidget_C*                   RedPoint_2;                                        // 0x0910(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 TextBackImg;                                       // 0x0918(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MentorshipRoleItem_C*               UI_MentorshipRoleItem;                             // 0x0920(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MentorshipRoleItem_C*               UI_MentorshipRoleItem_1;                           // 0x0928(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MentorshipRoleItem_C*               UI_MentorshipRoleItem_218;                         // 0x0930(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MentorshipRoleItem_C*               UI_MentorshipRoleItem_283;                         // 0x0938(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MentorshipRoleItem_C*               UI_MentorshipRoleItem_353;                         // 0x0940(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_MentorshipRoleItem_C*               UI_MentorshipRoleItem_432;                         // 0x0948(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_RedPointWidget_C*                   UI_RedPointWidget;                                 // 0x0950(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FMentorshipBakData                     BakeData;                                          // 0x0958(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<int32>                                 RepairIntArray;                                    // 0x09B0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                          FString;                                           // 0x09C0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E22[0x3];                                     // 0x09C1(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         RepairIndex;                                       // 0x09C4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         RepairState;                                       // 0x09C8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E23[0x4];                                     // 0x09CC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	struct FMentorshipBakData                     Bak_Data;                                          // 0x09D0(0x0058)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                 In_String;                                         // 0x0A28(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)

public:
	bool IsBlockClient(int32 MsgType, const struct FParameterWrapperArray& WarpperArray, const struct FMentorshipBakData& BakData);
	void TempRepair(const struct FMentorshipBakData& NewParam);
	void RepairMaster();
	void RepairPrentice();
	void BndEvt__UI_MentorshipRelation_Btn_Shop_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature(class UWidget* BtnWidget);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void ExecuteUbergraph_UI_MentorshipRelation(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MentorshipRelation_C">();
	}
	static class UUI_MentorshipRelation_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MentorshipRelation_C>();
	}
};
static_assert(alignof(UUI_MentorshipRelation_C) == 0x000008, "Wrong alignment on UUI_MentorshipRelation_C");
static_assert(sizeof(UUI_MentorshipRelation_C) == 0x000A38, "Wrong size on UUI_MentorshipRelation_C");
static_assert(offsetof(UUI_MentorshipRelation_C, UberGraphFrame) == 0x0008A8, "Member 'UUI_MentorshipRelation_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Btn_shop) == 0x0008B0, "Member 'UUI_MentorshipRelation_C::Btn_shop' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Image) == 0x0008B8, "Member 'UUI_MentorshipRelation_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Image_1) == 0x0008C0, "Member 'UUI_MentorshipRelation_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Image_2) == 0x0008C8, "Member 'UUI_MentorshipRelation_C::Image_2' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Image_103) == 0x0008D0, "Member 'UUI_MentorshipRelation_C::Image_103' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Image_123) == 0x0008D8, "Member 'UUI_MentorshipRelation_C::Image_123' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Image_230) == 0x0008E0, "Member 'UUI_MentorshipRelation_C::Image_230' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Image_322) == 0x0008E8, "Member 'UUI_MentorshipRelation_C::Image_322' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Image_329) == 0x0008F0, "Member 'UUI_MentorshipRelation_C::Image_329' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Image_428) == 0x0008F8, "Member 'UUI_MentorshipRelation_C::Image_428' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, RedPoint) == 0x000900, "Member 'UUI_MentorshipRelation_C::RedPoint' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, RedPoint_1) == 0x000908, "Member 'UUI_MentorshipRelation_C::RedPoint_1' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, RedPoint_2) == 0x000910, "Member 'UUI_MentorshipRelation_C::RedPoint_2' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, TextBackImg) == 0x000918, "Member 'UUI_MentorshipRelation_C::TextBackImg' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, UI_MentorshipRoleItem) == 0x000920, "Member 'UUI_MentorshipRelation_C::UI_MentorshipRoleItem' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, UI_MentorshipRoleItem_1) == 0x000928, "Member 'UUI_MentorshipRelation_C::UI_MentorshipRoleItem_1' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, UI_MentorshipRoleItem_218) == 0x000930, "Member 'UUI_MentorshipRelation_C::UI_MentorshipRoleItem_218' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, UI_MentorshipRoleItem_283) == 0x000938, "Member 'UUI_MentorshipRelation_C::UI_MentorshipRoleItem_283' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, UI_MentorshipRoleItem_353) == 0x000940, "Member 'UUI_MentorshipRelation_C::UI_MentorshipRoleItem_353' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, UI_MentorshipRoleItem_432) == 0x000948, "Member 'UUI_MentorshipRelation_C::UI_MentorshipRoleItem_432' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, UI_RedPointWidget) == 0x000950, "Member 'UUI_MentorshipRelation_C::UI_RedPointWidget' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, BakeData) == 0x000958, "Member 'UUI_MentorshipRelation_C::BakeData' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, RepairIntArray) == 0x0009B0, "Member 'UUI_MentorshipRelation_C::RepairIntArray' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, FString) == 0x0009C0, "Member 'UUI_MentorshipRelation_C::FString' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, RepairIndex) == 0x0009C4, "Member 'UUI_MentorshipRelation_C::RepairIndex' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, RepairState) == 0x0009C8, "Member 'UUI_MentorshipRelation_C::RepairState' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, Bak_Data) == 0x0009D0, "Member 'UUI_MentorshipRelation_C::Bak_Data' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRelation_C, In_String) == 0x000A28, "Member 'UUI_MentorshipRelation_C::In_String' has a wrong offset!");

}

