#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MentorshipRoleItem

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MentorshipRoleItem.UI_MentorshipRoleItem_C
// 0x0048 (0x09E0 - 0x0998)
class UUI_MentorshipRoleItem_C final : public UQRSLUI_MentorshipRoleInfo
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0998(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CP_RipairKick;                                     // 0x09A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x09A8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x09B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_140;                                         // 0x09B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_142;                                         // 0x09C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_148;                                         // 0x09C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_248;                                         // 0x09D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_Precence;                                    // 0x09D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void Construct();
	void ExecuteUbergraph_UI_MentorshipRoleItem(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MentorshipRoleItem_C">();
	}
	static class UUI_MentorshipRoleItem_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MentorshipRoleItem_C>();
	}
};
static_assert(alignof(UUI_MentorshipRoleItem_C) == 0x000008, "Wrong alignment on UUI_MentorshipRoleItem_C");
static_assert(sizeof(UUI_MentorshipRoleItem_C) == 0x0009E0, "Wrong size on UUI_MentorshipRoleItem_C");
static_assert(offsetof(UUI_MentorshipRoleItem_C, UberGraphFrame) == 0x000998, "Member 'UUI_MentorshipRoleItem_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRoleItem_C, CP_RipairKick) == 0x0009A0, "Member 'UUI_MentorshipRoleItem_C::CP_RipairKick' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRoleItem_C, Image) == 0x0009A8, "Member 'UUI_MentorshipRoleItem_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRoleItem_C, Image_1) == 0x0009B0, "Member 'UUI_MentorshipRoleItem_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRoleItem_C, Image_140) == 0x0009B8, "Member 'UUI_MentorshipRoleItem_C::Image_140' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRoleItem_C, Image_142) == 0x0009C0, "Member 'UUI_MentorshipRoleItem_C::Image_142' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRoleItem_C, Image_148) == 0x0009C8, "Member 'UUI_MentorshipRoleItem_C::Image_148' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRoleItem_C, Image_248) == 0x0009D0, "Member 'UUI_MentorshipRoleItem_C::Image_248' has a wrong offset!");
static_assert(offsetof(UUI_MentorshipRoleItem_C, Image_Precence) == 0x0009D8, "Member 'UUI_MentorshipRoleItem_C::Image_Precence' has a wrong offset!");

}

