#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MailItemWidget

#include "Basic.hpp"

#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_MailItemWidget.UI_MailItemWidget_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_MailItemWidget_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MailItemWidget_C_Tick) == 0x000004, "Wrong alignment on UI_MailItemWidget_C_Tick");
static_assert(sizeof(UI_MailItemWidget_C_Tick) == 0x00003C, "Wrong size on UI_MailItemWidget_C_Tick");
static_assert(offsetof(UI_MailItemWidget_C_Tick, MyGeometry) == 0x000000, "Member 'UI_MailItemWidget_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_MailItemWidget_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_MailItemWidget_C_Tick::InDeltaTime' has a wrong offset!");

// Function UI_MailItemWidget.UI_MailItemWidget_C.ExecuteUbergraph_UI_MailItemWidget
// 0x0050 (0x0050 - 0x0000)
struct UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E5E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0010(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget) == 0x000008, "Wrong alignment on UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget");
static_assert(sizeof(UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget) == 0x000050, "Wrong size on UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget");
static_assert(offsetof(UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget, EntryPoint) == 0x000000, "Member 'UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000008, "Member 'UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget, K2Node_Event_MyGeometry) == 0x000010, "Member 'UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget, K2Node_Event_InDeltaTime) == 0x000048, "Member 'UI_MailItemWidget_C_ExecuteUbergraph_UI_MailItemWidget::K2Node_Event_InDeltaTime' has a wrong offset!");

}

