#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MailForm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MailForm.UI_MailForm_C
// 0x0038 (0x08A0 - 0x0868)
class UUI_MailForm_C final : public UQRSLUI_MailForm
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0868(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image_87;                                          // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_222;                                         // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_379;                                         // 0x0880(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_493;                                         // 0x0888(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      WB_GamepadKeyboard_Tips_Single;                    // 0x0890(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      WB_GamepadKeyboard_Tips_Single_176;                // 0x0898(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void BndEvt__UI_MailForm_MailTileView_K2Node_ComponentBoundEvent_0_OnListEntryReleasedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__UI_MailForm_MailTileView_K2Node_ComponentBoundEvent_1_OnListEntryGeneratedDynamic__DelegateSignature(class UUserWidget* Widget);
	void BndEvt__UI_MailForm_MailTileView_K2Node_ComponentBoundEvent_2_SimpleListItemEventDynamic__DelegateSignature(class UObject* Item);
	void ExecuteUbergraph_UI_MailForm(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MailForm_C">();
	}
	static class UUI_MailForm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MailForm_C>();
	}
};
static_assert(alignof(UUI_MailForm_C) == 0x000008, "Wrong alignment on UUI_MailForm_C");
static_assert(sizeof(UUI_MailForm_C) == 0x0008A0, "Wrong size on UUI_MailForm_C");
static_assert(offsetof(UUI_MailForm_C, UberGraphFrame) == 0x000868, "Member 'UUI_MailForm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_MailForm_C, Image_87) == 0x000870, "Member 'UUI_MailForm_C::Image_87' has a wrong offset!");
static_assert(offsetof(UUI_MailForm_C, Image_222) == 0x000878, "Member 'UUI_MailForm_C::Image_222' has a wrong offset!");
static_assert(offsetof(UUI_MailForm_C, Image_379) == 0x000880, "Member 'UUI_MailForm_C::Image_379' has a wrong offset!");
static_assert(offsetof(UUI_MailForm_C, Image_493) == 0x000888, "Member 'UUI_MailForm_C::Image_493' has a wrong offset!");
static_assert(offsetof(UUI_MailForm_C, WB_GamepadKeyboard_Tips_Single) == 0x000890, "Member 'UUI_MailForm_C::WB_GamepadKeyboard_Tips_Single' has a wrong offset!");
static_assert(offsetof(UUI_MailForm_C, WB_GamepadKeyboard_Tips_Single_176) == 0x000898, "Member 'UUI_MailForm_C::WB_GamepadKeyboard_Tips_Single_176' has a wrong offset!");

}

