#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MailContentForm

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MailContentForm.UI_MailContentForm_C
// 0x0038 (0x0960 - 0x0928)
class UUI_MailContentForm_C final : public UQRSLUI_MailContentForm
{
public:
	class UImage*                                 Image_89;                                          // 0x0928(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_183;                                         // 0x0930(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_237;                                         // 0x0938(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_307;                                         // 0x0940(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      WB_GamepadKeyboard_Tips_Single;                    // 0x0948(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      WB_GamepadKeyboard_Tips_Single_76;                 // 0x0950(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      WB_GamepadKeyboard_Tips_Single_147;                // 0x0958(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MailContentForm_C">();
	}
	static class UUI_MailContentForm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MailContentForm_C>();
	}
};
static_assert(alignof(UUI_MailContentForm_C) == 0x000008, "Wrong alignment on UUI_MailContentForm_C");
static_assert(sizeof(UUI_MailContentForm_C) == 0x000960, "Wrong size on UUI_MailContentForm_C");
static_assert(offsetof(UUI_MailContentForm_C, Image_89) == 0x000928, "Member 'UUI_MailContentForm_C::Image_89' has a wrong offset!");
static_assert(offsetof(UUI_MailContentForm_C, Image_183) == 0x000930, "Member 'UUI_MailContentForm_C::Image_183' has a wrong offset!");
static_assert(offsetof(UUI_MailContentForm_C, Image_237) == 0x000938, "Member 'UUI_MailContentForm_C::Image_237' has a wrong offset!");
static_assert(offsetof(UUI_MailContentForm_C, Image_307) == 0x000940, "Member 'UUI_MailContentForm_C::Image_307' has a wrong offset!");
static_assert(offsetof(UUI_MailContentForm_C, WB_GamepadKeyboard_Tips_Single) == 0x000948, "Member 'UUI_MailContentForm_C::WB_GamepadKeyboard_Tips_Single' has a wrong offset!");
static_assert(offsetof(UUI_MailContentForm_C, WB_GamepadKeyboard_Tips_Single_76) == 0x000950, "Member 'UUI_MailContentForm_C::WB_GamepadKeyboard_Tips_Single_76' has a wrong offset!");
static_assert(offsetof(UUI_MailContentForm_C, WB_GamepadKeyboard_Tips_Single_147) == 0x000958, "Member 'UUI_MailContentForm_C::WB_GamepadKeyboard_Tips_Single_147' has a wrong offset!");

}

