#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_MainQuickForm

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_MainQuickForm.UI_MainQuickForm_C
// 0x0040 (0x09E8 - 0x09A8)
class UUI_MainQuickForm_C final : public UQRSLUI_MainQuickForm
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x09A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_100;                                   // 0x09B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_QuestControl;                          // 0x09B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Guide_trace;                                       // 0x09C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image;                                             // 0x09C8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_174;                                         // 0x09D0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x09D8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_RedPointWidget_C*                   UI_RedPointWidget;                                 // 0x09E0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_MainQuickForm(int32 EntryPoint);
	void BndEvt__TaskButton_K2Node_ComponentBoundEvent_0_UIButtonDelegate__DelegateSignature(class UWidget* BtnWidget);
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_MainQuickForm_C">();
	}
	static class UUI_MainQuickForm_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_MainQuickForm_C>();
	}
};
static_assert(alignof(UUI_MainQuickForm_C) == 0x000008, "Wrong alignment on UUI_MainQuickForm_C");
static_assert(sizeof(UUI_MainQuickForm_C) == 0x0009E8, "Wrong size on UUI_MainQuickForm_C");
static_assert(offsetof(UUI_MainQuickForm_C, UberGraphFrame) == 0x0009A8, "Member 'UUI_MainQuickForm_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_MainQuickForm_C, CanvasPanel_100) == 0x0009B0, "Member 'UUI_MainQuickForm_C::CanvasPanel_100' has a wrong offset!");
static_assert(offsetof(UUI_MainQuickForm_C, CanvasPanel_QuestControl) == 0x0009B8, "Member 'UUI_MainQuickForm_C::CanvasPanel_QuestControl' has a wrong offset!");
static_assert(offsetof(UUI_MainQuickForm_C, Guide_trace) == 0x0009C0, "Member 'UUI_MainQuickForm_C::Guide_trace' has a wrong offset!");
static_assert(offsetof(UUI_MainQuickForm_C, Image) == 0x0009C8, "Member 'UUI_MainQuickForm_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_MainQuickForm_C, Image_174) == 0x0009D0, "Member 'UUI_MainQuickForm_C::Image_174' has a wrong offset!");
static_assert(offsetof(UUI_MainQuickForm_C, SafeZone_0) == 0x0009D8, "Member 'UUI_MainQuickForm_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UUI_MainQuickForm_C, UI_RedPointWidget) == 0x0009E0, "Member 'UUI_MainQuickForm_C::UI_RedPointWidget' has a wrong offset!");

}

