#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_PetSlot

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_PetSlot.UI_PetSlot_C.OnBPSlotSelected
// 0x0001 (0x0001 - 0x0000)
struct UI_PetSlot_C_OnBPSlotSelected final
{
public:
	bool                                          bSelected;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_PetSlot_C_OnBPSlotSelected) == 0x000001, "Wrong alignment on UI_PetSlot_C_OnBPSlotSelected");
static_assert(sizeof(UI_PetSlot_C_OnBPSlotSelected) == 0x000001, "Wrong size on UI_PetSlot_C_OnBPSlotSelected");
static_assert(offsetof(UI_PetSlot_C_OnBPSlotSelected, bSelected) == 0x000000, "Member 'UI_PetSlot_C_OnBPSlotSelected::bSelected' has a wrong offset!");

// Function UI_PetSlot.UI_PetSlot_C.ExecuteUbergraph_UI_PetSlot
// 0x0018 (0x0018 - 0x0000)
struct UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_582B[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_bSelected;                            // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot) == 0x000008, "Wrong alignment on UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot");
static_assert(sizeof(UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot) == 0x000018, "Wrong size on UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot");
static_assert(offsetof(UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot, EntryPoint) == 0x000000, "Member 'UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000008, "Member 'UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot, K2Node_Event_bSelected) == 0x000010, "Member 'UI_PetSlot_C_ExecuteUbergraph_UI_PetSlot::K2Node_Event_bSelected' has a wrong offset!");

}

