#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_Personality_ScoreChangeContainer_BP

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_Personality_ScoreChangeContainer_BP.UI_Personality_ScoreChangeContainer_BP_C
// 0x0020 (0x0880 - 0x0860)
class UUI_Personality_ScoreChangeContainer_BP_C final : public UQRSLUI_Personality_ScoreChangeContainer
{
public:
	class UWidgetAnimation*                       NewAnimation_1;                                    // 0x0860(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       NewAnimation;                                      // 0x0868(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUI_Personality_ScoreChangeSlot_BP_C*   UI_Personality_ScoreChangeSlot_BP;                 // 0x0870(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_Personality_ScoreChangeSlot_BP_C*   UI_Personality_ScoreChangeSlot_BP_1;               // 0x0878(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_Personality_ScoreChangeContainer_BP_C">();
	}
	static class UUI_Personality_ScoreChangeContainer_BP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_Personality_ScoreChangeContainer_BP_C>();
	}
};
static_assert(alignof(UUI_Personality_ScoreChangeContainer_BP_C) == 0x000010, "Wrong alignment on UUI_Personality_ScoreChangeContainer_BP_C");
static_assert(sizeof(UUI_Personality_ScoreChangeContainer_BP_C) == 0x000880, "Wrong size on UUI_Personality_ScoreChangeContainer_BP_C");
static_assert(offsetof(UUI_Personality_ScoreChangeContainer_BP_C, NewAnimation_1) == 0x000860, "Member 'UUI_Personality_ScoreChangeContainer_BP_C::NewAnimation_1' has a wrong offset!");
static_assert(offsetof(UUI_Personality_ScoreChangeContainer_BP_C, NewAnimation) == 0x000868, "Member 'UUI_Personality_ScoreChangeContainer_BP_C::NewAnimation' has a wrong offset!");
static_assert(offsetof(UUI_Personality_ScoreChangeContainer_BP_C, UI_Personality_ScoreChangeSlot_BP) == 0x000870, "Member 'UUI_Personality_ScoreChangeContainer_BP_C::UI_Personality_ScoreChangeSlot_BP' has a wrong offset!");
static_assert(offsetof(UUI_Personality_ScoreChangeContainer_BP_C, UI_Personality_ScoreChangeSlot_BP_1) == 0x000878, "Member 'UUI_Personality_ScoreChangeContainer_BP_C::UI_Personality_ScoreChangeSlot_BP_1' has a wrong offset!");

}

