#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_QuestObjectiveTrack

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_QuestObjectiveTrack.UI_QuestObjectiveTrack_C.SequenceEvent_0
// 0x0010 (0x0010 - 0x0000)
struct UI_QuestObjectiveTrack_C_SequenceEvent_0 final
{
public:
	class UTypingText*                            Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_PostEventAtLocation_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_QuestObjectiveTrack_C_SequenceEvent_0) == 0x000008, "Wrong alignment on UI_QuestObjectiveTrack_C_SequenceEvent_0");
static_assert(sizeof(UI_QuestObjectiveTrack_C_SequenceEvent_0) == 0x000010, "Wrong size on UI_QuestObjectiveTrack_C_SequenceEvent_0");
static_assert(offsetof(UI_QuestObjectiveTrack_C_SequenceEvent_0, Target) == 0x000000, "Member 'UI_QuestObjectiveTrack_C_SequenceEvent_0::Target' has a wrong offset!");
static_assert(offsetof(UI_QuestObjectiveTrack_C_SequenceEvent_0, CallFunc_PostEventAtLocation_ReturnValue) == 0x000008, "Member 'UI_QuestObjectiveTrack_C_SequenceEvent_0::CallFunc_PostEventAtLocation_ReturnValue' has a wrong offset!");

// Function UI_QuestObjectiveTrack.UI_QuestObjectiveTrack_C.SequenceEvent__ENTRYPOINTUI_QuestObjectiveTrack_0
// 0x0008 (0x0008 - 0x0000)
struct UI_QuestObjectiveTrack_C_SequenceEvent__ENTRYPOINTUI_QuestObjectiveTrack_0 final
{
public:
	class UTypingText*                            Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_QuestObjectiveTrack_C_SequenceEvent__ENTRYPOINTUI_QuestObjectiveTrack_0) == 0x000008, "Wrong alignment on UI_QuestObjectiveTrack_C_SequenceEvent__ENTRYPOINTUI_QuestObjectiveTrack_0");
static_assert(sizeof(UI_QuestObjectiveTrack_C_SequenceEvent__ENTRYPOINTUI_QuestObjectiveTrack_0) == 0x000008, "Wrong size on UI_QuestObjectiveTrack_C_SequenceEvent__ENTRYPOINTUI_QuestObjectiveTrack_0");
static_assert(offsetof(UI_QuestObjectiveTrack_C_SequenceEvent__ENTRYPOINTUI_QuestObjectiveTrack_0, Target) == 0x000000, "Member 'UI_QuestObjectiveTrack_C_SequenceEvent__ENTRYPOINTUI_QuestObjectiveTrack_0::Target' has a wrong offset!");

}

