#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SkillPermanentEffect

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SkillPermanentEffect.UI_SkillPermanentEffect_C
// 0x00E8 (0x0B20 - 0x0A38)
class UUI_SkillPermanentEffect_C final : public UQRSLUI_SkillPermanentEffect
{
public:
	class UImage*                                 Base_1;                                            // 0x0A38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_2;                                            // 0x0A40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_3;                                            // 0x0A48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_1_1;                                          // 0x0A50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_1_Mark;                                       // 0x0A58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_2_1;                                          // 0x0A60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_2_Mark;                                       // 0x0A68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_3_1;                                          // 0x0A70(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Base_3_Mark;                                       // 0x0A78(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Card1;                                             // 0x0A80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Card2;                                             // 0x0A88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_3;                                           // 0x0A90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_4;                                           // 0x0A98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0AA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_6;                                           // 0x0AA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_164;                                         // 0x0AB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image1;                                            // 0x0AB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image2;                                            // 0x0AC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image3;                                            // 0x0AC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHottaProgressImage*                    ProgressImage1;                                    // 0x0AD0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHottaProgressImage*                    ProgressImage2;                                    // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHottaProgressImage*                    ProgressImage3;                                    // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHottaProgressImage*                    ProgressImageEx1;                                  // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHottaProgressImage*                    ProgressImageEx2;                                  // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHottaProgressImage*                    ProgressImageEx3;                                  // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Triangle;                                          // 0x0B00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle1;                                       // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle2;                                       // 0x0B10(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle3;                                       // 0x0B18(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_SkillPermanentEffect_C">();
	}
	static class UUI_SkillPermanentEffect_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SkillPermanentEffect_C>();
	}
};
static_assert(alignof(UUI_SkillPermanentEffect_C) == 0x000008, "Wrong alignment on UUI_SkillPermanentEffect_C");
static_assert(sizeof(UUI_SkillPermanentEffect_C) == 0x000B20, "Wrong size on UUI_SkillPermanentEffect_C");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Base_1) == 0x000A38, "Member 'UUI_SkillPermanentEffect_C::Base_1' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Base_2) == 0x000A40, "Member 'UUI_SkillPermanentEffect_C::Base_2' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Base_3) == 0x000A48, "Member 'UUI_SkillPermanentEffect_C::Base_3' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Base_1_1) == 0x000A50, "Member 'UUI_SkillPermanentEffect_C::Base_1_1' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Base_1_Mark) == 0x000A58, "Member 'UUI_SkillPermanentEffect_C::Base_1_Mark' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Base_2_1) == 0x000A60, "Member 'UUI_SkillPermanentEffect_C::Base_2_1' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Base_2_Mark) == 0x000A68, "Member 'UUI_SkillPermanentEffect_C::Base_2_Mark' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Base_3_1) == 0x000A70, "Member 'UUI_SkillPermanentEffect_C::Base_3_1' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Base_3_Mark) == 0x000A78, "Member 'UUI_SkillPermanentEffect_C::Base_3_Mark' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Card1) == 0x000A80, "Member 'UUI_SkillPermanentEffect_C::Card1' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Card2) == 0x000A88, "Member 'UUI_SkillPermanentEffect_C::Card2' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Image_3) == 0x000A90, "Member 'UUI_SkillPermanentEffect_C::Image_3' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Image_4) == 0x000A98, "Member 'UUI_SkillPermanentEffect_C::Image_4' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Image_5) == 0x000AA0, "Member 'UUI_SkillPermanentEffect_C::Image_5' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Image_6) == 0x000AA8, "Member 'UUI_SkillPermanentEffect_C::Image_6' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Image_164) == 0x000AB0, "Member 'UUI_SkillPermanentEffect_C::Image_164' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Image1) == 0x000AB8, "Member 'UUI_SkillPermanentEffect_C::Image1' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Image2) == 0x000AC0, "Member 'UUI_SkillPermanentEffect_C::Image2' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Image3) == 0x000AC8, "Member 'UUI_SkillPermanentEffect_C::Image3' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, ProgressImage1) == 0x000AD0, "Member 'UUI_SkillPermanentEffect_C::ProgressImage1' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, ProgressImage2) == 0x000AD8, "Member 'UUI_SkillPermanentEffect_C::ProgressImage2' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, ProgressImage3) == 0x000AE0, "Member 'UUI_SkillPermanentEffect_C::ProgressImage3' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, ProgressImageEx1) == 0x000AE8, "Member 'UUI_SkillPermanentEffect_C::ProgressImageEx1' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, ProgressImageEx2) == 0x000AF0, "Member 'UUI_SkillPermanentEffect_C::ProgressImageEx2' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, ProgressImageEx3) == 0x000AF8, "Member 'UUI_SkillPermanentEffect_C::ProgressImageEx3' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, Triangle) == 0x000B00, "Member 'UUI_SkillPermanentEffect_C::Triangle' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, UIParticle1) == 0x000B08, "Member 'UUI_SkillPermanentEffect_C::UIParticle1' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, UIParticle2) == 0x000B10, "Member 'UUI_SkillPermanentEffect_C::UIParticle2' has a wrong offset!");
static_assert(offsetof(UUI_SkillPermanentEffect_C, UIParticle3) == 0x000B18, "Member 'UUI_SkillPermanentEffect_C::UIParticle3' has a wrong offset!");

}

