#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SkillInputButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "ST_GamepadTips_Single_structs.hpp"
#include "QRSL_classes.hpp"
#include "UMG_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SkillInputButton.UI_SkillInputButton_C
// 0x0088 (0x0CB0 - 0x0C28)
class UUI_SkillInputButton_C final : public UQRSLUI_SkillInput
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0C28(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       EndLinkTimeNotice;                                 // 0x0C30(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       StartLinkTimeNotice;                               // 0x0C38(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UOverlay*                               GameapdGroup;                                      // 0x0C40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWB_GamepadKeyboard_Tips_Single_C*      GamepadKey;                                        // 0x0C48(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             KeySlot;                                           // 0x0C50(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               PCGroup;                                           // 0x0C58(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle_LinkTimeNotice;                         // 0x0C60(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle_Sneak;                                  // 0x0C68(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_             Test;                                              // 0x0C70(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FST_GamepadTips_Single                 Custom_Gamepad_Key;                                // 0x0C80(0x0028)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                   InputActionName;                                   // 0x0CA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void Test__DelegateSignature();
	void ExecuteUbergraph_UI_SkillInputButton(int32 EntryPoint);
	void Construct();
	void BPOnGamepadInputChanged(bool bGamepad);
	void OnClicked();
	void SequenceEvent_0(class UImage* Target);
	void SetupGamepadKey();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_SkillInputButton_C">();
	}
	static class UUI_SkillInputButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SkillInputButton_C>();
	}
};
static_assert(alignof(UUI_SkillInputButton_C) == 0x000008, "Wrong alignment on UUI_SkillInputButton_C");
static_assert(sizeof(UUI_SkillInputButton_C) == 0x000CB0, "Wrong size on UUI_SkillInputButton_C");
static_assert(offsetof(UUI_SkillInputButton_C, UberGraphFrame) == 0x000C28, "Member 'UUI_SkillInputButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, EndLinkTimeNotice) == 0x000C30, "Member 'UUI_SkillInputButton_C::EndLinkTimeNotice' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, StartLinkTimeNotice) == 0x000C38, "Member 'UUI_SkillInputButton_C::StartLinkTimeNotice' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, GameapdGroup) == 0x000C40, "Member 'UUI_SkillInputButton_C::GameapdGroup' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, GamepadKey) == 0x000C48, "Member 'UUI_SkillInputButton_C::GamepadKey' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, KeySlot) == 0x000C50, "Member 'UUI_SkillInputButton_C::KeySlot' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, PCGroup) == 0x000C58, "Member 'UUI_SkillInputButton_C::PCGroup' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, UIParticle_LinkTimeNotice) == 0x000C60, "Member 'UUI_SkillInputButton_C::UIParticle_LinkTimeNotice' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, UIParticle_Sneak) == 0x000C68, "Member 'UUI_SkillInputButton_C::UIParticle_Sneak' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, Test) == 0x000C70, "Member 'UUI_SkillInputButton_C::Test' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, Custom_Gamepad_Key) == 0x000C80, "Member 'UUI_SkillInputButton_C::Custom_Gamepad_Key' has a wrong offset!");
static_assert(offsetof(UUI_SkillInputButton_C, InputActionName) == 0x000CA8, "Member 'UUI_SkillInputButton_C::InputActionName' has a wrong offset!");

}

