#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SkillInput_EvadeNew

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_SkillInput_EvadeNew.UI_SkillInput_EvadeNew_C
// 0x0018 (0x0848 - 0x0830)
class UUI_SkillInput_EvadeNew_C final : public UQRSLUI_SkillBeanCount
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0830(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       Animation;                                         // 0x0838(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle_26;                                     // 0x0840(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_SkillInput_EvadeNew(int32 EntryPoint);
	void PlayFinishAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_SkillInput_EvadeNew_C">();
	}
	static class UUI_SkillInput_EvadeNew_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_SkillInput_EvadeNew_C>();
	}
};
static_assert(alignof(UUI_SkillInput_EvadeNew_C) == 0x000008, "Wrong alignment on UUI_SkillInput_EvadeNew_C");
static_assert(sizeof(UUI_SkillInput_EvadeNew_C) == 0x000848, "Wrong size on UUI_SkillInput_EvadeNew_C");
static_assert(offsetof(UUI_SkillInput_EvadeNew_C, UberGraphFrame) == 0x000830, "Member 'UUI_SkillInput_EvadeNew_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_SkillInput_EvadeNew_C, Animation) == 0x000838, "Member 'UUI_SkillInput_EvadeNew_C::Animation' has a wrong offset!");
static_assert(offsetof(UUI_SkillInput_EvadeNew_C, UIParticle_26) == 0x000840, "Member 'UUI_SkillInput_EvadeNew_C::UIParticle_26' has a wrong offset!");

}

