#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_SkillInput_NormalAttack

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function UI_SkillInput_NormalAttack.UI_SkillInput_NormalAttack_C.ExecuteUbergraph_UI_SkillInput_NormalAttack
// 0x0040 (0x0040 - 0x0000)
struct UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsCloudGame_ReturnValue;                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable;                                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              ___byte_Variable;                                  // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ___byte_Variable_1;                                // 0x0007(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable_1;                                // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5713[0x6];                                     // 0x000A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0021(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0022(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5714[0x5];                                     // 0x0023(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	TScriptInterface<class IGameplayTagAssetInterface> K2Node_DynamicCast_AsGameplay______;               // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasMatchingGameplayTag_ReturnValue;       // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EHottaPlatformType                            CallFunc_SwitchPlatform_OutPlatformType;           // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack) == 0x000008, "Wrong alignment on UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack");
static_assert(sizeof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack) == 0x000040, "Wrong size on UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, EntryPoint) == 0x000000, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, CallFunc_IsCloudGame_ReturnValue) == 0x000004, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::CallFunc_IsCloudGame_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, ___bool_Variable) == 0x000005, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::___bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, ___byte_Variable) == 0x000006, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::___byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, ___byte_Variable_1) == 0x000007, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, ___bool_Variable_1) == 0x000008, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::___bool_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, K2Node_Select_Default) == 0x000009, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::K2Node_Select_Default' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000010, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000018, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, CallFunc_IsValid_ReturnValue) == 0x000020, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, CallFunc_IsValid_ReturnValue_1) == 0x000021, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000022, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, K2Node_DynamicCast_AsGameplay______) == 0x000028, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::K2Node_DynamicCast_AsGameplay______' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, CallFunc_HasMatchingGameplayTag_ReturnValue) == 0x000039, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::CallFunc_HasMatchingGameplayTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, CallFunc_SwitchPlatform_OutPlatformType) == 0x00003A, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::CallFunc_SwitchPlatform_OutPlatformType' has a wrong offset!");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack, K2Node_SwitchEnum_CmpSuccess) == 0x00003B, "Member 'UI_SkillInput_NormalAttack_C_ExecuteUbergraph_UI_SkillInput_NormalAttack::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");

// Function UI_SkillInput_NormalAttack.UI_SkillInput_NormalAttack_C.SequenceEvent_0
// 0x0008 (0x0008 - 0x0000)
struct UI_SkillInput_NormalAttack_C_SequenceEvent_0 final
{
public:
	class UImage*                                 Target;                                            // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_SkillInput_NormalAttack_C_SequenceEvent_0) == 0x000008, "Wrong alignment on UI_SkillInput_NormalAttack_C_SequenceEvent_0");
static_assert(sizeof(UI_SkillInput_NormalAttack_C_SequenceEvent_0) == 0x000008, "Wrong size on UI_SkillInput_NormalAttack_C_SequenceEvent_0");
static_assert(offsetof(UI_SkillInput_NormalAttack_C_SequenceEvent_0, Target) == 0x000000, "Member 'UI_SkillInput_NormalAttack_C_SequenceEvent_0::Target' has a wrong offset!");

}

