#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_TeamQuickForm

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_TeamQuickForm.UI_TeamQuickForm_C.ExecuteUbergraph_UI_TeamQuickForm
// 0x0008 (0x0008 - 0x0000)
struct UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLevelScene_ReturnValue;                 // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm) == 0x000004, "Wrong alignment on UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm");
static_assert(sizeof(UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm) == 0x000008, "Wrong size on UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm");
static_assert(offsetof(UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm, EntryPoint) == 0x000000, "Member 'UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm, CallFunc_IsLevelScene_ReturnValue) == 0x000004, "Member 'UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm::CallFunc_IsLevelScene_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm, CallFunc_IsValid_ReturnValue) == 0x000005, "Member 'UI_TeamQuickForm_C_ExecuteUbergraph_UI_TeamQuickForm::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

