#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_TreasureHuntRadarChartIcon

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function UI_TreasureHuntRadarChartIcon.UI_TreasureHuntRadarChartIcon_C.CalcLoc2Pos
// 0x0090 (0x0090 - 0x0000)
struct UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos final
{
public:
	struct FVector                                InPoint;                                           // 0x0000(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                InOri;                                             // 0x000C(0x000C)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutX;                                              // 0x0018(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         OutY;                                              // 0x001C(0x0004)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_Subtract_VectorVector_ReturnValue;        // 0x0020(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_X;                            // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Y;                            // 0x0030(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector_Z;                            // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue;                   // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_SafeDivide_ReturnValue_1;                 // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue;           // 0x0040(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_FloatToString_ReturnValue_1;         // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_1;              // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue_2;              // 0x0080(0x0010)(ZeroConstructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos) == 0x000008, "Wrong alignment on UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos");
static_assert(sizeof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos) == 0x000090, "Wrong size on UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, InPoint) == 0x000000, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::InPoint' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, InOri) == 0x00000C, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::InOri' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, OutX) == 0x000018, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::OutX' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, OutY) == 0x00001C, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::OutY' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_Subtract_VectorVector_ReturnValue) == 0x000020, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_Subtract_VectorVector_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_BreakVector_X) == 0x00002C, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_BreakVector_X' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_BreakVector_Y) == 0x000030, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_BreakVector_Y' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_BreakVector_Z) == 0x000034, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_BreakVector_Z' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_SafeDivide_ReturnValue) == 0x000038, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_SafeDivide_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_SafeDivide_ReturnValue_1) == 0x00003C, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_SafeDivide_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_Conv_FloatToString_ReturnValue) == 0x000040, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_Conv_FloatToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_Concat_StrStr_ReturnValue) == 0x000050, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_Conv_FloatToString_ReturnValue_1) == 0x000060, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_Conv_FloatToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_Concat_StrStr_ReturnValue_1) == 0x000070, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_Concat_StrStr_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos, CallFunc_Concat_StrStr_ReturnValue_2) == 0x000080, "Member 'UI_TreasureHuntRadarChartIcon_C_CalcLoc2Pos::CallFunc_Concat_StrStr_ReturnValue_2' has a wrong offset!");

}

