#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_TreasureHuntRadarChart

#include "Basic.hpp"

#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function UI_TreasureHuntRadarChart.UI_TreasureHuntRadarChart_C.BP_HiddenSelfWhenNoIconShow
// 0x0004 (0x0004 - 0x0000)
struct UI_TreasureHuntRadarChart_C_BP_HiddenSelfWhenNoIconShow final
{
public:
	int32                                         InShowIconCount;                                   // 0x0000(0x0004)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TreasureHuntRadarChart_C_BP_HiddenSelfWhenNoIconShow) == 0x000004, "Wrong alignment on UI_TreasureHuntRadarChart_C_BP_HiddenSelfWhenNoIconShow");
static_assert(sizeof(UI_TreasureHuntRadarChart_C_BP_HiddenSelfWhenNoIconShow) == 0x000004, "Wrong size on UI_TreasureHuntRadarChart_C_BP_HiddenSelfWhenNoIconShow");
static_assert(offsetof(UI_TreasureHuntRadarChart_C_BP_HiddenSelfWhenNoIconShow, InShowIconCount) == 0x000000, "Member 'UI_TreasureHuntRadarChart_C_BP_HiddenSelfWhenNoIconShow::InShowIconCount' has a wrong offset!");

// Function UI_TreasureHuntRadarChart.UI_TreasureHuntRadarChart_C.ExecuteUbergraph_UI_TreasureHuntRadarChart
// 0x0010 (0x0010 - 0x0000)
struct UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InShowIconCount;                      // 0x0004(0x0004)(ConstParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0009(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          ___bool_Variable;                                  // 0x000A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              ___byte_Variable;                                  // 0x000B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ___byte_Variable_1;                                // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x000D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart) == 0x000004, "Wrong alignment on UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart");
static_assert(sizeof(UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart) == 0x000010, "Wrong size on UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart");
static_assert(offsetof(UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart, EntryPoint) == 0x000000, "Member 'UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart, K2Node_Event_InShowIconCount) == 0x000004, "Member 'UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart::K2Node_Event_InShowIconCount' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart, CallFunc_Greater_IntInt_ReturnValue) == 0x000008, "Member 'UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart, CallFunc_IsValid_ReturnValue) == 0x000009, "Member 'UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart, ___bool_Variable) == 0x00000A, "Member 'UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart::___bool_Variable' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart, ___byte_Variable) == 0x00000B, "Member 'UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart::___byte_Variable' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart, ___byte_Variable_1) == 0x00000C, "Member 'UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart, K2Node_Select_Default) == 0x00000D, "Member 'UI_TreasureHuntRadarChart_C_ExecuteUbergraph_UI_TreasureHuntRadarChart::K2Node_Select_Default' has a wrong offset!");

}

