#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_TopRoleID

#include "Basic.hpp"

#include "QRSL_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function UI_TopRoleID.UI_TopRoleID_C.ExecuteUbergraph_UI_TopRoleID
// 0x00D8 (0x00D8 - 0x0000)
struct UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShowRoleID_Succeed;                       // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_IsDesignTime;                         // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E43[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class UQRSLGameUserSettings*                  CallFunc_GetCachedGameUserSettings_CachedGameUserSettings; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRoleContext                           CallFunc_GetRoleContext_ReturnValue;               // 0x0010(0x0030)(ConstParm)
	bool                                          CallFunc_NotEqual_Int64Int64_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E44[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SplitRoleId_OutServerId;                  // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SplitRoleId_OutUserId;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E45[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0080(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00B8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E46[0x4];                                     // 0x00BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x00C0(0x0018)()
};
static_assert(alignof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID) == 0x000008, "Wrong alignment on UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID");
static_assert(sizeof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID) == 0x0000D8, "Wrong size on UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, EntryPoint) == 0x000000, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, CallFunc_ShowRoleID_Succeed) == 0x000004, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::CallFunc_ShowRoleID_Succeed' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, K2Node_Event_IsDesignTime) == 0x000005, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::K2Node_Event_IsDesignTime' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, CallFunc_GetCachedGameUserSettings_CachedGameUserSettings) == 0x000008, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::CallFunc_GetCachedGameUserSettings_CachedGameUserSettings' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, CallFunc_GetRoleContext_ReturnValue) == 0x000010, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::CallFunc_GetRoleContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, CallFunc_NotEqual_Int64Int64_ReturnValue) == 0x000040, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::CallFunc_NotEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, CallFunc_SplitRoleId_OutServerId) == 0x000044, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::CallFunc_SplitRoleId_OutServerId' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, CallFunc_SplitRoleId_OutUserId) == 0x000048, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::CallFunc_SplitRoleId_OutUserId' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, CallFunc_Conv_IntToString_ReturnValue) == 0x000050, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000060, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, K2Node_Event_MyGeometry) == 0x000080, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, K2Node_Event_InDeltaTime) == 0x0000B8, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID, CallFunc_Conv_StringToText_ReturnValue) == 0x0000C0, "Member 'UI_TopRoleID_C_ExecuteUbergraph_UI_TopRoleID::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

// Function UI_TopRoleID.UI_TopRoleID_C.Tick
// 0x003C (0x003C - 0x0000)
struct UI_TopRoleID_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TopRoleID_C_Tick) == 0x000004, "Wrong alignment on UI_TopRoleID_C_Tick");
static_assert(sizeof(UI_TopRoleID_C_Tick) == 0x00003C, "Wrong size on UI_TopRoleID_C_Tick");
static_assert(offsetof(UI_TopRoleID_C_Tick, MyGeometry) == 0x000000, "Member 'UI_TopRoleID_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_Tick, InDeltaTime) == 0x000038, "Member 'UI_TopRoleID_C_Tick::InDeltaTime' has a wrong offset!");

// Function UI_TopRoleID.UI_TopRoleID_C.PreConstruct
// 0x0001 (0x0001 - 0x0000)
struct UI_TopRoleID_C_PreConstruct final
{
public:
	bool                                          IsDesignTime;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_TopRoleID_C_PreConstruct) == 0x000001, "Wrong alignment on UI_TopRoleID_C_PreConstruct");
static_assert(sizeof(UI_TopRoleID_C_PreConstruct) == 0x000001, "Wrong size on UI_TopRoleID_C_PreConstruct");
static_assert(offsetof(UI_TopRoleID_C_PreConstruct, IsDesignTime) == 0x000000, "Member 'UI_TopRoleID_C_PreConstruct::IsDesignTime' has a wrong offset!");

// Function UI_TopRoleID.UI_TopRoleID_C.GetCachedGameUserSettings
// 0x0018 (0x0018 - 0x0000)
struct UI_TopRoleID_C_GetCachedGameUserSettings final
{
public:
	class UQRSLGameUserSettings*                  CachedGameUserSettings;                            // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQRSLGameUserSettings*                  CallFunc_GetQRSLGameUserSettings_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_TopRoleID_C_GetCachedGameUserSettings) == 0x000008, "Wrong alignment on UI_TopRoleID_C_GetCachedGameUserSettings");
static_assert(sizeof(UI_TopRoleID_C_GetCachedGameUserSettings) == 0x000018, "Wrong size on UI_TopRoleID_C_GetCachedGameUserSettings");
static_assert(offsetof(UI_TopRoleID_C_GetCachedGameUserSettings, CachedGameUserSettings) == 0x000000, "Member 'UI_TopRoleID_C_GetCachedGameUserSettings::CachedGameUserSettings' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_GetCachedGameUserSettings, CallFunc_GetQRSLGameUserSettings_ReturnValue) == 0x000008, "Member 'UI_TopRoleID_C_GetCachedGameUserSettings::CallFunc_GetQRSLGameUserSettings_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_GetCachedGameUserSettings, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'UI_TopRoleID_C_GetCachedGameUserSettings::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function UI_TopRoleID.UI_TopRoleID_C.ShowRoleID
// 0x0098 (0x0098 - 0x0000)
struct UI_TopRoleID_C_ShowRoleID final
{
public:
	bool                                          Succeed;                                           // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E47[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQRSLGameUserSettings*                  CallFunc_GetCachedGameUserSettings_CachedGameUserSettings; // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRoleContext                           CallFunc_GetRoleContext_ReturnValue;               // 0x0010(0x0030)(ConstParm)
	int32                                         CallFunc_SplitRoleId_OutServerId;                  // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_SplitRoleId_OutUserId;                    // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_Int64Int64_ReturnValue;        // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E48[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_Conv_IntToString_ReturnValue;             // 0x0050(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Conv_IntToString_ReturnValue_1;           // 0x0060(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                 CallFunc_Concat_StrStr_ReturnValue;                // 0x0070(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0080(0x0018)()
};
static_assert(alignof(UI_TopRoleID_C_ShowRoleID) == 0x000008, "Wrong alignment on UI_TopRoleID_C_ShowRoleID");
static_assert(sizeof(UI_TopRoleID_C_ShowRoleID) == 0x000098, "Wrong size on UI_TopRoleID_C_ShowRoleID");
static_assert(offsetof(UI_TopRoleID_C_ShowRoleID, Succeed) == 0x000000, "Member 'UI_TopRoleID_C_ShowRoleID::Succeed' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ShowRoleID, CallFunc_GetCachedGameUserSettings_CachedGameUserSettings) == 0x000008, "Member 'UI_TopRoleID_C_ShowRoleID::CallFunc_GetCachedGameUserSettings_CachedGameUserSettings' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ShowRoleID, CallFunc_GetRoleContext_ReturnValue) == 0x000010, "Member 'UI_TopRoleID_C_ShowRoleID::CallFunc_GetRoleContext_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ShowRoleID, CallFunc_SplitRoleId_OutServerId) == 0x000040, "Member 'UI_TopRoleID_C_ShowRoleID::CallFunc_SplitRoleId_OutServerId' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ShowRoleID, CallFunc_SplitRoleId_OutUserId) == 0x000044, "Member 'UI_TopRoleID_C_ShowRoleID::CallFunc_SplitRoleId_OutUserId' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ShowRoleID, CallFunc_EqualEqual_Int64Int64_ReturnValue) == 0x000048, "Member 'UI_TopRoleID_C_ShowRoleID::CallFunc_EqualEqual_Int64Int64_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ShowRoleID, CallFunc_Conv_IntToString_ReturnValue) == 0x000050, "Member 'UI_TopRoleID_C_ShowRoleID::CallFunc_Conv_IntToString_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ShowRoleID, CallFunc_Conv_IntToString_ReturnValue_1) == 0x000060, "Member 'UI_TopRoleID_C_ShowRoleID::CallFunc_Conv_IntToString_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ShowRoleID, CallFunc_Concat_StrStr_ReturnValue) == 0x000070, "Member 'UI_TopRoleID_C_ShowRoleID::CallFunc_Concat_StrStr_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TopRoleID_C_ShowRoleID, CallFunc_Conv_StringToText_ReturnValue) == 0x000080, "Member 'UI_TopRoleID_C_ShowRoleID::CallFunc_Conv_StringToText_ReturnValue' has a wrong offset!");

}

