#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_TeamQuickMemberWidget

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"
#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_TeamQuickMemberWidget.UI_TeamQuickMemberWidget_C
// 0x0058 (0x0FD0 - 0x0F78)
class UUI_TeamQuickMemberWidget_C final : public UQRSLUI_TeamQuickMemberWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0F78(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 Image;                                             // 0x0F80(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_1;                                           // 0x0F88(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_5;                                           // 0x0F90(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_109;                                         // 0x0F98(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_124;                                         // 0x0FA0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_193;                                         // 0x0FA8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_198;                                         // 0x0FB0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_237;                                         // 0x0FB8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgSelfRegression;                                 // 0x0FC0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgSelfRegression_1;                               // 0x0FC8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_TeamQuickMemberWidget(int32 EntryPoint);
	void BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature(class UWidget* InWidget, ESlateVisibility InNewVisibility, ESlateVisibility InOldVisibility);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_TeamQuickMemberWidget_C">();
	}
	static class UUI_TeamQuickMemberWidget_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_TeamQuickMemberWidget_C>();
	}
};
static_assert(alignof(UUI_TeamQuickMemberWidget_C) == 0x000008, "Wrong alignment on UUI_TeamQuickMemberWidget_C");
static_assert(sizeof(UUI_TeamQuickMemberWidget_C) == 0x000FD0, "Wrong size on UUI_TeamQuickMemberWidget_C");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, UberGraphFrame) == 0x000F78, "Member 'UUI_TeamQuickMemberWidget_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, Image) == 0x000F80, "Member 'UUI_TeamQuickMemberWidget_C::Image' has a wrong offset!");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, Image_1) == 0x000F88, "Member 'UUI_TeamQuickMemberWidget_C::Image_1' has a wrong offset!");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, Image_5) == 0x000F90, "Member 'UUI_TeamQuickMemberWidget_C::Image_5' has a wrong offset!");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, Image_109) == 0x000F98, "Member 'UUI_TeamQuickMemberWidget_C::Image_109' has a wrong offset!");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, Image_124) == 0x000FA0, "Member 'UUI_TeamQuickMemberWidget_C::Image_124' has a wrong offset!");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, Image_193) == 0x000FA8, "Member 'UUI_TeamQuickMemberWidget_C::Image_193' has a wrong offset!");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, Image_198) == 0x000FB0, "Member 'UUI_TeamQuickMemberWidget_C::Image_198' has a wrong offset!");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, Image_237) == 0x000FB8, "Member 'UUI_TeamQuickMemberWidget_C::Image_237' has a wrong offset!");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, ImgSelfRegression) == 0x000FC0, "Member 'UUI_TeamQuickMemberWidget_C::ImgSelfRegression' has a wrong offset!");
static_assert(offsetof(UUI_TeamQuickMemberWidget_C, ImgSelfRegression_1) == 0x000FC8, "Member 'UUI_TeamQuickMemberWidget_C::ImgSelfRegression_1' has a wrong offset!");

}

