#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_TeamQuickMemberWidget

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function UI_TeamQuickMemberWidget.UI_TeamQuickMemberWidget_C.ExecuteUbergraph_UI_TeamQuickMemberWidget
// 0x0048 (0x0048 - 0x0000)
struct UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E3F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable;                                // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	class AHottaHUD*                              CallFunc_BP_GetHottaHUD_ReturnValue;               // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                K2Node_ComponentBoundEvent_InWidget;               // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InNewVisibility;        // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InOldVisibility;        // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E40[0x2];                                     // 0x003A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget) == 0x000008, "Wrong alignment on UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget");
static_assert(sizeof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget) == 0x000048, "Wrong size on UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget, EntryPoint) == 0x000000, "Member 'UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget, ___struct_Variable) == 0x000008, "Member 'UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget::___struct_Variable' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget, ___delegate_Variable) == 0x000018, "Member 'UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget, CallFunc_BP_GetHottaHUD_ReturnValue) == 0x000028, "Member 'UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget::CallFunc_BP_GetHottaHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget, K2Node_ComponentBoundEvent_InWidget) == 0x000030, "Member 'UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget, K2Node_ComponentBoundEvent_InNewVisibility) == 0x000038, "Member 'UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget::K2Node_ComponentBoundEvent_InNewVisibility' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget, K2Node_ComponentBoundEvent_InOldVisibility) == 0x000039, "Member 'UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget::K2Node_ComponentBoundEvent_InOldVisibility' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget, CallFunc_PostEvent_ReturnValue) == 0x00003C, "Member 'UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget, CallFunc_EqualEqual_ByteByte_ReturnValue) == 0x000040, "Member 'UI_TeamQuickMemberWidget_C_ExecuteUbergraph_UI_TeamQuickMemberWidget::CallFunc_EqualEqual_ByteByte_ReturnValue' has a wrong offset!");

// Function UI_TeamQuickMemberWidget.UI_TeamQuickMemberWidget_C.BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InNewVisibility;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InOldVisibility;                                   // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature");
static_assert(sizeof(UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature) == 0x000010, "Wrong size on UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature, InWidget) == 0x000000, "Member 'UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature::InWidget' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature, InNewVisibility) == 0x000008, "Member 'UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature::InNewVisibility' has a wrong offset!");
static_assert(offsetof(UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature, InOldVisibility) == 0x000009, "Member 'UI_TeamQuickMemberWidget_C_BndEvt__UI_TeamQuickMemberWidget_MenuCanvasPanel_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature::InOldVisibility' has a wrong offset!");

}

