#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_WeaponController_pc

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_WeaponController_pc.UI_WeaponController_pc_C
// 0x00E8 (0x09C0 - 0x08D8)
class UUI_WeaponController_pc_C final : public UQRSLUI_WeaponController
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x08D8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       WeaponChangeIn1;                                   // 0x08E0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponChangeOut1;                                  // 0x08E8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponChangeOut0;                                  // 0x08F0(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                       WeaponChangeIn0;                                   // 0x08F8(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UImage*                                 AnimationIn0;                                      // 0x0900(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AnimationIn1;                                      // 0x0908(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AnimationOut0;                                     // 0x0910(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 AnimationOut1;                                     // 0x0918(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key;                                            // 0x0920(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_1;                                          // 0x0928(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_2;                                          // 0x0930(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_3;                                          // 0x0938(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_100;                                        // 0x0940(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle_74;                                     // 0x0948(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle_292;                                    // 0x0950(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WeaponChange_C*                     WeaponChange_0;                                    // 0x0958(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_WeaponChange1_C*                    WeaponChange_1;                                    // 0x0960(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                          IsGamepad;                                         // 0x0968(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_57F4[0x7];                                     // 0x0969(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TMap<class FName, class FName>                EventNameMap;                                      // 0x0970(0x0050)(Edit, BlueprintVisible, DisableEditOnInstance)

public:
	void ExecuteUbergraph_UI_WeaponController_pc(int32 EntryPoint);
	void ChangeWeaponShortcutKey(int32 ButtonIndex, int32 WeaponSlot);
	void BPOnGamepadInputChanged(bool bGamepad);
	void AnimationIn1_Event_0(class UImage* Param_AnimationIn1);
	void AnimationIn0_Event_0(class UImage* Param_AnimationIn0);
	class FName GetWeaponShortcutKey(int32 ButtonIndex);
	void ChangeShortcutKey(int32 ButtonIndex, int32 WeaponSlot);
	void GetRealShortcutKey(class FName EventName, class FName* RealEventName);
	void SequenceEvent__ENTRYPOINTUI_WeaponController_pc_0(class UImage* Param_AnimationIn0);
	void SequenceEvent__ENTRYPOINTUI_WeaponController_pc_1(class UImage* Param_AnimationIn1);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_WeaponController_pc_C">();
	}
	static class UUI_WeaponController_pc_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_WeaponController_pc_C>();
	}
};
static_assert(alignof(UUI_WeaponController_pc_C) == 0x000008, "Wrong alignment on UUI_WeaponController_pc_C");
static_assert(sizeof(UUI_WeaponController_pc_C) == 0x0009C0, "Wrong size on UUI_WeaponController_pc_C");
static_assert(offsetof(UUI_WeaponController_pc_C, UberGraphFrame) == 0x0008D8, "Member 'UUI_WeaponController_pc_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, WeaponChangeIn1) == 0x0008E0, "Member 'UUI_WeaponController_pc_C::WeaponChangeIn1' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, WeaponChangeOut1) == 0x0008E8, "Member 'UUI_WeaponController_pc_C::WeaponChangeOut1' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, WeaponChangeOut0) == 0x0008F0, "Member 'UUI_WeaponController_pc_C::WeaponChangeOut0' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, WeaponChangeIn0) == 0x0008F8, "Member 'UUI_WeaponController_pc_C::WeaponChangeIn0' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, AnimationIn0) == 0x000900, "Member 'UUI_WeaponController_pc_C::AnimationIn0' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, AnimationIn1) == 0x000908, "Member 'UUI_WeaponController_pc_C::AnimationIn1' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, AnimationOut0) == 0x000910, "Member 'UUI_WeaponController_pc_C::AnimationOut0' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, AnimationOut1) == 0x000918, "Member 'UUI_WeaponController_pc_C::AnimationOut1' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, PC_Key) == 0x000920, "Member 'UUI_WeaponController_pc_C::PC_Key' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, PC_Key_1) == 0x000928, "Member 'UUI_WeaponController_pc_C::PC_Key_1' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, PC_Key_2) == 0x000930, "Member 'UUI_WeaponController_pc_C::PC_Key_2' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, PC_Key_3) == 0x000938, "Member 'UUI_WeaponController_pc_C::PC_Key_3' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, PC_Key_100) == 0x000940, "Member 'UUI_WeaponController_pc_C::PC_Key_100' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, UIParticle_74) == 0x000948, "Member 'UUI_WeaponController_pc_C::UIParticle_74' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, UIParticle_292) == 0x000950, "Member 'UUI_WeaponController_pc_C::UIParticle_292' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, WeaponChange_0) == 0x000958, "Member 'UUI_WeaponController_pc_C::WeaponChange_0' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, WeaponChange_1) == 0x000960, "Member 'UUI_WeaponController_pc_C::WeaponChange_1' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, IsGamepad) == 0x000968, "Member 'UUI_WeaponController_pc_C::IsGamepad' has a wrong offset!");
static_assert(offsetof(UUI_WeaponController_pc_C, EventNameMap) == 0x000970, "Member 'UUI_WeaponController_pc_C::EventNameMap' has a wrong offset!");

}

