#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_WeaponChange1

#include "Basic.hpp"


namespace SDK::Params
{

// Function UI_WeaponChange1.UI_WeaponChange1_C.ExecuteUbergraph_UI_WeaponChange1
// 0x0018 (0x0018 - 0x0000)
struct UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1 final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E3E[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUIParticle*                            K2Node_CustomEvent_ChangeNoticeParticle;           // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkComponentAtLocation_ReturnValue;   // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1) == 0x000008, "Wrong alignment on UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1");
static_assert(sizeof(UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1) == 0x000018, "Wrong size on UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1");
static_assert(offsetof(UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1, EntryPoint) == 0x000000, "Member 'UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1::EntryPoint' has a wrong offset!");
static_assert(offsetof(UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1, K2Node_CustomEvent_ChangeNoticeParticle) == 0x000008, "Member 'UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1::K2Node_CustomEvent_ChangeNoticeParticle' has a wrong offset!");
static_assert(offsetof(UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1, CallFunc_SpawnAkComponentAtLocation_ReturnValue) == 0x000010, "Member 'UI_WeaponChange1_C_ExecuteUbergraph_UI_WeaponChange1::CallFunc_SpawnAkComponentAtLocation_ReturnValue' has a wrong offset!");

// Function UI_WeaponChange1.UI_WeaponChange1_C.ChangeNoticeParticle_Event_0
// 0x0008 (0x0008 - 0x0000)
struct UI_WeaponChange1_C_ChangeNoticeParticle_Event_0 final
{
public:
	class UUIParticle*                            Param_ChangeNoticeParticle;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_WeaponChange1_C_ChangeNoticeParticle_Event_0) == 0x000008, "Wrong alignment on UI_WeaponChange1_C_ChangeNoticeParticle_Event_0");
static_assert(sizeof(UI_WeaponChange1_C_ChangeNoticeParticle_Event_0) == 0x000008, "Wrong size on UI_WeaponChange1_C_ChangeNoticeParticle_Event_0");
static_assert(offsetof(UI_WeaponChange1_C_ChangeNoticeParticle_Event_0, Param_ChangeNoticeParticle) == 0x000000, "Member 'UI_WeaponChange1_C_ChangeNoticeParticle_Event_0::Param_ChangeNoticeParticle' has a wrong offset!");

// Function UI_WeaponChange1.UI_WeaponChange1_C.SequenceEvent__ENTRYPOINTUI_WeaponChange1_0
// 0x0008 (0x0008 - 0x0000)
struct UI_WeaponChange1_C_SequenceEvent__ENTRYPOINTUI_WeaponChange1_0 final
{
public:
	class UUIParticle*                            Param_ChangeNoticeParticle;                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UI_WeaponChange1_C_SequenceEvent__ENTRYPOINTUI_WeaponChange1_0) == 0x000008, "Wrong alignment on UI_WeaponChange1_C_SequenceEvent__ENTRYPOINTUI_WeaponChange1_0");
static_assert(sizeof(UI_WeaponChange1_C_SequenceEvent__ENTRYPOINTUI_WeaponChange1_0) == 0x000008, "Wrong size on UI_WeaponChange1_C_SequenceEvent__ENTRYPOINTUI_WeaponChange1_0");
static_assert(offsetof(UI_WeaponChange1_C_SequenceEvent__ENTRYPOINTUI_WeaponChange1_0, Param_ChangeNoticeParticle) == 0x000000, "Member 'UI_WeaponChange1_C_SequenceEvent__ENTRYPOINTUI_WeaponChange1_0::Param_ChangeNoticeParticle' has a wrong offset!");

}

