#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UI_WeaponChange

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass UI_WeaponChange.UI_WeaponChange_C
// 0x0038 (0x09B0 - 0x0978)
class UUI_WeaponChange_C final : public UQRSLUI_WeaponChange
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0978(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                       ScaleAnim;                                         // 0x0980(0x0008)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUIParticle*                            ChangeNoticeParticle;                              // 0x0988(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_117;                                         // 0x0990(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_256;                                         // 0x0998(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_456;                                         // 0x09A0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         ButtonX;                                           // 0x09A8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ButtonY;                                           // 0x09AC(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UI_WeaponChange(int32 EntryPoint);
	void ChangeNoticeParticle_Event_1(class UUIParticle* Param_ChangeNoticeParticle);
	void SequenceEvent__ENTRYPOINTUI_WeaponChange_0(class UUIParticle* Param_ChangeNoticeParticle);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UI_WeaponChange_C">();
	}
	static class UUI_WeaponChange_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UUI_WeaponChange_C>();
	}
};
static_assert(alignof(UUI_WeaponChange_C) == 0x000008, "Wrong alignment on UUI_WeaponChange_C");
static_assert(sizeof(UUI_WeaponChange_C) == 0x0009B0, "Wrong size on UUI_WeaponChange_C");
static_assert(offsetof(UUI_WeaponChange_C, UberGraphFrame) == 0x000978, "Member 'UUI_WeaponChange_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UUI_WeaponChange_C, ScaleAnim) == 0x000980, "Member 'UUI_WeaponChange_C::ScaleAnim' has a wrong offset!");
static_assert(offsetof(UUI_WeaponChange_C, ChangeNoticeParticle) == 0x000988, "Member 'UUI_WeaponChange_C::ChangeNoticeParticle' has a wrong offset!");
static_assert(offsetof(UUI_WeaponChange_C, Image_117) == 0x000990, "Member 'UUI_WeaponChange_C::Image_117' has a wrong offset!");
static_assert(offsetof(UUI_WeaponChange_C, Image_256) == 0x000998, "Member 'UUI_WeaponChange_C::Image_256' has a wrong offset!");
static_assert(offsetof(UUI_WeaponChange_C, Image_456) == 0x0009A0, "Member 'UUI_WeaponChange_C::Image_456' has a wrong offset!");
static_assert(offsetof(UUI_WeaponChange_C, ButtonX) == 0x0009A8, "Member 'UUI_WeaponChange_C::ButtonX' has a wrong offset!");
static_assert(offsetof(UUI_WeaponChange_C, ButtonY) == 0x0009AC, "Member 'UUI_WeaponChange_C::ButtonY' has a wrong offset!");

}

