#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UIParticle

#include "Basic.hpp"


namespace SDK::Params
{

// Function UIParticle.UIParticle.SetPlayParticle
// 0x0001 (0x0001 - 0x0000)
struct UIParticle_SetPlayParticle final
{
public:
	bool                                          InPlayParticle;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIParticle_SetPlayParticle) == 0x000001, "Wrong alignment on UIParticle_SetPlayParticle");
static_assert(sizeof(UIParticle_SetPlayParticle) == 0x000001, "Wrong size on UIParticle_SetPlayParticle");
static_assert(offsetof(UIParticle_SetPlayParticle, InPlayParticle) == 0x000000, "Member 'UIParticle_SetPlayParticle::InPlayParticle' has a wrong offset!");

// Function UIParticle.UIParticleEmitter.SetParticleRotationStart
// 0x0004 (0x0004 - 0x0000)
struct UIParticleEmitter_SetParticleRotationStart final
{
public:
	float                                         InRotation;                                        // 0x0000(0x0004)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIParticleEmitter_SetParticleRotationStart) == 0x000004, "Wrong alignment on UIParticleEmitter_SetParticleRotationStart");
static_assert(sizeof(UIParticleEmitter_SetParticleRotationStart) == 0x000004, "Wrong size on UIParticleEmitter_SetParticleRotationStart");
static_assert(offsetof(UIParticleEmitter_SetParticleRotationStart, InRotation) == 0x000000, "Member 'UIParticleEmitter_SetParticleRotationStart::InRotation' has a wrong offset!");

// Function UIParticle.UIParticleEmitter.SetPlayParticle
// 0x0001 (0x0001 - 0x0000)
struct UIParticleEmitter_SetPlayParticle final
{
public:
	bool                                          InPlayParticle;                                    // 0x0000(0x0001)(Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};
static_assert(alignof(UIParticleEmitter_SetPlayParticle) == 0x000001, "Wrong alignment on UIParticleEmitter_SetPlayParticle");
static_assert(sizeof(UIParticleEmitter_SetPlayParticle) == 0x000001, "Wrong size on UIParticleEmitter_SetPlayParticle");
static_assert(offsetof(UIParticleEmitter_SetPlayParticle, InPlayParticle) == 0x000000, "Member 'UIParticleEmitter_SetPlayParticle::InPlayParticle' has a wrong offset!");

}

