#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnlockMap_Vera_SLY

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UnlockMap_Vera_SLY.UnlockMap_Vera_SLY_C
// 0x0040 (0x05E0 - 0x05A0)
class AUnlockMap_Vera_SLY_C final : public AHottaVisualActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UQRSLChangeMeshColorComponent*          QRSLChangeMeshColor;                               // 0x05A8(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USphereComponent*                       Sphere;                                            // 0x05B0(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                         Map_Region_Index;                                  // 0x05B8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5585[0x4];                                     // 0x05BC(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FInteractEntry>                 Out_Interact_Entries;                              // 0x05C0(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                   MapPoint;                                          // 0x05D0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UnlockMap_Vera_SLY(int32 EntryPoint);
	void OnMapRegionUnlock_Event_0(int32 FowID);
	void BPOnMainRoleLoadFinished(class AHottaPlayerCharacter* MainPlayer);
	void Flash();
	void BPInteractFinished(class AHottaPlayerController* ByPC, int32 InteractIndex);
	void BPGetInteractEntries(class AHottaPlayerController* ByPC, TArray<struct FInteractEntry>* OutInteractEntries);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UnlockMap_Vera_SLY_C">();
	}
	static class AUnlockMap_Vera_SLY_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUnlockMap_Vera_SLY_C>();
	}
};
static_assert(alignof(AUnlockMap_Vera_SLY_C) == 0x000010, "Wrong alignment on AUnlockMap_Vera_SLY_C");
static_assert(sizeof(AUnlockMap_Vera_SLY_C) == 0x0005E0, "Wrong size on AUnlockMap_Vera_SLY_C");
static_assert(offsetof(AUnlockMap_Vera_SLY_C, UberGraphFrame) == 0x0005A0, "Member 'AUnlockMap_Vera_SLY_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AUnlockMap_Vera_SLY_C, QRSLChangeMeshColor) == 0x0005A8, "Member 'AUnlockMap_Vera_SLY_C::QRSLChangeMeshColor' has a wrong offset!");
static_assert(offsetof(AUnlockMap_Vera_SLY_C, Sphere) == 0x0005B0, "Member 'AUnlockMap_Vera_SLY_C::Sphere' has a wrong offset!");
static_assert(offsetof(AUnlockMap_Vera_SLY_C, Map_Region_Index) == 0x0005B8, "Member 'AUnlockMap_Vera_SLY_C::Map_Region_Index' has a wrong offset!");
static_assert(offsetof(AUnlockMap_Vera_SLY_C, Out_Interact_Entries) == 0x0005C0, "Member 'AUnlockMap_Vera_SLY_C::Out_Interact_Entries' has a wrong offset!");
static_assert(offsetof(AUnlockMap_Vera_SLY_C, MapPoint) == 0x0005D0, "Member 'AUnlockMap_Vera_SLY_C::MapPoint' has a wrong offset!");

}

