#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: UnlockMap_Vera_SLY

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"
#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function UnlockMap_Vera_SLY.UnlockMap_Vera_SLY_C.ExecuteUbergraph_UnlockMap_Vera_SLY
// 0x00B0 (0x00B0 - 0x0000)
struct UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5586[0x2];                                     // 0x0006(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x0008(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(int32 FowID)>                  K2Node_CreateDelegate_OutputDelegate_1;            // 0x0018(0x0010)(ZeroConstructor, NoDestructor)
	struct FTimerHandle                           CallFunc_K2_SetTimerDelegate_ReturnValue;          // 0x0028(0x0008)(NoDestructor, HasGetValueTypeHash)
	class AHottaPlayerController*                 K2Node_Event_ByPC;                                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InteractIndex;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5587[0x4];                                     // 0x003C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5588[0x7];                                     // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_Event_MainPlayer;                           // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_1;       // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapRegionUnlock_ReturnValue;            // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5589[0x2];                                     // 0x006A(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         K2Node_CustomEvent_FowID;                          // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FMapPointInfo                          K2Node_MakeStruct_MapPointInfo;                    // 0x0070(0x000C)(NoDestructor)
	uint8                                         Pad_558A[0x4];                                     // 0x007C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x0080(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character_2;       // 0x0088(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_2;                     // 0x0090(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_558B[0x7];                                     // 0x0091(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AQRSLHUD*                               CallFunc_GetQRSLHUD_ReturnValue;                   // 0x0098(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_WarFogMiniMap*                      CallFunc_OpenWarFogOverviewMap_ReturnValue;        // 0x00A0(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY) == 0x000008, "Wrong alignment on UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY");
static_assert(sizeof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY) == 0x0000B0, "Wrong size on UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, EntryPoint) == 0x000000, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::EntryPoint' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, ___bool_Variable) == 0x000004, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::___bool_Variable' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, CallFunc_Not_PreBool_ReturnValue) == 0x000005, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_CreateDelegate_OutputDelegate) == 0x000008, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_CreateDelegate_OutputDelegate_1) == 0x000018, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, CallFunc_K2_SetTimerDelegate_ReturnValue) == 0x000028, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::CallFunc_K2_SetTimerDelegate_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_Event_ByPC) == 0x000030, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_Event_ByPC' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_Event_InteractIndex) == 0x000038, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_Event_InteractIndex' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000040, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000048, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_DynamicCast_bSuccess) == 0x000050, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_Event_MainPlayer) == 0x000058, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_Event_MainPlayer' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_DynamicCast_AsQRSLPlayer_Character_1) == 0x000060, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_DynamicCast_AsQRSLPlayer_Character_1' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_DynamicCast_bSuccess_1) == 0x000068, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, CallFunc_IsMapRegionUnlock_ReturnValue) == 0x000069, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::CallFunc_IsMapRegionUnlock_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_CustomEvent_FowID) == 0x00006C, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_CustomEvent_FowID' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_MakeStruct_MapPointInfo) == 0x000070, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_MakeStruct_MapPointInfo' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x000080, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_DynamicCast_AsQRSLPlayer_Character_2) == 0x000088, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_DynamicCast_AsQRSLPlayer_Character_2' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, K2Node_DynamicCast_bSuccess_2) == 0x000090, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::K2Node_DynamicCast_bSuccess_2' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, CallFunc_GetQRSLHUD_ReturnValue) == 0x000098, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::CallFunc_GetQRSLHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, CallFunc_OpenWarFogOverviewMap_ReturnValue) == 0x0000A0, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::CallFunc_OpenWarFogOverviewMap_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY, CallFunc_EqualEqual_IntInt_ReturnValue) == 0x0000A8, "Member 'UnlockMap_Vera_SLY_C_ExecuteUbergraph_UnlockMap_Vera_SLY::CallFunc_EqualEqual_IntInt_ReturnValue' has a wrong offset!");

// Function UnlockMap_Vera_SLY.UnlockMap_Vera_SLY_C.OnMapRegionUnlock_Event_0
// 0x0004 (0x0004 - 0x0000)
struct UnlockMap_Vera_SLY_C_OnMapRegionUnlock_Event_0 final
{
public:
	int32                                         FowID;                                             // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UnlockMap_Vera_SLY_C_OnMapRegionUnlock_Event_0) == 0x000004, "Wrong alignment on UnlockMap_Vera_SLY_C_OnMapRegionUnlock_Event_0");
static_assert(sizeof(UnlockMap_Vera_SLY_C_OnMapRegionUnlock_Event_0) == 0x000004, "Wrong size on UnlockMap_Vera_SLY_C_OnMapRegionUnlock_Event_0");
static_assert(offsetof(UnlockMap_Vera_SLY_C_OnMapRegionUnlock_Event_0, FowID) == 0x000000, "Member 'UnlockMap_Vera_SLY_C_OnMapRegionUnlock_Event_0::FowID' has a wrong offset!");

// Function UnlockMap_Vera_SLY.UnlockMap_Vera_SLY_C.BPOnMainRoleLoadFinished
// 0x0008 (0x0008 - 0x0000)
struct UnlockMap_Vera_SLY_C_BPOnMainRoleLoadFinished final
{
public:
	class AHottaPlayerCharacter*                  MainPlayer;                                        // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UnlockMap_Vera_SLY_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong alignment on UnlockMap_Vera_SLY_C_BPOnMainRoleLoadFinished");
static_assert(sizeof(UnlockMap_Vera_SLY_C_BPOnMainRoleLoadFinished) == 0x000008, "Wrong size on UnlockMap_Vera_SLY_C_BPOnMainRoleLoadFinished");
static_assert(offsetof(UnlockMap_Vera_SLY_C_BPOnMainRoleLoadFinished, MainPlayer) == 0x000000, "Member 'UnlockMap_Vera_SLY_C_BPOnMainRoleLoadFinished::MainPlayer' has a wrong offset!");

// Function UnlockMap_Vera_SLY.UnlockMap_Vera_SLY_C.BPInteractFinished
// 0x0010 (0x0010 - 0x0000)
struct UnlockMap_Vera_SLY_C_BPInteractFinished final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InteractIndex;                                     // 0x0008(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(UnlockMap_Vera_SLY_C_BPInteractFinished) == 0x000008, "Wrong alignment on UnlockMap_Vera_SLY_C_BPInteractFinished");
static_assert(sizeof(UnlockMap_Vera_SLY_C_BPInteractFinished) == 0x000010, "Wrong size on UnlockMap_Vera_SLY_C_BPInteractFinished");
static_assert(offsetof(UnlockMap_Vera_SLY_C_BPInteractFinished, ByPC) == 0x000000, "Member 'UnlockMap_Vera_SLY_C_BPInteractFinished::ByPC' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_BPInteractFinished, InteractIndex) == 0x000008, "Member 'UnlockMap_Vera_SLY_C_BPInteractFinished::InteractIndex' has a wrong offset!");

// Function UnlockMap_Vera_SLY.UnlockMap_Vera_SLY_C.BPGetInteractEntries
// 0x0030 (0x0030 - 0x0000)
struct UnlockMap_Vera_SLY_C_BPGetInteractEntries final
{
public:
	class AHottaPlayerController*                 ByPC;                                              // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInteractEntry>                 OutInteractEntries;                                // 0x0008(0x0010)(Parm, OutParm, ContainsInstancedReference)
	class AHottaPlayerCharacter*                  CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsMapRegionUnlock_ReturnValue;            // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(UnlockMap_Vera_SLY_C_BPGetInteractEntries) == 0x000008, "Wrong alignment on UnlockMap_Vera_SLY_C_BPGetInteractEntries");
static_assert(sizeof(UnlockMap_Vera_SLY_C_BPGetInteractEntries) == 0x000030, "Wrong size on UnlockMap_Vera_SLY_C_BPGetInteractEntries");
static_assert(offsetof(UnlockMap_Vera_SLY_C_BPGetInteractEntries, ByPC) == 0x000000, "Member 'UnlockMap_Vera_SLY_C_BPGetInteractEntries::ByPC' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_BPGetInteractEntries, OutInteractEntries) == 0x000008, "Member 'UnlockMap_Vera_SLY_C_BPGetInteractEntries::OutInteractEntries' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_BPGetInteractEntries, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000018, "Member 'UnlockMap_Vera_SLY_C_BPGetInteractEntries::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_BPGetInteractEntries, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x000020, "Member 'UnlockMap_Vera_SLY_C_BPGetInteractEntries::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_BPGetInteractEntries, K2Node_DynamicCast_bSuccess) == 0x000028, "Member 'UnlockMap_Vera_SLY_C_BPGetInteractEntries::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(UnlockMap_Vera_SLY_C_BPGetInteractEntries, CallFunc_IsMapRegionUnlock_ReturnValue) == 0x000029, "Member 'UnlockMap_Vera_SLY_C_BPGetInteractEntries::CallFunc_IsMapRegionUnlock_ReturnValue' has a wrong offset!");

}

