#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_DiamondDetectionEntry

#include "Basic.hpp"

#include "Engine_structs.hpp"


namespace SDK::Params
{

// Function WB_DiamondDetectionEntry.WB_DiamondDetectionEntry_C.ShouldHideCount
// 0x0028 (0x0028 - 0x0000)
struct WB_DiamondDetectionEntry_C_ShouldHideCount final
{
public:
	bool                                          Ret;                                               // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5909[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0008(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	class FName                                   CallFunc_Conv_StringToName_ReturnValue;            // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Set_Contains_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DiamondDetectionEntry_C_ShouldHideCount) == 0x000008, "Wrong alignment on WB_DiamondDetectionEntry_C_ShouldHideCount");
static_assert(sizeof(WB_DiamondDetectionEntry_C_ShouldHideCount) == 0x000028, "Wrong size on WB_DiamondDetectionEntry_C_ShouldHideCount");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ShouldHideCount, Ret) == 0x000000, "Member 'WB_DiamondDetectionEntry_C_ShouldHideCount::Ret' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ShouldHideCount, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000008, "Member 'WB_DiamondDetectionEntry_C_ShouldHideCount::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ShouldHideCount, CallFunc_Conv_StringToName_ReturnValue) == 0x000018, "Member 'WB_DiamondDetectionEntry_C_ShouldHideCount::CallFunc_Conv_StringToName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ShouldHideCount, CallFunc_Set_Contains_ReturnValue) == 0x000020, "Member 'WB_DiamondDetectionEntry_C_ShouldHideCount::CallFunc_Set_Contains_ReturnValue' has a wrong offset!");

// Function WB_DiamondDetectionEntry.WB_DiamondDetectionEntry_C.OpenDiamondDetection
// 0x0018 (0x0018 - 0x0000)
struct WB_DiamondDetectionEntry_C_OpenDiamondDetection final
{
public:
	class AHottaHUD*                              CallFunc_BP_GetHottaHUD_ReturnValue;               // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_590A[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_OpenUIBySoftClass_ReturnValue;            // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DiamondDetectionEntry_C_OpenDiamondDetection) == 0x000008, "Wrong alignment on WB_DiamondDetectionEntry_C_OpenDiamondDetection");
static_assert(sizeof(WB_DiamondDetectionEntry_C_OpenDiamondDetection) == 0x000018, "Wrong size on WB_DiamondDetectionEntry_C_OpenDiamondDetection");
static_assert(offsetof(WB_DiamondDetectionEntry_C_OpenDiamondDetection, CallFunc_BP_GetHottaHUD_ReturnValue) == 0x000000, "Member 'WB_DiamondDetectionEntry_C_OpenDiamondDetection::CallFunc_BP_GetHottaHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_OpenDiamondDetection, CallFunc_IsValid_ReturnValue) == 0x000008, "Member 'WB_DiamondDetectionEntry_C_OpenDiamondDetection::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_OpenDiamondDetection, CallFunc_OpenUIBySoftClass_ReturnValue) == 0x000010, "Member 'WB_DiamondDetectionEntry_C_OpenDiamondDetection::CallFunc_OpenUIBySoftClass_ReturnValue' has a wrong offset!");

// Function WB_DiamondDetectionEntry.WB_DiamondDetectionEntry_C.BPHandledDetectionButtonClicked
// 0x0001 (0x0001 - 0x0000)
struct WB_DiamondDetectionEntry_C_BPHandledDetectionButtonClicked final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DiamondDetectionEntry_C_BPHandledDetectionButtonClicked) == 0x000001, "Wrong alignment on WB_DiamondDetectionEntry_C_BPHandledDetectionButtonClicked");
static_assert(sizeof(WB_DiamondDetectionEntry_C_BPHandledDetectionButtonClicked) == 0x000001, "Wrong size on WB_DiamondDetectionEntry_C_BPHandledDetectionButtonClicked");
static_assert(offsetof(WB_DiamondDetectionEntry_C_BPHandledDetectionButtonClicked, ReturnValue) == 0x000000, "Member 'WB_DiamondDetectionEntry_C_BPHandledDetectionButtonClicked::ReturnValue' has a wrong offset!");

// Function WB_DiamondDetectionEntry.WB_DiamondDetectionEntry_C.ReceiveShouldHideSelf
// 0x0010 (0x0010 - 0x0000)
struct WB_DiamondDetectionEntry_C_ReceiveShouldHideSelf final
{
public:
	class AHottaPlayerCharacter*                  PlayerCharacter;                                   // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ReturnValue;                                       // 0x0008(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DiamondDetectionEntry_C_ReceiveShouldHideSelf) == 0x000008, "Wrong alignment on WB_DiamondDetectionEntry_C_ReceiveShouldHideSelf");
static_assert(sizeof(WB_DiamondDetectionEntry_C_ReceiveShouldHideSelf) == 0x000010, "Wrong size on WB_DiamondDetectionEntry_C_ReceiveShouldHideSelf");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ReceiveShouldHideSelf, PlayerCharacter) == 0x000000, "Member 'WB_DiamondDetectionEntry_C_ReceiveShouldHideSelf::PlayerCharacter' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ReceiveShouldHideSelf, ReturnValue) == 0x000008, "Member 'WB_DiamondDetectionEntry_C_ReceiveShouldHideSelf::ReturnValue' has a wrong offset!");

// Function WB_DiamondDetectionEntry.WB_DiamondDetectionEntry_C.SetCountText
// 0x0090 (0x0090 - 0x0000)
struct WB_DiamondDetectionEntry_C_SetCountText final
{
public:
	int32                                         InCurrentCount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTotalCount;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ShouldHideCount_Ret;                      // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_590B[0x7];                                     // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x0010(0x0040)(HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0050(0x0018)()
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0068(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0078(0x0018)()
};
static_assert(alignof(WB_DiamondDetectionEntry_C_SetCountText) == 0x000008, "Wrong alignment on WB_DiamondDetectionEntry_C_SetCountText");
static_assert(sizeof(WB_DiamondDetectionEntry_C_SetCountText) == 0x000090, "Wrong size on WB_DiamondDetectionEntry_C_SetCountText");
static_assert(offsetof(WB_DiamondDetectionEntry_C_SetCountText, InCurrentCount) == 0x000000, "Member 'WB_DiamondDetectionEntry_C_SetCountText::InCurrentCount' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_SetCountText, InTotalCount) == 0x000004, "Member 'WB_DiamondDetectionEntry_C_SetCountText::InTotalCount' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_SetCountText, CallFunc_ShouldHideCount_Ret) == 0x000008, "Member 'WB_DiamondDetectionEntry_C_SetCountText::CallFunc_ShouldHideCount_Ret' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_SetCountText, K2Node_MakeStruct_FormatArgumentData) == 0x000010, "Member 'WB_DiamondDetectionEntry_C_SetCountText::K2Node_MakeStruct_FormatArgumentData' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_SetCountText, CallFunc_Conv_IntToText_ReturnValue) == 0x000050, "Member 'WB_DiamondDetectionEntry_C_SetCountText::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_SetCountText, K2Node_MakeArray_Array) == 0x000068, "Member 'WB_DiamondDetectionEntry_C_SetCountText::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_SetCountText, CallFunc_Format_ReturnValue) == 0x000078, "Member 'WB_DiamondDetectionEntry_C_SetCountText::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WB_DiamondDetectionEntry.WB_DiamondDetectionEntry_C.ReceiveRefreshCount
// 0x0008 (0x0008 - 0x0000)
struct WB_DiamondDetectionEntry_C_ReceiveRefreshCount final
{
public:
	int32                                         InCurrentCount;                                    // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         InTotalCount;                                      // 0x0004(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_DiamondDetectionEntry_C_ReceiveRefreshCount) == 0x000004, "Wrong alignment on WB_DiamondDetectionEntry_C_ReceiveRefreshCount");
static_assert(sizeof(WB_DiamondDetectionEntry_C_ReceiveRefreshCount) == 0x000008, "Wrong size on WB_DiamondDetectionEntry_C_ReceiveRefreshCount");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ReceiveRefreshCount, InCurrentCount) == 0x000000, "Member 'WB_DiamondDetectionEntry_C_ReceiveRefreshCount::InCurrentCount' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ReceiveRefreshCount, InTotalCount) == 0x000004, "Member 'WB_DiamondDetectionEntry_C_ReceiveRefreshCount::InTotalCount' has a wrong offset!");

// Function WB_DiamondDetectionEntry.WB_DiamondDetectionEntry_C.ExecuteUbergraph_WB_DiamondDetectionEntry
// 0x0030 (0x0030 - 0x0000)
struct WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InCurrentCount;                       // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         K2Node_Event_InTotalCount;                         // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_590C[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   CallFunc_Conv_IntToText_ReturnValue;               // 0x0010(0x0018)()
	bool                                          CallFunc_ShouldHideCount_Ret;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry) == 0x000008, "Wrong alignment on WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry");
static_assert(sizeof(WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry) == 0x000030, "Wrong size on WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry, EntryPoint) == 0x000000, "Member 'WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry, K2Node_Event_InCurrentCount) == 0x000004, "Member 'WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry::K2Node_Event_InCurrentCount' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry, K2Node_Event_InTotalCount) == 0x000008, "Member 'WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry::K2Node_Event_InTotalCount' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry, CallFunc_Conv_IntToText_ReturnValue) == 0x000010, "Member 'WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry::CallFunc_Conv_IntToText_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry, CallFunc_ShouldHideCount_Ret) == 0x000028, "Member 'WB_DiamondDetectionEntry_C_ExecuteUbergraph_WB_DiamondDetectionEntry::CallFunc_ShouldHideCount_Ret' has a wrong offset!");

}

