#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ExploreDiamond

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_ExploreDiamond.WB_ExploreDiamond_C.ExecuteUbergraph_WB_ExploreDiamond
// 0x0028 (0x0028 - 0x0000)
struct WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59A6[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaHUD*                              CallFunc_BP_GetHottaHUD_ReturnValue;               // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                 CallFunc_GetCurrentLevelName_ReturnValue;          // 0x0010(0x0010)(ZeroConstructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_StrStr_ReturnValue;            // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond) == 0x000008, "Wrong alignment on WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond");
static_assert(sizeof(WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond) == 0x000028, "Wrong size on WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond");
static_assert(offsetof(WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond, EntryPoint) == 0x000000, "Member 'WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond, CallFunc_BP_GetHottaHUD_ReturnValue) == 0x000008, "Member 'WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond::CallFunc_BP_GetHottaHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond, CallFunc_GetCurrentLevelName_ReturnValue) == 0x000010, "Member 'WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond::CallFunc_GetCurrentLevelName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond, CallFunc_EqualEqual_StrStr_ReturnValue) == 0x000020, "Member 'WB_ExploreDiamond_C_ExecuteUbergraph_WB_ExploreDiamond::CallFunc_EqualEqual_StrStr_ReturnValue' has a wrong offset!");

// Function WB_ExploreDiamond.WB_ExploreDiamond_C.OpenDiamondDetection
// 0x0028 (0x0028 - 0x0000)
struct WB_ExploreDiamond_C_OpenDiamondDetection final
{
public:
	class APlayerController*                      CallFunc_GetPlayerController_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHUD*                                   CallFunc_GetHUD_ReturnValue;                       // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaHUD*                              K2Node_DynamicCast_AsHotta_HUD;                    // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A7[0x7];                                     // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UUserWidget*                            CallFunc_OpenUIBySoftClass_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_ExploreDiamond_C_OpenDiamondDetection) == 0x000008, "Wrong alignment on WB_ExploreDiamond_C_OpenDiamondDetection");
static_assert(sizeof(WB_ExploreDiamond_C_OpenDiamondDetection) == 0x000028, "Wrong size on WB_ExploreDiamond_C_OpenDiamondDetection");
static_assert(offsetof(WB_ExploreDiamond_C_OpenDiamondDetection, CallFunc_GetPlayerController_ReturnValue) == 0x000000, "Member 'WB_ExploreDiamond_C_OpenDiamondDetection::CallFunc_GetPlayerController_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_OpenDiamondDetection, CallFunc_GetHUD_ReturnValue) == 0x000008, "Member 'WB_ExploreDiamond_C_OpenDiamondDetection::CallFunc_GetHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_OpenDiamondDetection, K2Node_DynamicCast_AsHotta_HUD) == 0x000010, "Member 'WB_ExploreDiamond_C_OpenDiamondDetection::K2Node_DynamicCast_AsHotta_HUD' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_OpenDiamondDetection, K2Node_DynamicCast_bSuccess) == 0x000018, "Member 'WB_ExploreDiamond_C_OpenDiamondDetection::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_OpenDiamondDetection, CallFunc_OpenUIBySoftClass_ReturnValue) == 0x000020, "Member 'WB_ExploreDiamond_C_OpenDiamondDetection::CallFunc_OpenUIBySoftClass_ReturnValue' has a wrong offset!");

// Function WB_ExploreDiamond.WB_ExploreDiamond_C.OnExploreIdChanged
// 0x0028 (0x0028 - 0x0000)
struct WB_ExploreDiamond_C_OnExploreIdChanged final
{
public:
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array;                            // 0x0000(0x0010)(ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x0010(0x0018)()
};
static_assert(alignof(WB_ExploreDiamond_C_OnExploreIdChanged) == 0x000008, "Wrong alignment on WB_ExploreDiamond_C_OnExploreIdChanged");
static_assert(sizeof(WB_ExploreDiamond_C_OnExploreIdChanged) == 0x000028, "Wrong size on WB_ExploreDiamond_C_OnExploreIdChanged");
static_assert(offsetof(WB_ExploreDiamond_C_OnExploreIdChanged, K2Node_MakeArray_Array) == 0x000000, "Member 'WB_ExploreDiamond_C_OnExploreIdChanged::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_OnExploreIdChanged, CallFunc_Format_ReturnValue) == 0x000010, "Member 'WB_ExploreDiamond_C_OnExploreIdChanged::CallFunc_Format_ReturnValue' has a wrong offset!");

// Function WB_ExploreDiamond.WB_ExploreDiamond_C.IsSpecifiedLocationTrackable
// 0x00B8 (0x00B8 - 0x0000)
struct WB_ExploreDiamond_C_IsSpecifiedLocationTrackable final
{
public:
	bool                                          ReturnValue;                                       // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A8[0x3];                                     // 0x0001(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   ObjectID;                                          // 0x0004(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   QuestID;                                           // 0x000C(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SphereRadius;                                      // 0x0014(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_True_if_break_was_hit_Variable;            // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsEditor_ReturnValue;                     // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A9[0x1];                                     // 0x001F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AA[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue;           // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                         K2Node_MakeArray_Array;                            // 0x0030(0x0010)(ConstParm, ReferenceParm)
	int32                                         CallFunc_Add_IntInt_ReturnValue;                   // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_59AB[0x4];                                     // 0x0044(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<EObjectTypeQuery>                      K2Node_MakeArray_Array_1;                          // 0x0048(0x0010)(ConstParm, ReferenceParm)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                             CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                CallFunc_K2_GetActorLocation_ReturnValue;          // 0x0068(0x000C)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0074(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59AC[0x3];                                     // 0x0075(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class AActor*>                         CallFunc_SphereOverlapActors_OutActors;            // 0x0078(0x0010)(ReferenceParm)
	bool                                          CallFunc_SphereOverlapActors_ReturnValue;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59AD[0x7];                                     // 0x0089(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_Array_Get_Item;                           // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0098(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_ActorHasTag_ReturnValue;                  // 0x009C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x009D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x009E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59AE[0x1];                                     // 0x009F(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  CallFunc_GetClientPlayerCharacter_ReturnValue;     // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLPlayerCharacter*                   K2Node_DynamicCast_AsQRSLPlayer_Character;         // 0x00A8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00B0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsQuestObjectInProgress_ReturnValue;      // 0x00B1(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable) == 0x000008, "Wrong alignment on WB_ExploreDiamond_C_IsSpecifiedLocationTrackable");
static_assert(sizeof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable) == 0x0000B8, "Wrong size on WB_ExploreDiamond_C_IsSpecifiedLocationTrackable");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, ReturnValue) == 0x000000, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, ObjectID) == 0x000004, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::ObjectID' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, QuestID) == 0x00000C, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::QuestID' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, SphereRadius) == 0x000014, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::SphereRadius' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, ___int_Array_Index_Variable) == 0x000018, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, ___bool_True_if_break_was_hit_Variable) == 0x00001C, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::___bool_True_if_break_was_hit_Variable' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_Not_PreBool_ReturnValue) == 0x00001D, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_IsEditor_ReturnValue) == 0x00001E, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_IsEditor_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, ___int_Loop_Counter_Variable) == 0x000020, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_GetPlayerCharacter_ReturnValue) == 0x000028, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_GetPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, K2Node_MakeArray_Array) == 0x000030, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::K2Node_MakeArray_Array' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_Add_IntInt_ReturnValue) == 0x000040, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_Add_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, K2Node_MakeArray_Array_1) == 0x000048, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::K2Node_MakeArray_Array_1' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_GetPlayerCharacter_ReturnValue_1) == 0x000058, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_GetPlayerCharacter_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_GetPlayerCharacter_ReturnValue_2) == 0x000060, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_GetPlayerCharacter_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_K2_GetActorLocation_ReturnValue) == 0x000068, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_K2_GetActorLocation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_IsValid_ReturnValue) == 0x000074, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_SphereOverlapActors_OutActors) == 0x000078, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_SphereOverlapActors_OutActors' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_SphereOverlapActors_ReturnValue) == 0x000088, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_SphereOverlapActors_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_Array_Get_Item) == 0x000090, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_Array_Length_ReturnValue) == 0x000098, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_ActorHasTag_ReturnValue) == 0x00009C, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_ActorHasTag_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_Less_IntInt_ReturnValue) == 0x00009D, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_BooleanAND_ReturnValue) == 0x00009E, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_GetClientPlayerCharacter_ReturnValue) == 0x0000A0, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_GetClientPlayerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, K2Node_DynamicCast_AsQRSLPlayer_Character) == 0x0000A8, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::K2Node_DynamicCast_AsQRSLPlayer_Character' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, K2Node_DynamicCast_bSuccess) == 0x0000B0, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_ExploreDiamond_C_IsSpecifiedLocationTrackable, CallFunc_IsQuestObjectInProgress_ReturnValue) == 0x0000B1, "Member 'WB_ExploreDiamond_C_IsSpecifiedLocationTrackable::CallFunc_IsQuestObjectInProgress_ReturnValue' has a wrong offset!");

}

