#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_ExploreDiamond

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_ExploreDiamond.WB_ExploreDiamond_C
// 0x0020 (0x05C8 - 0x05A8)
class UWB_ExploreDiamond_C final : public UQRSLUI_ExploreDiamond
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x05A8(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ExploreText;                                       // 0x05B0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                             KeySlot;                                           // 0x05B8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                               Overlay_0;                                         // 0x05C0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_ExploreDiamond(int32 EntryPoint);
	void Construct();
	void PopTips();
	void BndEvt__WB_ExploreDiamond_ExploreButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void OpenDiamondDetection();
	void OnExploreIdChanged();
	bool IsSpecifiedLocationTrackable();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_ExploreDiamond_C">();
	}
	static class UWB_ExploreDiamond_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_ExploreDiamond_C>();
	}
};
static_assert(alignof(UWB_ExploreDiamond_C) == 0x000008, "Wrong alignment on UWB_ExploreDiamond_C");
static_assert(sizeof(UWB_ExploreDiamond_C) == 0x0005C8, "Wrong size on UWB_ExploreDiamond_C");
static_assert(offsetof(UWB_ExploreDiamond_C, UberGraphFrame) == 0x0005A8, "Member 'UWB_ExploreDiamond_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_ExploreDiamond_C, ExploreText) == 0x0005B0, "Member 'UWB_ExploreDiamond_C::ExploreText' has a wrong offset!");
static_assert(offsetof(UWB_ExploreDiamond_C, KeySlot) == 0x0005B8, "Member 'UWB_ExploreDiamond_C::KeySlot' has a wrong offset!");
static_assert(offsetof(UWB_ExploreDiamond_C, Overlay_0) == 0x0005C0, "Member 'UWB_ExploreDiamond_C::Overlay_0' has a wrong offset!");

}

