#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GamepadButton

#include "Basic.hpp"

#include "Slate_structs.hpp"
#include "InputCore_structs.hpp"
#include "UMG_structs.hpp"


namespace SDK::Params
{

// Function WB_GamepadButton.WB_GamepadButton_C.ExecuteUbergraph_WB_GamepadButton
// 0x00E0 (0x00E0 - 0x0000)
struct WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          ___bool_Variable;                                  // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	ESlateVisibility                              ___byte_Variable;                                  // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              ___byte_Variable_1;                                // 0x0006(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6DFD[0x1];                                     // 0x0007(0x0001)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputChord                            K2Node_MakeStruct_InputChord;                      // 0x0008(0x0020)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetGamepadIcon_ReturnValue;               // 0x0028(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	class AHottaHUD*                              CallFunc_BP_GetHottaHUD_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_SelectKey_Result;                         // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DFE[0x7];                                     // 0x0059(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQRSLHandleOperationManager*            CallFunc_K2_GetHandleOperatorManager_ReturnValue;  // 0x0060(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQRSLHandleOperationManager*            CallFunc_K2_GetHandleOperatorManager_ReturnValue_1; // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FKey                                   CallFunc_K2_GetKeyFromActionName_ReturnValue;      // 0x0070(0x0018)(HasGetValueTypeHash)
	struct FInputChord                            K2Node_MakeStruct_InputChord_1;                    // 0x0088(0x0020)(HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_NameName_ReturnValue;          // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6DFF[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetGamepadIcon_ReturnValue_1;             // 0x00B0(0x0028)(UObjectWrapper, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_Select_Default;                             // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton) == 0x000008, "Wrong alignment on WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton");
static_assert(sizeof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton) == 0x0000E0, "Wrong size on WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, EntryPoint) == 0x000000, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, ___bool_Variable) == 0x000004, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::___bool_Variable' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, ___byte_Variable) == 0x000005, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::___byte_Variable' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, ___byte_Variable_1) == 0x000006, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::___byte_Variable_1' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, K2Node_MakeStruct_InputChord) == 0x000008, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::K2Node_MakeStruct_InputChord' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, CallFunc_GetGamepadIcon_ReturnValue) == 0x000028, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::CallFunc_GetGamepadIcon_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, CallFunc_BP_GetHottaHUD_ReturnValue) == 0x000050, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::CallFunc_BP_GetHottaHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, CallFunc_SelectKey_Result) == 0x000058, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::CallFunc_SelectKey_Result' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, CallFunc_K2_GetHandleOperatorManager_ReturnValue) == 0x000060, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::CallFunc_K2_GetHandleOperatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, CallFunc_K2_GetHandleOperatorManager_ReturnValue_1) == 0x000068, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::CallFunc_K2_GetHandleOperatorManager_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, CallFunc_K2_GetKeyFromActionName_ReturnValue) == 0x000070, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::CallFunc_K2_GetKeyFromActionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, K2Node_MakeStruct_InputChord_1) == 0x000088, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::K2Node_MakeStruct_InputChord_1' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, CallFunc_EqualEqual_NameName_ReturnValue) == 0x0000A8, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::CallFunc_EqualEqual_NameName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, CallFunc_GetGamepadIcon_ReturnValue_1) == 0x0000B0, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::CallFunc_GetGamepadIcon_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton, K2Node_Select_Default) == 0x0000D8, "Member 'WB_GamepadButton_C_ExecuteUbergraph_WB_GamepadButton::K2Node_Select_Default' has a wrong offset!");

}

