#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GamepadKeySelector

#include "Basic.hpp"

#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "Slate_structs.hpp"
#include "CoreUObject_structs.hpp"


namespace SDK::Params
{

// Function WB_GamepadKeySelector.WB_GamepadKeySelector_C.ExecuteUbergraph_WB_GamepadKeySelector
// 0x0050 (0x0050 - 0x0000)
struct WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesirePosition_OutPosition;            // 0x0004(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E4C[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UWidget*                                K2Node_ComponentBoundEvent_InWidget;               // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InNewVisibility;        // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              K2Node_ComponentBoundEvent_InOldVisibility;        // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E4D[0x5];                                     // 0x001B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaHUD*                              CallFunc_BP_GetHottaHUD_ReturnValue;               // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_OpenUIBySoftClass_ReturnValue;            // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_CustomGamepadKeyList_C*             K2Node_DynamicCast_AsWB_Custom_Gamepad_Key_List;   // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E4E[0x7];                                     // 0x0039(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaHUD*                              CallFunc_BP_GetHottaHUD_ReturnValue_1;             // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector) == 0x000008, "Wrong alignment on WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector");
static_assert(sizeof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector) == 0x000050, "Wrong size on WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, EntryPoint) == 0x000000, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, CallFunc_GetDesirePosition_OutPosition) == 0x000004, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::CallFunc_GetDesirePosition_OutPosition' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00000C, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, K2Node_ComponentBoundEvent_InWidget) == 0x000010, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::K2Node_ComponentBoundEvent_InWidget' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, K2Node_ComponentBoundEvent_InNewVisibility) == 0x000018, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::K2Node_ComponentBoundEvent_InNewVisibility' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, K2Node_ComponentBoundEvent_InOldVisibility) == 0x000019, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::K2Node_ComponentBoundEvent_InOldVisibility' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, K2Node_SwitchEnum_CmpSuccess) == 0x00001A, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, CallFunc_BP_GetHottaHUD_ReturnValue) == 0x000020, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::CallFunc_BP_GetHottaHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, CallFunc_OpenUIBySoftClass_ReturnValue) == 0x000028, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::CallFunc_OpenUIBySoftClass_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, K2Node_DynamicCast_AsWB_Custom_Gamepad_Key_List) == 0x000030, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::K2Node_DynamicCast_AsWB_Custom_Gamepad_Key_List' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, K2Node_DynamicCast_bSuccess) == 0x000038, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, CallFunc_BP_GetHottaHUD_ReturnValue_1) == 0x000040, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::CallFunc_BP_GetHottaHUD_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector, CallFunc_IsValid_ReturnValue) == 0x000048, "Member 'WB_GamepadKeySelector_C_ExecuteUbergraph_WB_GamepadKeySelector::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WB_GamepadKeySelector.WB_GamepadKeySelector_C.BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature
// 0x0010 (0x0010 - 0x0000)
struct WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature final
{
public:
	class UWidget*                                InWidget;                                          // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InNewVisibility;                                   // 0x0008(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ESlateVisibility                              InOldVisibility;                                   // 0x0009(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature) == 0x000008, "Wrong alignment on WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature");
static_assert(sizeof(WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature) == 0x000010, "Wrong size on WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature");
static_assert(offsetof(WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature, InWidget) == 0x000000, "Member 'WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature::InWidget' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature, InNewVisibility) == 0x000008, "Member 'WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature::InNewVisibility' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature, InOldVisibility) == 0x000009, "Member 'WB_GamepadKeySelector_C_BndEvt__WB_GamepadKeySelector_HighLightImage_K2Node_ComponentBoundEvent_2_OnVisibilityChangedDelegate__DelegateSignature::InOldVisibility' has a wrong offset!");

// Function WB_GamepadKeySelector.WB_GamepadKeySelector_C.ReplaceKey
// 0x0060 (0x0060 - 0x0000)
struct WB_GamepadKeySelector_C_ReplaceKey final
{
public:
	struct FKey                                   InNewKey;                                          // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	bool                                          Result;                                            // 0x0018(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E4F[0x3];                                     // 0x0019(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	TDelegate<void()>                             K2Node_CreateDelegate_OutputDelegate;              // 0x001C(0x0010)(ZeroConstructor, NoDestructor)
	uint8                                         Pad_6E50[0x4];                                     // 0x002C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaHUD*                              CallFunc_BP_GetHottaHUD_ReturnValue;               // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AQRSLHUD*                               K2Node_DynamicCast_AsQRSLHUD;                      // 0x0038(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E51[0x7];                                     // 0x0041(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQRSLHandleOperationManager*            CallFunc_K2_GetHandleOperatorManager_ReturnValue;  // 0x0048(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQRSLUI_MessageBox*                     CallFunc_ShowMessageBox_ReturnValue;               // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsKeyUsed_ReturnValue;                    // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_KeyKey_ReturnValue;            // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_GamepadKeySelector_C_ReplaceKey) == 0x000008, "Wrong alignment on WB_GamepadKeySelector_C_ReplaceKey");
static_assert(sizeof(WB_GamepadKeySelector_C_ReplaceKey) == 0x000060, "Wrong size on WB_GamepadKeySelector_C_ReplaceKey");
static_assert(offsetof(WB_GamepadKeySelector_C_ReplaceKey, InNewKey) == 0x000000, "Member 'WB_GamepadKeySelector_C_ReplaceKey::InNewKey' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ReplaceKey, Result) == 0x000018, "Member 'WB_GamepadKeySelector_C_ReplaceKey::Result' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ReplaceKey, K2Node_CreateDelegate_OutputDelegate) == 0x00001C, "Member 'WB_GamepadKeySelector_C_ReplaceKey::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ReplaceKey, CallFunc_BP_GetHottaHUD_ReturnValue) == 0x000030, "Member 'WB_GamepadKeySelector_C_ReplaceKey::CallFunc_BP_GetHottaHUD_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ReplaceKey, K2Node_DynamicCast_AsQRSLHUD) == 0x000038, "Member 'WB_GamepadKeySelector_C_ReplaceKey::K2Node_DynamicCast_AsQRSLHUD' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ReplaceKey, K2Node_DynamicCast_bSuccess) == 0x000040, "Member 'WB_GamepadKeySelector_C_ReplaceKey::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ReplaceKey, CallFunc_K2_GetHandleOperatorManager_ReturnValue) == 0x000048, "Member 'WB_GamepadKeySelector_C_ReplaceKey::CallFunc_K2_GetHandleOperatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ReplaceKey, CallFunc_ShowMessageBox_ReturnValue) == 0x000050, "Member 'WB_GamepadKeySelector_C_ReplaceKey::CallFunc_ShowMessageBox_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ReplaceKey, CallFunc_IsKeyUsed_ReturnValue) == 0x000058, "Member 'WB_GamepadKeySelector_C_ReplaceKey::CallFunc_IsKeyUsed_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ReplaceKey, CallFunc_EqualEqual_KeyKey_ReturnValue) == 0x000059, "Member 'WB_GamepadKeySelector_C_ReplaceKey::CallFunc_EqualEqual_KeyKey_ReturnValue' has a wrong offset!");

// Function WB_GamepadKeySelector.WB_GamepadKeySelector_C.GetDesirePosition
// 0x004C (0x004C - 0x0000)
struct WB_GamepadKeySelector_C_GetDesirePosition final
{
public:
	struct FVector2D                              OutPosition;                                       // 0x0000(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              LocalOutPosition;                                  // 0x0008(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_MakeLiteralFloat_ReturnValue;             // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue;    // 0x001C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue_1;               // 0x0024(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_Subtract_Vector2DVector2D_ReturnValue_1;  // 0x002C(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_K2_GetWidgetAbsolutePosition_OutPosition; // 0x0034(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetActiveWidgetIndex_ReturnValue;         // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchInteger_CmpSuccess;                   // 0x0040(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E52[0x3];                                     // 0x0041(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	struct FVector2D                              CallFunc_K2_GetWidgetAbsolutePosition_OutPosition_1; // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_GamepadKeySelector_C_GetDesirePosition) == 0x000004, "Wrong alignment on WB_GamepadKeySelector_C_GetDesirePosition");
static_assert(sizeof(WB_GamepadKeySelector_C_GetDesirePosition) == 0x00004C, "Wrong size on WB_GamepadKeySelector_C_GetDesirePosition");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, OutPosition) == 0x000000, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::OutPosition' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, LocalOutPosition) == 0x000008, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::LocalOutPosition' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, CallFunc_MakeLiteralFloat_ReturnValue) == 0x000010, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::CallFunc_MakeLiteralFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, CallFunc_MakeVector2D_ReturnValue) == 0x000014, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, CallFunc_Subtract_Vector2DVector2D_ReturnValue) == 0x00001C, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::CallFunc_Subtract_Vector2DVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, CallFunc_MakeVector2D_ReturnValue_1) == 0x000024, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::CallFunc_MakeVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, CallFunc_Subtract_Vector2DVector2D_ReturnValue_1) == 0x00002C, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::CallFunc_Subtract_Vector2DVector2D_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, CallFunc_K2_GetWidgetAbsolutePosition_OutPosition) == 0x000034, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::CallFunc_K2_GetWidgetAbsolutePosition_OutPosition' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, CallFunc_GetActiveWidgetIndex_ReturnValue) == 0x00003C, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::CallFunc_GetActiveWidgetIndex_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, K2Node_SwitchInteger_CmpSuccess) == 0x000040, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::K2Node_SwitchInteger_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_GetDesirePosition, CallFunc_K2_GetWidgetAbsolutePosition_OutPosition_1) == 0x000044, "Member 'WB_GamepadKeySelector_C_GetDesirePosition::CallFunc_K2_GetWidgetAbsolutePosition_OutPosition_1' has a wrong offset!");

// Function WB_GamepadKeySelector.WB_GamepadKeySelector_C.Init
// 0x0098 (0x0098 - 0x0000)
struct WB_GamepadKeySelector_C_Init final
{
public:
	struct FKey                                   Param_Key;                                         // 0x0000(0x0018)(BlueprintVisible, BlueprintReadOnly, Parm, HasGetValueTypeHash)
	class FName                                   Param_InputActionName;                             // 0x0018(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EGamepadInputActionsType                      Param_InputActionsType;                            // 0x0020(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E53[0x3];                                     // 0x0021(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         InIndex;                                           // 0x0024(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UQRSLHandleOperationManager*            CallFunc_K2_GetHandleOperatorManager_ReturnValue;  // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   CallFunc_GetLocalizationActionName_ReturnValue;    // 0x0030(0x0018)()
	bool                                          CallFunc_Key_IsValid_ReturnValue;                  // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E54[0x7];                                     // 0x0049(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FInputChord                            K2Node_MakeStruct_InputChord;                      // 0x0050(0x0020)(HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>              CallFunc_GetGamepadIcon_ReturnValue;               // 0x0070(0x0028)(UObjectWrapper, HasGetValueTypeHash)
};
static_assert(alignof(WB_GamepadKeySelector_C_Init) == 0x000008, "Wrong alignment on WB_GamepadKeySelector_C_Init");
static_assert(sizeof(WB_GamepadKeySelector_C_Init) == 0x000098, "Wrong size on WB_GamepadKeySelector_C_Init");
static_assert(offsetof(WB_GamepadKeySelector_C_Init, Param_Key) == 0x000000, "Member 'WB_GamepadKeySelector_C_Init::Param_Key' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_Init, Param_InputActionName) == 0x000018, "Member 'WB_GamepadKeySelector_C_Init::Param_InputActionName' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_Init, Param_InputActionsType) == 0x000020, "Member 'WB_GamepadKeySelector_C_Init::Param_InputActionsType' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_Init, InIndex) == 0x000024, "Member 'WB_GamepadKeySelector_C_Init::InIndex' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_Init, CallFunc_K2_GetHandleOperatorManager_ReturnValue) == 0x000028, "Member 'WB_GamepadKeySelector_C_Init::CallFunc_K2_GetHandleOperatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_Init, CallFunc_GetLocalizationActionName_ReturnValue) == 0x000030, "Member 'WB_GamepadKeySelector_C_Init::CallFunc_GetLocalizationActionName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_Init, CallFunc_Key_IsValid_ReturnValue) == 0x000048, "Member 'WB_GamepadKeySelector_C_Init::CallFunc_Key_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_Init, K2Node_MakeStruct_InputChord) == 0x000050, "Member 'WB_GamepadKeySelector_C_Init::K2Node_MakeStruct_InputChord' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_Init, CallFunc_GetGamepadIcon_ReturnValue) == 0x000070, "Member 'WB_GamepadKeySelector_C_Init::CallFunc_GetGamepadIcon_ReturnValue' has a wrong offset!");

// Function WB_GamepadKeySelector.WB_GamepadKeySelector_C.ConfirmReplaceKey
// 0x0018 (0x0018 - 0x0000)
struct WB_GamepadKeySelector_C_ConfirmReplaceKey final
{
public:
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0000(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E55[0x7];                                     // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQRSLHandleOperationManager*            CallFunc_K2_GetHandleOperatorManager_ReturnValue;  // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AHottaHUD*                              CallFunc_BP_GetHottaHUD_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_GamepadKeySelector_C_ConfirmReplaceKey) == 0x000008, "Wrong alignment on WB_GamepadKeySelector_C_ConfirmReplaceKey");
static_assert(sizeof(WB_GamepadKeySelector_C_ConfirmReplaceKey) == 0x000018, "Wrong size on WB_GamepadKeySelector_C_ConfirmReplaceKey");
static_assert(offsetof(WB_GamepadKeySelector_C_ConfirmReplaceKey, CallFunc_IsValid_ReturnValue) == 0x000000, "Member 'WB_GamepadKeySelector_C_ConfirmReplaceKey::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ConfirmReplaceKey, CallFunc_K2_GetHandleOperatorManager_ReturnValue) == 0x000008, "Member 'WB_GamepadKeySelector_C_ConfirmReplaceKey::CallFunc_K2_GetHandleOperatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_GamepadKeySelector_C_ConfirmReplaceKey, CallFunc_BP_GetHottaHUD_ReturnValue) == 0x000010, "Member 'WB_GamepadKeySelector_C_ConfirmReplaceKey::CallFunc_BP_GetHottaHUD_ReturnValue' has a wrong offset!");

}

