#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GamepaActionNamedText

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "InputCore_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"
#include "Slate_structs.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_GamepaActionNamedText.WB_GamepaActionNamedText_C
// 0x0030 (0x0D50 - 0x0D20)
class UWB_GamepaActionNamedText_C final : public UHottaUI_Button
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UTextBlock*                             ActionName;                                        // 0x0D28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FKey                                   BindKey;                                           // 0x0D30(0x0018)(Edit, BlueprintVisible, HasGetValueTypeHash)
	EGamepadInputActionsType                      InputActionType;                                   // 0x0D48(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETextJustify                                  Justification;                                     // 0x0D49(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_GamepaActionNamedText(int32 EntryPoint);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Init(EGamepadInputActionsType InInputActionType);
	void Refresh();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_GamepaActionNamedText_C">();
	}
	static class UWB_GamepaActionNamedText_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_GamepaActionNamedText_C>();
	}
};
static_assert(alignof(UWB_GamepaActionNamedText_C) == 0x000008, "Wrong alignment on UWB_GamepaActionNamedText_C");
static_assert(sizeof(UWB_GamepaActionNamedText_C) == 0x000D50, "Wrong size on UWB_GamepaActionNamedText_C");
static_assert(offsetof(UWB_GamepaActionNamedText_C, UberGraphFrame) == 0x000D20, "Member 'UWB_GamepaActionNamedText_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_GamepaActionNamedText_C, ActionName) == 0x000D28, "Member 'UWB_GamepaActionNamedText_C::ActionName' has a wrong offset!");
static_assert(offsetof(UWB_GamepaActionNamedText_C, BindKey) == 0x000D30, "Member 'UWB_GamepaActionNamedText_C::BindKey' has a wrong offset!");
static_assert(offsetof(UWB_GamepaActionNamedText_C, InputActionType) == 0x000D48, "Member 'UWB_GamepaActionNamedText_C::InputActionType' has a wrong offset!");
static_assert(offsetof(UWB_GamepaActionNamedText_C, Justification) == 0x000D49, "Member 'UWB_GamepaActionNamedText_C::Justification' has a wrong offset!");

}

