#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_GamepadButton

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "UMG_structs.hpp"
#include "InputCore_structs.hpp"
#include "HottaFramework_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_GamepadButton.WB_GamepadButton_C
// 0x0058 (0x0D78 - 0x0D20)
class UWB_GamepadButton_C final : public UHottaUI_Button
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0D20(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                 GamepadIcon;                                       // 0x0D28(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 HightLight;                                        // 0x0D30(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHottaButton*                           SelectButton;                                      // 0x0D38(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUINavigationWidget*                    UINavigationWidget_42;                             // 0x0D40(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FKey                                   GamepadKey;                                        // 0x0D48(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class UWB_CustomGamepadKeyList_C*             Outer_WB_GamepadButton_C;                          // 0x0D60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                   GamepadActionName;                                 // 0x0D68(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          EnableNavigate;                                    // 0x0D70(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_WB_GamepadButton(int32 EntryPoint);
	void BndEvt__WB_GamepadButton_SelectButton_K2Node_ComponentBoundEvent_2_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WB_GamepadButton_SelectButton_K2Node_ComponentBoundEvent_1_OnButtonHoverEvent__DelegateSignature();
	void BndEvt__WB_GamepadButton_SelectButton_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();
	void Construct();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_GamepadButton_C">();
	}
	static class UWB_GamepadButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_GamepadButton_C>();
	}
};
static_assert(alignof(UWB_GamepadButton_C) == 0x000008, "Wrong alignment on UWB_GamepadButton_C");
static_assert(sizeof(UWB_GamepadButton_C) == 0x000D78, "Wrong size on UWB_GamepadButton_C");
static_assert(offsetof(UWB_GamepadButton_C, UberGraphFrame) == 0x000D20, "Member 'UWB_GamepadButton_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_GamepadButton_C, GamepadIcon) == 0x000D28, "Member 'UWB_GamepadButton_C::GamepadIcon' has a wrong offset!");
static_assert(offsetof(UWB_GamepadButton_C, HightLight) == 0x000D30, "Member 'UWB_GamepadButton_C::HightLight' has a wrong offset!");
static_assert(offsetof(UWB_GamepadButton_C, SelectButton) == 0x000D38, "Member 'UWB_GamepadButton_C::SelectButton' has a wrong offset!");
static_assert(offsetof(UWB_GamepadButton_C, UINavigationWidget_42) == 0x000D40, "Member 'UWB_GamepadButton_C::UINavigationWidget_42' has a wrong offset!");
static_assert(offsetof(UWB_GamepadButton_C, GamepadKey) == 0x000D48, "Member 'UWB_GamepadButton_C::GamepadKey' has a wrong offset!");
static_assert(offsetof(UWB_GamepadButton_C, Outer_WB_GamepadButton_C) == 0x000D60, "Member 'UWB_GamepadButton_C::Outer_WB_GamepadButton_C' has a wrong offset!");
static_assert(offsetof(UWB_GamepadButton_C, GamepadActionName) == 0x000D68, "Member 'UWB_GamepadButton_C::GamepadActionName' has a wrong offset!");
static_assert(offsetof(UWB_GamepadButton_C, EnableNavigate) == 0x000D70, "Member 'UWB_GamepadButton_C::EnableNavigate' has a wrong offset!");

}

