#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_HighQualityTip

#include "Basic.hpp"

#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_HighQualityTip.WB_HighQualityTip_C
// 0x0028 (0x0648 - 0x0620)
class UWB_HighQualityTip_C final : public UQRSLUI_HighQualityTip
{
public:
	class UBP_UINewFunctionRemind_C*              BP_UINewFunctionRemind;                            // 0x0620(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UPC_Key_C*                              PC_Key_1;                                          // 0x0628(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USafeZone*                              SafeZone_0;                                        // 0x0630(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle;                                        // 0x0638(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUIParticle*                            UIParticle_191;                                    // 0x0640(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_HighQualityTip_C">();
	}
	static class UWB_HighQualityTip_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_HighQualityTip_C>();
	}
};
static_assert(alignof(UWB_HighQualityTip_C) == 0x000008, "Wrong alignment on UWB_HighQualityTip_C");
static_assert(sizeof(UWB_HighQualityTip_C) == 0x000648, "Wrong size on UWB_HighQualityTip_C");
static_assert(offsetof(UWB_HighQualityTip_C, BP_UINewFunctionRemind) == 0x000620, "Member 'UWB_HighQualityTip_C::BP_UINewFunctionRemind' has a wrong offset!");
static_assert(offsetof(UWB_HighQualityTip_C, PC_Key_1) == 0x000628, "Member 'UWB_HighQualityTip_C::PC_Key_1' has a wrong offset!");
static_assert(offsetof(UWB_HighQualityTip_C, SafeZone_0) == 0x000630, "Member 'UWB_HighQualityTip_C::SafeZone_0' has a wrong offset!");
static_assert(offsetof(UWB_HighQualityTip_C, UIParticle) == 0x000638, "Member 'UWB_HighQualityTip_C::UIParticle' has a wrong offset!");
static_assert(offsetof(UWB_HighQualityTip_C, UIParticle_191) == 0x000640, "Member 'UWB_HighQualityTip_C::UIParticle_191' has a wrong offset!");

}

