#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Message

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "QRSL_structs.hpp"
#include "QRSL_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass WB_Message.WB_Message_C
// 0x00E0 (0x0BB0 - 0x0AD0)
class UWB_Message_C final : public UQRSLUI_Message
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0AD0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCanvasPanel*                           CanvasPanel_Broadcast;                             // 0x0AD8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                           CanvasPanel_Notice;                                // 0x0AE0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 Image_0;                                           // 0x0AE8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                 ImgBroadcastBack;                                  // 0x0AF0(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Broadcast;                           // 0x0AF8(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                         RichTextBlock_Notice;                              // 0x0B00(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                             ScrollBox_System;                                  // 0x0B08(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	float                                         DeltaSeconds;                                      // 0x0B10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E65[0x4];                                     // 0x0B14(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<class FText>                           WaitingSystemMessages;                             // 0x0B18(0x0010)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                         MaxSystemMessageCount;                             // 0x0B28(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         SystemMessageItemHeight;                           // 0x0B2C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         SystemMessageDuration;                             // 0x0B30(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         SystemMessageSpeedUpDuration;                      // 0x0B34(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                          NeedScrollSystemMessage;                           // 0x0B38(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E66[0x3];                                     // 0x0B39(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         SystemMessageScrollOffset;                         // 0x0B3C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SystemMessageScrollSpeed;                          // 0x0B40(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         SystemMessageSpeedUpScrollSpeed;                   // 0x0B44(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FUIMessageData>                 WaitingNoticeMessages;                             // 0x0B48(0x0010)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	bool                                          IsDisplayingNoticeMessage;                         // 0x0B58(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E67[0x3];                                     // 0x0B59(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         NoticeMessageScrollSpeed;                          // 0x0B5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                         NoticePathLength;                                  // 0x0B60(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SystemMessageCurrentDuration;                      // 0x0B64(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         SystemMessageCurrentScrollSpeed;                   // 0x0B68(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          IsDisplayingBroadcast;                             // 0x0B6C(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E68[0x3];                                     // 0x0B6D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         BroadcastInterval;                                 // 0x0B70(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E69[0x4];                                     // 0x0B74(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   BroadcastContent;                                  // 0x0B78(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                         CheckBroadcastInterval;                            // 0x0B90(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BroadcastPathLength;                               // 0x0B94(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         BroadcastMoveSpeed;                                // 0x0B98(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E6A[0x4];                                     // 0x0B9C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class URichTextBlock*                         Rich_Text_Block_Broadcast;                         // 0x0BA0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_WB_Message(int32 EntryPoint);
	void BP_StopBroadcastMsg();
	void BP_ShowBroadcastMsg(const class FText& InContent, int32 Interval);
	void AddSystemMessage_1(const class FText& MessageText);
	void AddNoticeMessage(const class FText& MessageText, EUIMessageEffectType EffectType);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Construct();
	void OnSystemMessageFadeOutFinish();
	void SpawnSystemMessageItem();
	void ScrollSystemMessage();
	void CreateEmptySystemMessageItem();
	void SystemMessageTick(const TDelegate<void()>& Delegate);
	void PlayBroadcastMessage(float InDeltaSec);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WB_Message_C">();
	}
	static class UWB_Message_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UWB_Message_C>();
	}
};
static_assert(alignof(UWB_Message_C) == 0x000010, "Wrong alignment on UWB_Message_C");
static_assert(sizeof(UWB_Message_C) == 0x000BB0, "Wrong size on UWB_Message_C");
static_assert(offsetof(UWB_Message_C, UberGraphFrame) == 0x000AD0, "Member 'UWB_Message_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, CanvasPanel_Broadcast) == 0x000AD8, "Member 'UWB_Message_C::CanvasPanel_Broadcast' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, CanvasPanel_Notice) == 0x000AE0, "Member 'UWB_Message_C::CanvasPanel_Notice' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, Image_0) == 0x000AE8, "Member 'UWB_Message_C::Image_0' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, ImgBroadcastBack) == 0x000AF0, "Member 'UWB_Message_C::ImgBroadcastBack' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, RichTextBlock_Broadcast) == 0x000AF8, "Member 'UWB_Message_C::RichTextBlock_Broadcast' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, RichTextBlock_Notice) == 0x000B00, "Member 'UWB_Message_C::RichTextBlock_Notice' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, ScrollBox_System) == 0x000B08, "Member 'UWB_Message_C::ScrollBox_System' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, DeltaSeconds) == 0x000B10, "Member 'UWB_Message_C::DeltaSeconds' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, WaitingSystemMessages) == 0x000B18, "Member 'UWB_Message_C::WaitingSystemMessages' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, MaxSystemMessageCount) == 0x000B28, "Member 'UWB_Message_C::MaxSystemMessageCount' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, SystemMessageItemHeight) == 0x000B2C, "Member 'UWB_Message_C::SystemMessageItemHeight' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, SystemMessageDuration) == 0x000B30, "Member 'UWB_Message_C::SystemMessageDuration' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, SystemMessageSpeedUpDuration) == 0x000B34, "Member 'UWB_Message_C::SystemMessageSpeedUpDuration' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, NeedScrollSystemMessage) == 0x000B38, "Member 'UWB_Message_C::NeedScrollSystemMessage' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, SystemMessageScrollOffset) == 0x000B3C, "Member 'UWB_Message_C::SystemMessageScrollOffset' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, SystemMessageScrollSpeed) == 0x000B40, "Member 'UWB_Message_C::SystemMessageScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, SystemMessageSpeedUpScrollSpeed) == 0x000B44, "Member 'UWB_Message_C::SystemMessageSpeedUpScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, WaitingNoticeMessages) == 0x000B48, "Member 'UWB_Message_C::WaitingNoticeMessages' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, IsDisplayingNoticeMessage) == 0x000B58, "Member 'UWB_Message_C::IsDisplayingNoticeMessage' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, NoticeMessageScrollSpeed) == 0x000B5C, "Member 'UWB_Message_C::NoticeMessageScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, NoticePathLength) == 0x000B60, "Member 'UWB_Message_C::NoticePathLength' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, SystemMessageCurrentDuration) == 0x000B64, "Member 'UWB_Message_C::SystemMessageCurrentDuration' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, SystemMessageCurrentScrollSpeed) == 0x000B68, "Member 'UWB_Message_C::SystemMessageCurrentScrollSpeed' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, IsDisplayingBroadcast) == 0x000B6C, "Member 'UWB_Message_C::IsDisplayingBroadcast' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, BroadcastInterval) == 0x000B70, "Member 'UWB_Message_C::BroadcastInterval' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, BroadcastContent) == 0x000B78, "Member 'UWB_Message_C::BroadcastContent' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, CheckBroadcastInterval) == 0x000B90, "Member 'UWB_Message_C::CheckBroadcastInterval' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, BroadcastPathLength) == 0x000B94, "Member 'UWB_Message_C::BroadcastPathLength' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, BroadcastMoveSpeed) == 0x000B98, "Member 'UWB_Message_C::BroadcastMoveSpeed' has a wrong offset!");
static_assert(offsetof(UWB_Message_C, Rich_Text_Block_Broadcast) == 0x000BA0, "Member 'UWB_Message_C::Rich_Text_Block_Broadcast' has a wrong offset!");

}

