#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WB_Message

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "QRSL_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function WB_Message.WB_Message_C.ExecuteUbergraph_WB_Message
// 0x01A0 (0x01A0 - 0x0000)
struct WB_Message_C_ExecuteUbergraph_WB_Message final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E6B[0x3];                                     // 0x0009(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x000C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue;               // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue;                      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_1;           // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_1;                        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_1;                        // 0x003C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0044(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_2;                        // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_2;                        // 0x0050(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0054(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E6C[0x3];                                     // 0x0059(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x005C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0060(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0068(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0070(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E6D[0x7];                                     // 0x0071(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIMessageData                         CallFunc_Array_Get_Item;                           // 0x0078(0x0020)()
	struct FGeometry                              K2Node_Event_MyGeometry;                           // 0x0098(0x0038)(IsPlainOldData, NoDestructor)
	float                                         K2Node_Event_InDeltaTime;                          // 0x00D0(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x00D4(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E6E[0x3];                                     // 0x00D5(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_MessageText_1;                        // 0x00D8(0x0018)(ConstParm)
	EUIMessageEffectType                          K2Node_Event_EffectType;                           // 0x00F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E6F[0x7];                                     // 0x00F1(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FUIMessageData                         K2Node_MakeStruct_UIMessageData;                   // 0x00F8(0x0020)()
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0118(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E70[0x4];                                     // 0x011C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_MessageText;                          // 0x0120(0x0018)(ConstParm)
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0138(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_IntInt_ReturnValue_1;                // 0x013C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x013D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E71[0x2];                                     // 0x013E(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FText                                   K2Node_Event_InContent;                            // 0x0140(0x0018)(ConstParm)
	int32                                         K2Node_Event_Interval;                             // 0x0158(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Conv_IntToFloat_ReturnValue;              // 0x015C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_2;           // 0x0160(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetDesiredSize_ReturnValue_1;             // 0x0168(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetSize_ReturnValue_1;                    // 0x0170(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_3;                        // 0x0178(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_3;                        // 0x017C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X_4;                        // 0x0180(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y_4;                        // 0x0184(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x0188(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E72[0x4];                                     // 0x018C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue_3;           // 0x0190(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0198(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0199(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanOR_ReturnValue;                    // 0x019A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_C_ExecuteUbergraph_WB_Message) == 0x000008, "Wrong alignment on WB_Message_C_ExecuteUbergraph_WB_Message");
static_assert(sizeof(WB_Message_C_ExecuteUbergraph_WB_Message) == 0x0001A0, "Wrong size on WB_Message_C_ExecuteUbergraph_WB_Message");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, EntryPoint) == 0x000000, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::EntryPoint' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Array_Length_ReturnValue) == 0x000004, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Less_IntInt_ReturnValue) == 0x000008, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_GetScrollOffset_ReturnValue) == 0x00000C, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_GetDesiredSize_ReturnValue) == 0x000010, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_GetDesiredSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BreakVector2D_X) == 0x000018, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BreakVector2D_X' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BreakVector2D_Y) == 0x00001C, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BreakVector2D_Y' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_SlotAsCanvasSlot_ReturnValue) == 0x000020, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_SlotAsCanvasSlot_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_GetSize_ReturnValue) == 0x000028, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_GetSize_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_SlotAsCanvasSlot_ReturnValue_1) == 0x000030, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_SlotAsCanvasSlot_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BreakVector2D_X_1) == 0x000038, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BreakVector2D_X_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BreakVector2D_Y_1) == 0x00003C, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BreakVector2D_Y_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Add_FloatFloat_ReturnValue) == 0x000040, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_GetPosition_ReturnValue) == 0x000044, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_GetPosition_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BreakVector2D_X_2) == 0x00004C, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BreakVector2D_X_2' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BreakVector2D_Y_2) == 0x000050, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BreakVector2D_Y_2' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000054, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000058, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Multiply_FloatFloat_ReturnValue_1) == 0x00005C, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Multiply_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Subtract_FloatFloat_ReturnValue) == 0x000060, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Subtract_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Array_Length_ReturnValue_1) == 0x000064, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_MakeVector2D_ReturnValue) == 0x000068, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_MakeVector2D_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Greater_IntInt_ReturnValue) == 0x000070, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Array_Get_Item) == 0x000078, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, K2Node_Event_MyGeometry) == 0x000098, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::K2Node_Event_MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, K2Node_Event_InDeltaTime) == 0x0000D0, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::K2Node_Event_InDeltaTime' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_NotEqual_ByteByte_ReturnValue) == 0x0000D4, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_NotEqual_ByteByte_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, K2Node_Event_MessageText_1) == 0x0000D8, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::K2Node_Event_MessageText_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, K2Node_Event_EffectType) == 0x0000F0, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::K2Node_Event_EffectType' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, K2Node_MakeStruct_UIMessageData) == 0x0000F8, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::K2Node_MakeStruct_UIMessageData' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Array_Add_ReturnValue) == 0x000118, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, K2Node_Event_MessageText) == 0x000120, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::K2Node_Event_MessageText' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Array_Length_ReturnValue_2) == 0x000138, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Less_IntInt_ReturnValue_1) == 0x00013C, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Less_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BooleanAND_ReturnValue) == 0x00013D, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, K2Node_Event_InContent) == 0x000140, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::K2Node_Event_InContent' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, K2Node_Event_Interval) == 0x000158, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::K2Node_Event_Interval' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Conv_IntToFloat_ReturnValue) == 0x00015C, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Conv_IntToFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_SlotAsCanvasSlot_ReturnValue_2) == 0x000160, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_SlotAsCanvasSlot_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_GetDesiredSize_ReturnValue_1) == 0x000168, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_GetDesiredSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_GetSize_ReturnValue_1) == 0x000170, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_GetSize_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BreakVector2D_X_3) == 0x000178, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BreakVector2D_X_3' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BreakVector2D_Y_3) == 0x00017C, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BreakVector2D_Y_3' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BreakVector2D_X_4) == 0x000180, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BreakVector2D_X_4' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BreakVector2D_Y_4) == 0x000184, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BreakVector2D_Y_4' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Add_FloatFloat_ReturnValue_1) == 0x000188, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Add_FloatFloat_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_SlotAsCanvasSlot_ReturnValue_3) == 0x000190, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_SlotAsCanvasSlot_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_TextIsEmpty_ReturnValue) == 0x000198, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_TextIsEmpty_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_Not_PreBool_ReturnValue) == 0x000199, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_Not_PreBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ExecuteUbergraph_WB_Message, CallFunc_BooleanOR_ReturnValue) == 0x00019A, "Member 'WB_Message_C_ExecuteUbergraph_WB_Message::CallFunc_BooleanOR_ReturnValue' has a wrong offset!");

// Function WB_Message.WB_Message_C.BP_ShowBroadcastMsg
// 0x0020 (0x0020 - 0x0000)
struct WB_Message_C_BP_ShowBroadcastMsg final
{
public:
	class FText                                   InContent;                                         // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	int32                                         Interval;                                          // 0x0018(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_C_BP_ShowBroadcastMsg) == 0x000008, "Wrong alignment on WB_Message_C_BP_ShowBroadcastMsg");
static_assert(sizeof(WB_Message_C_BP_ShowBroadcastMsg) == 0x000020, "Wrong size on WB_Message_C_BP_ShowBroadcastMsg");
static_assert(offsetof(WB_Message_C_BP_ShowBroadcastMsg, InContent) == 0x000000, "Member 'WB_Message_C_BP_ShowBroadcastMsg::InContent' has a wrong offset!");
static_assert(offsetof(WB_Message_C_BP_ShowBroadcastMsg, Interval) == 0x000018, "Member 'WB_Message_C_BP_ShowBroadcastMsg::Interval' has a wrong offset!");

// Function WB_Message.WB_Message_C.AddSystemMessage_1
// 0x0018 (0x0018 - 0x0000)
struct WB_Message_C_AddSystemMessage_1 final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
};
static_assert(alignof(WB_Message_C_AddSystemMessage_1) == 0x000008, "Wrong alignment on WB_Message_C_AddSystemMessage_1");
static_assert(sizeof(WB_Message_C_AddSystemMessage_1) == 0x000018, "Wrong size on WB_Message_C_AddSystemMessage_1");
static_assert(offsetof(WB_Message_C_AddSystemMessage_1, MessageText) == 0x000000, "Member 'WB_Message_C_AddSystemMessage_1::MessageText' has a wrong offset!");

// Function WB_Message.WB_Message_C.AddNoticeMessage
// 0x0020 (0x0020 - 0x0000)
struct WB_Message_C_AddNoticeMessage final
{
public:
	class FText                                   MessageText;                                       // 0x0000(0x0018)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm)
	EUIMessageEffectType                          EffectType;                                        // 0x0018(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_C_AddNoticeMessage) == 0x000008, "Wrong alignment on WB_Message_C_AddNoticeMessage");
static_assert(sizeof(WB_Message_C_AddNoticeMessage) == 0x000020, "Wrong size on WB_Message_C_AddNoticeMessage");
static_assert(offsetof(WB_Message_C_AddNoticeMessage, MessageText) == 0x000000, "Member 'WB_Message_C_AddNoticeMessage::MessageText' has a wrong offset!");
static_assert(offsetof(WB_Message_C_AddNoticeMessage, EffectType) == 0x000018, "Member 'WB_Message_C_AddNoticeMessage::EffectType' has a wrong offset!");

// Function WB_Message.WB_Message_C.Tick
// 0x003C (0x003C - 0x0000)
struct WB_Message_C_Tick final
{
public:
	struct FGeometry                              MyGeometry;                                        // 0x0000(0x0038)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	float                                         InDeltaTime;                                       // 0x0038(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_C_Tick) == 0x000004, "Wrong alignment on WB_Message_C_Tick");
static_assert(sizeof(WB_Message_C_Tick) == 0x00003C, "Wrong size on WB_Message_C_Tick");
static_assert(offsetof(WB_Message_C_Tick, MyGeometry) == 0x000000, "Member 'WB_Message_C_Tick::MyGeometry' has a wrong offset!");
static_assert(offsetof(WB_Message_C_Tick, InDeltaTime) == 0x000038, "Member 'WB_Message_C_Tick::InDeltaTime' has a wrong offset!");

// Function WB_Message.WB_Message_C.SpawnSystemMessageItem
// 0x0058 (0x0058 - 0x0000)
struct WB_Message_C_SpawnSystemMessageItem final
{
public:
	class FText                                   CallFunc_Array_Get_Item;                           // 0x0000(0x0018)()
	int32                                         CallFunc_GetChildrenCount_ReturnValue;             // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWidget*                                CallFunc_GetChildAt_ReturnValue;                   // 0x0020(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_MessageItem_C*                      K2Node_DynamicCast_AsWB_Message_Item;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E73[0x7];                                     // 0x0031(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	struct FSystemMessage                         K2Node_MakeStruct_SystemMessage;                   // 0x0038(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x0048(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E74[0x4];                                     // 0x004C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_C_SpawnSystemMessageItem) == 0x000008, "Wrong alignment on WB_Message_C_SpawnSystemMessageItem");
static_assert(sizeof(WB_Message_C_SpawnSystemMessageItem) == 0x000058, "Wrong size on WB_Message_C_SpawnSystemMessageItem");
static_assert(offsetof(WB_Message_C_SpawnSystemMessageItem, CallFunc_Array_Get_Item) == 0x000000, "Member 'WB_Message_C_SpawnSystemMessageItem::CallFunc_Array_Get_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SpawnSystemMessageItem, CallFunc_GetChildrenCount_ReturnValue) == 0x000018, "Member 'WB_Message_C_SpawnSystemMessageItem::CallFunc_GetChildrenCount_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SpawnSystemMessageItem, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WB_Message_C_SpawnSystemMessageItem::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SpawnSystemMessageItem, CallFunc_GetChildAt_ReturnValue) == 0x000020, "Member 'WB_Message_C_SpawnSystemMessageItem::CallFunc_GetChildAt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SpawnSystemMessageItem, K2Node_DynamicCast_AsWB_Message_Item) == 0x000028, "Member 'WB_Message_C_SpawnSystemMessageItem::K2Node_DynamicCast_AsWB_Message_Item' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SpawnSystemMessageItem, K2Node_DynamicCast_bSuccess) == 0x000030, "Member 'WB_Message_C_SpawnSystemMessageItem::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SpawnSystemMessageItem, K2Node_MakeStruct_SystemMessage) == 0x000038, "Member 'WB_Message_C_SpawnSystemMessageItem::K2Node_MakeStruct_SystemMessage' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SpawnSystemMessageItem, CallFunc_Array_Add_ReturnValue) == 0x000048, "Member 'WB_Message_C_SpawnSystemMessageItem::CallFunc_Array_Add_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SpawnSystemMessageItem, CallFunc_PlayAnimation_ReturnValue) == 0x000050, "Member 'WB_Message_C_SpawnSystemMessageItem::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");

// Function WB_Message.WB_Message_C.ScrollSystemMessage
// 0x0014 (0x0014 - 0x0000)
struct WB_Message_C_ScrollSystemMessage final
{
public:
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0000(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_GetScrollOffset_ReturnValue;              // 0x0004(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_NearlyEqual_FloatFloat_ReturnValue;       // 0x000C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E75[0x3];                                     // 0x000D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_FClamp_ReturnValue;                       // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_C_ScrollSystemMessage) == 0x000004, "Wrong alignment on WB_Message_C_ScrollSystemMessage");
static_assert(sizeof(WB_Message_C_ScrollSystemMessage) == 0x000014, "Wrong size on WB_Message_C_ScrollSystemMessage");
static_assert(offsetof(WB_Message_C_ScrollSystemMessage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000000, "Member 'WB_Message_C_ScrollSystemMessage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ScrollSystemMessage, CallFunc_GetScrollOffset_ReturnValue) == 0x000004, "Member 'WB_Message_C_ScrollSystemMessage::CallFunc_GetScrollOffset_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ScrollSystemMessage, CallFunc_Add_FloatFloat_ReturnValue) == 0x000008, "Member 'WB_Message_C_ScrollSystemMessage::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ScrollSystemMessage, CallFunc_NearlyEqual_FloatFloat_ReturnValue) == 0x00000C, "Member 'WB_Message_C_ScrollSystemMessage::CallFunc_NearlyEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_ScrollSystemMessage, CallFunc_FClamp_ReturnValue) == 0x000010, "Member 'WB_Message_C_ScrollSystemMessage::CallFunc_FClamp_ReturnValue' has a wrong offset!");

// Function WB_Message.WB_Message_C.CreateEmptySystemMessageItem
// 0x0010 (0x0010 - 0x0000)
struct WB_Message_C_CreateEmptySystemMessageItem final
{
public:
	class UWB_MessageItem_C*                      CallFunc_Create_ReturnValue;                       // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPanelSlot*                             CallFunc_AddChild_ReturnValue;                     // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_C_CreateEmptySystemMessageItem) == 0x000008, "Wrong alignment on WB_Message_C_CreateEmptySystemMessageItem");
static_assert(sizeof(WB_Message_C_CreateEmptySystemMessageItem) == 0x000010, "Wrong size on WB_Message_C_CreateEmptySystemMessageItem");
static_assert(offsetof(WB_Message_C_CreateEmptySystemMessageItem, CallFunc_Create_ReturnValue) == 0x000000, "Member 'WB_Message_C_CreateEmptySystemMessageItem::CallFunc_Create_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_CreateEmptySystemMessageItem, CallFunc_AddChild_ReturnValue) == 0x000008, "Member 'WB_Message_C_CreateEmptySystemMessageItem::CallFunc_AddChild_ReturnValue' has a wrong offset!");

// Function WB_Message.WB_Message_C.SystemMessageTick
// 0x0050 (0x0050 - 0x0000)
struct WB_Message_C_SystemMessageTick final
{
public:
	TDelegate<void()>                             Delegate;                                          // 0x0000(0x0010)(ConstParm, BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm, NoDestructor)
	int32                                         CallFunc_Array_Length_ReturnValue;                 // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         ___int_Array_Index_Variable;                       // 0x0014(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_1;               // 0x0018(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue;              // 0x001C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Max_ReturnValue;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E76[0x4];                                     // 0x0024(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UUMGSequencePlayer*                     CallFunc_PlayAnimation_ReturnValue;                // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_FloatFloat_ReturnValue;      // 0x0030(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E77[0x3];                                     // 0x0031(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         ___int_Loop_Counter_Variable;                      // 0x0034(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Subtract_IntInt_ReturnValue_1;            // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E78[0x3];                                     // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_Array_Length_ReturnValue_2;               // 0x0040(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_Array_Length_ReturnValue_3;               // 0x0044(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Greater_IntInt_ReturnValue;               // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Greater_IntInt_ReturnValue_1;             // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Less_IntInt_ReturnValue;                  // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                         CallFunc_Add_FloatFloat_ReturnValue;               // 0x004C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WB_Message_C_SystemMessageTick) == 0x000008, "Wrong alignment on WB_Message_C_SystemMessageTick");
static_assert(sizeof(WB_Message_C_SystemMessageTick) == 0x000050, "Wrong size on WB_Message_C_SystemMessageTick");
static_assert(offsetof(WB_Message_C_SystemMessageTick, Delegate) == 0x000000, "Member 'WB_Message_C_SystemMessageTick::Delegate' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Array_Length_ReturnValue) == 0x000010, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Array_Length_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, ___int_Array_Index_Variable) == 0x000014, "Member 'WB_Message_C_SystemMessageTick::___int_Array_Index_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Array_Length_ReturnValue_1) == 0x000018, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Array_Length_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Subtract_IntInt_ReturnValue) == 0x00001C, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Subtract_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Max_ReturnValue) == 0x000020, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Max_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_PlayAnimation_ReturnValue) == 0x000028, "Member 'WB_Message_C_SystemMessageTick::CallFunc_PlayAnimation_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_GreaterEqual_FloatFloat_ReturnValue) == 0x000030, "Member 'WB_Message_C_SystemMessageTick::CallFunc_GreaterEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, ___int_Loop_Counter_Variable) == 0x000034, "Member 'WB_Message_C_SystemMessageTick::___int_Loop_Counter_Variable' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Subtract_IntInt_ReturnValue_1) == 0x000038, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Subtract_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_GreaterEqual_IntInt_ReturnValue) == 0x00003C, "Member 'WB_Message_C_SystemMessageTick::CallFunc_GreaterEqual_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Array_Length_ReturnValue_2) == 0x000040, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Array_Length_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Array_Length_ReturnValue_3) == 0x000044, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Array_Length_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Greater_IntInt_ReturnValue) == 0x000048, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Greater_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Greater_IntInt_ReturnValue_1) == 0x000049, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Greater_IntInt_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Less_IntInt_ReturnValue) == 0x00004A, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Less_IntInt_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_BooleanAND_ReturnValue) == 0x00004B, "Member 'WB_Message_C_SystemMessageTick::CallFunc_BooleanAND_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_SystemMessageTick, CallFunc_Add_FloatFloat_ReturnValue) == 0x00004C, "Member 'WB_Message_C_SystemMessageTick::CallFunc_Add_FloatFloat_ReturnValue' has a wrong offset!");

// Function WB_Message.WB_Message_C.PlayBroadcastMessage
// 0x0040 (0x0040 - 0x0000)
struct WB_Message_C_PlayBroadcastMessage final
{
public:
	float                                         InDeltaSec;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_6E79[0x3];                                     // 0x0005(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x0008(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_6E7A[0x4];                                     // 0x000C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class UCanvasPanelSlot*                       CallFunc_SlotAsCanvasSlot_ReturnValue;             // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_GetPosition_ReturnValue;                  // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_X;                          // 0x0020(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_BreakVector2D_Y;                          // 0x0024(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x0028(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                              CallFunc_MakeVector2D_ReturnValue;                 // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x0038(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Less_FloatFloat_ReturnValue;              // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x003D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WB_Message_C_PlayBroadcastMessage) == 0x000008, "Wrong alignment on WB_Message_C_PlayBroadcastMessage");
static_assert(sizeof(WB_Message_C_PlayBroadcastMessage) == 0x000040, "Wrong size on WB_Message_C_PlayBroadcastMessage");
static_assert(offsetof(WB_Message_C_PlayBroadcastMessage, InDeltaSec) == 0x000000, "Member 'WB_Message_C_PlayBroadcastMessage::InDeltaSec' has a wrong offset!");
static_assert(offsetof(WB_Message_C_PlayBroadcastMessage, CallFunc_LessEqual_FloatFloat_ReturnValue) == 0x000004, "Member 'WB_Message_C_PlayBroadcastMessage::CallFunc_LessEqual_FloatFloat_ReturnValue' has a wrong offset!");
static_assert(offsetof(WB_Message_C_PlayBroadcastMessage, CallFunc_Multiply_FloatFloat_ReturnValue) == 0x000008, "Member 'WB_Message_C_PlayBroadcastMessage::CallFunc_Multiply_FloatFloat_ReturnValue' has a wrong offset!");
