#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponBow_BP_Base

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "HottaFramework_classes.hpp"
#include "AkAudio_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass WeaponBow_BP_Base.WeaponBow_BP_Base_C
// 0x0040 (0x1540 - 0x1500)
#pragma pack(push, 0x1)
class alignas(0x10) AWeaponBow_BP_Base_C : public ABowBase
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x1500(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                 ArrowSkeletalMesh;                                 // 0x1508(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         Timeline_0_NewTrack_0_798873564F67A46142E860A1D1E2B780; // 0x1510(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            Timeline_0__Direction_798873564F67A46142E860A1D1E2B780; // 0x1514(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599A[0x3];                                     // 0x1515(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	class UTimelineComponent*                     Timeline_0;                                        // 0x1518(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                   PointLight;                                        // 0x1520(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkAudioEvent*                          AimSound;                                          // 0x1528(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           AimSoundHandle;                                    // 0x1530(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void GamepadPlayAimingSound();
	void OnForceAimingChanged(bool bForceAiming);
	void CreatColorPoint(const struct FLinearColor& Color, float ColorIntensity);
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void K2_TriggerDissolveShowEffect(bool bStarted);
	void K2_TriggerHiddenEffect(bool bOnHand);
	void AimmingEndPlayEffect(bool bAimming);
	void ReceiveDestroyed();
	void WeaponChangePlayEffect(class AWeaponBase* CurrentWeapon, class AWeaponBase* OldWeapon);
	void BowPlayEffectBind();
	void BowPlayEffectUnbind();
	void ReceiveBeginPlay();
	void ExecuteUbergraph_WeaponBow_BP_Base(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"WeaponBow_BP_Base_C">();
	}
	static class AWeaponBow_BP_Base_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AWeaponBow_BP_Base_C>();
	}
};
#pragma pack(pop)
static_assert(alignof(AWeaponBow_BP_Base_C) == 0x000010, "Wrong alignment on AWeaponBow_BP_Base_C");
static_assert(sizeof(AWeaponBow_BP_Base_C) == 0x001540, "Wrong size on AWeaponBow_BP_Base_C");
static_assert(offsetof(AWeaponBow_BP_Base_C, UberGraphFrame) == 0x001500, "Member 'AWeaponBow_BP_Base_C::UberGraphFrame' has a wrong offset!");
static_assert(offsetof(AWeaponBow_BP_Base_C, ArrowSkeletalMesh) == 0x001508, "Member 'AWeaponBow_BP_Base_C::ArrowSkeletalMesh' has a wrong offset!");
static_assert(offsetof(AWeaponBow_BP_Base_C, Timeline_0_NewTrack_0_798873564F67A46142E860A1D1E2B780) == 0x001510, "Member 'AWeaponBow_BP_Base_C::Timeline_0_NewTrack_0_798873564F67A46142E860A1D1E2B780' has a wrong offset!");
static_assert(offsetof(AWeaponBow_BP_Base_C, Timeline_0__Direction_798873564F67A46142E860A1D1E2B780) == 0x001514, "Member 'AWeaponBow_BP_Base_C::Timeline_0__Direction_798873564F67A46142E860A1D1E2B780' has a wrong offset!");
static_assert(offsetof(AWeaponBow_BP_Base_C, Timeline_0) == 0x001518, "Member 'AWeaponBow_BP_Base_C::Timeline_0' has a wrong offset!");
static_assert(offsetof(AWeaponBow_BP_Base_C, PointLight) == 0x001520, "Member 'AWeaponBow_BP_Base_C::PointLight' has a wrong offset!");
static_assert(offsetof(AWeaponBow_BP_Base_C, AimSound) == 0x001528, "Member 'AWeaponBow_BP_Base_C::AimSound' has a wrong offset!");
static_assert(offsetof(AWeaponBow_BP_Base_C, AimSoundHandle) == 0x001530, "Member 'AWeaponBow_BP_Base_C::AimSoundHandle' has a wrong offset!");

}

