#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponBow_BP_Base

#include "Basic.hpp"

#include "AkAudio_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function WeaponBow_BP_Base.WeaponBow_BP_Base_C.GamepadPlayAimingSound
// 0x0038 (0x0038 - 0x0000)
struct WeaponBow_BP_Base_C_GamepadPlayAimingSound final
{
public:
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x0000(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsGamepadAttached_ReturnValue;            // 0x0011(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599B[0x2];                                     // 0x0012(0x0002)(Fixing Size After Last Property [ Dumper-7 ])
	class FName                                   CallFunc_MakeLiteralName_ReturnValue;              // 0x0014(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599C[0x4];                                     // 0x001C(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaCharacter*                        CallFunc_GetOwnerCharacter_ReturnValue;            // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_599D[0x3];                                     // 0x0029(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_SpawnAkcomponentAttacked2_OutPlayingID;   // 0x002C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAkComponent*                           CallFunc_SpawnAkcomponentAttacked2_ReturnValue;    // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponBow_BP_Base_C_GamepadPlayAimingSound) == 0x000008, "Wrong alignment on WeaponBow_BP_Base_C_GamepadPlayAimingSound");
static_assert(sizeof(WeaponBow_BP_Base_C_GamepadPlayAimingSound) == 0x000038, "Wrong size on WeaponBow_BP_Base_C_GamepadPlayAimingSound");
static_assert(offsetof(WeaponBow_BP_Base_C_GamepadPlayAimingSound, ___delegate_Variable) == 0x000000, "Member 'WeaponBow_BP_Base_C_GamepadPlayAimingSound::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_GamepadPlayAimingSound, CallFunc_IsValid_ReturnValue) == 0x000010, "Member 'WeaponBow_BP_Base_C_GamepadPlayAimingSound::CallFunc_IsValid_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_GamepadPlayAimingSound, CallFunc_IsGamepadAttached_ReturnValue) == 0x000011, "Member 'WeaponBow_BP_Base_C_GamepadPlayAimingSound::CallFunc_IsGamepadAttached_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_GamepadPlayAimingSound, CallFunc_MakeLiteralName_ReturnValue) == 0x000014, "Member 'WeaponBow_BP_Base_C_GamepadPlayAimingSound::CallFunc_MakeLiteralName_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_GamepadPlayAimingSound, CallFunc_GetOwnerCharacter_ReturnValue) == 0x000020, "Member 'WeaponBow_BP_Base_C_GamepadPlayAimingSound::CallFunc_GetOwnerCharacter_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_GamepadPlayAimingSound, CallFunc_IsValid_ReturnValue_1) == 0x000028, "Member 'WeaponBow_BP_Base_C_GamepadPlayAimingSound::CallFunc_IsValid_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_GamepadPlayAimingSound, CallFunc_SpawnAkcomponentAttacked2_OutPlayingID) == 0x00002C, "Member 'WeaponBow_BP_Base_C_GamepadPlayAimingSound::CallFunc_SpawnAkcomponentAttacked2_OutPlayingID' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_GamepadPlayAimingSound, CallFunc_SpawnAkcomponentAttacked2_ReturnValue) == 0x000030, "Member 'WeaponBow_BP_Base_C_GamepadPlayAimingSound::CallFunc_SpawnAkcomponentAttacked2_ReturnValue' has a wrong offset!");

// Function WeaponBow_BP_Base.WeaponBow_BP_Base_C.OnForceAimingChanged
// 0x0002 (0x0002 - 0x0000)
struct WeaponBow_BP_Base_C_OnForceAimingChanged final
{
public:
	bool                                          bForceAiming;                                      // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBow_BP_Base_C_OnForceAimingChanged) == 0x000001, "Wrong alignment on WeaponBow_BP_Base_C_OnForceAimingChanged");
static_assert(sizeof(WeaponBow_BP_Base_C_OnForceAimingChanged) == 0x000002, "Wrong size on WeaponBow_BP_Base_C_OnForceAimingChanged");
static_assert(offsetof(WeaponBow_BP_Base_C_OnForceAimingChanged, bForceAiming) == 0x000000, "Member 'WeaponBow_BP_Base_C_OnForceAimingChanged::bForceAiming' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_OnForceAimingChanged, CallFunc_IsValid_ReturnValue) == 0x000001, "Member 'WeaponBow_BP_Base_C_OnForceAimingChanged::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WeaponBow_BP_Base.WeaponBow_BP_Base_C.CreatColorPoint
// 0x0060 (0x0060 - 0x0000)
struct WeaponBow_BP_Base_C_CreatColorPoint final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ColorIntensity;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599E[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ___struct_Variable;                                // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UPointLightComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaRole                                    CallFunc_SwitchRole_OutRole;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaPlatformType                            CallFunc_SwitchPlatform_OutPlatformType;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnlyStandalone_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBow_BP_Base_C_CreatColorPoint) == 0x000010, "Wrong alignment on WeaponBow_BP_Base_C_CreatColorPoint");
static_assert(sizeof(WeaponBow_BP_Base_C_CreatColorPoint) == 0x000060, "Wrong size on WeaponBow_BP_Base_C_CreatColorPoint");
static_assert(offsetof(WeaponBow_BP_Base_C_CreatColorPoint, Color) == 0x000000, "Member 'WeaponBow_BP_Base_C_CreatColorPoint::Color' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_CreatColorPoint, ColorIntensity) == 0x000010, "Member 'WeaponBow_BP_Base_C_CreatColorPoint::ColorIntensity' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_CreatColorPoint, ___struct_Variable) == 0x000020, "Member 'WeaponBow_BP_Base_C_CreatColorPoint::___struct_Variable' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_CreatColorPoint, CallFunc_AddComponent_ReturnValue) == 0x000050, "Member 'WeaponBow_BP_Base_C_CreatColorPoint::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_CreatColorPoint, CallFunc_SwitchRole_OutRole) == 0x000058, "Member 'WeaponBow_BP_Base_C_CreatColorPoint::CallFunc_SwitchRole_OutRole' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_CreatColorPoint, CallFunc_SwitchPlatform_OutPlatformType) == 0x000059, "Member 'WeaponBow_BP_Base_C_CreatColorPoint::CallFunc_SwitchPlatform_OutPlatformType' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_CreatColorPoint, K2Node_SwitchEnum_CmpSuccess) == 0x00005A, "Member 'WeaponBow_BP_Base_C_CreatColorPoint::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_CreatColorPoint, K2Node_SwitchEnum_CmpSuccess_1) == 0x00005B, "Member 'WeaponBow_BP_Base_C_CreatColorPoint::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_CreatColorPoint, CallFunc_IsOnlyStandalone_ReturnValue) == 0x00005C, "Member 'WeaponBow_BP_Base_C_CreatColorPoint::CallFunc_IsOnlyStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_CreatColorPoint, CallFunc_IsValid_ReturnValue) == 0x00005D, "Member 'WeaponBow_BP_Base_C_CreatColorPoint::CallFunc_IsValid_ReturnValue' has a wrong offset!");

// Function WeaponBow_BP_Base.WeaponBow_BP_Base_C.k2_TriggerDissolveShowEffect
// 0x0001 (0x0001 - 0x0000)
struct WeaponBow_BP_Base_C_K2_TriggerDissolveShowEffect final
{
public:
	bool                                          bStarted;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBow_BP_Base_C_K2_TriggerDissolveShowEffect) == 0x000001, "Wrong alignment on WeaponBow_BP_Base_C_K2_TriggerDissolveShowEffect");
static_assert(sizeof(WeaponBow_BP_Base_C_K2_TriggerDissolveShowEffect) == 0x000001, "Wrong size on WeaponBow_BP_Base_C_K2_TriggerDissolveShowEffect");
static_assert(offsetof(WeaponBow_BP_Base_C_K2_TriggerDissolveShowEffect, bStarted) == 0x000000, "Member 'WeaponBow_BP_Base_C_K2_TriggerDissolveShowEffect::bStarted' has a wrong offset!");

// Function WeaponBow_BP_Base.WeaponBow_BP_Base_C.k2_TriggerHiddenEffect
// 0x0001 (0x0001 - 0x0000)
struct WeaponBow_BP_Base_C_K2_TriggerHiddenEffect final
{
public:
	bool                                          bOnHand;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBow_BP_Base_C_K2_TriggerHiddenEffect) == 0x000001, "Wrong alignment on WeaponBow_BP_Base_C_K2_TriggerHiddenEffect");
static_assert(sizeof(WeaponBow_BP_Base_C_K2_TriggerHiddenEffect) == 0x000001, "Wrong size on WeaponBow_BP_Base_C_K2_TriggerHiddenEffect");
static_assert(offsetof(WeaponBow_BP_Base_C_K2_TriggerHiddenEffect, bOnHand) == 0x000000, "Member 'WeaponBow_BP_Base_C_K2_TriggerHiddenEffect::bOnHand' has a wrong offset!");

// Function WeaponBow_BP_Base.WeaponBow_BP_Base_C.AimmingEndPlayEffect
// 0x0001 (0x0001 - 0x0000)
struct WeaponBow_BP_Base_C_AimmingEndPlayEffect final
{
public:
	bool                                          bAimming;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBow_BP_Base_C_AimmingEndPlayEffect) == 0x000001, "Wrong alignment on WeaponBow_BP_Base_C_AimmingEndPlayEffect");
static_assert(sizeof(WeaponBow_BP_Base_C_AimmingEndPlayEffect) == 0x000001, "Wrong size on WeaponBow_BP_Base_C_AimmingEndPlayEffect");
static_assert(offsetof(WeaponBow_BP_Base_C_AimmingEndPlayEffect, bAimming) == 0x000000, "Member 'WeaponBow_BP_Base_C_AimmingEndPlayEffect::bAimming' has a wrong offset!");

// Function WeaponBow_BP_Base.WeaponBow_BP_Base_C.WeaponChangePlayEffect
// 0x0010 (0x0010 - 0x0000)
struct WeaponBow_BP_Base_C_WeaponChangePlayEffect final
{
public:
	class AWeaponBase*                            CurrentWeapon;                                     // 0x0000(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeaponBase*                            OldWeapon;                                         // 0x0008(0x0008)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponBow_BP_Base_C_WeaponChangePlayEffect) == 0x000008, "Wrong alignment on WeaponBow_BP_Base_C_WeaponChangePlayEffect");
static_assert(sizeof(WeaponBow_BP_Base_C_WeaponChangePlayEffect) == 0x000010, "Wrong size on WeaponBow_BP_Base_C_WeaponChangePlayEffect");
static_assert(offsetof(WeaponBow_BP_Base_C_WeaponChangePlayEffect, CurrentWeapon) == 0x000000, "Member 'WeaponBow_BP_Base_C_WeaponChangePlayEffect::CurrentWeapon' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_WeaponChangePlayEffect, OldWeapon) == 0x000008, "Member 'WeaponBow_BP_Base_C_WeaponChangePlayEffect::OldWeapon' has a wrong offset!");

// Function WeaponBow_BP_Base.WeaponBow_BP_Base_C.ExecuteUbergraph_WeaponBow_BP_Base
// 0x0110 (0x0110 - 0x0000)
struct WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_599F[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable;                                // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_1;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_1;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TDelegate<void(bool bAimming)>                K2Node_CreateDelegate_OutputDelegate;              // 0x0048(0x0010)(ZeroConstructor, NoDestructor)
	TDelegate<void(class AWeaponBase* CurrentWeapon, class AWeaponBase* OldWeapon)> K2Node_CreateDelegate_OutputDelegate_1;            // 0x0058(0x0010)(ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bStarted;                             // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOnHand;                              // 0x0069(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A0[0x6];                                     // 0x006A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0070(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0078(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue;            // 0x0080(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A1[0x3];                                     // 0x0081(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0084(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue_1;          // 0x0088(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A2[0x3];                                     // 0x0089(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x008C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_2;                   // 0x0090(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_CustomEvent_bAimming;                       // 0x0098(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue_2;          // 0x0099(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_BoolBool_ReturnValue;          // 0x009A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A3[0x5];                                     // 0x009B(0x0005)(Fixing Size After Last Property [ Dumper-7 ])
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character;       // 0x00A0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x00A8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A4[0x7];                                     // 0x00A9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class UQRSLHandleOperationManager*            CallFunc_K2_GetHandleOperatorManager_ReturnValue;  // 0x00B0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_3;                   // 0x00B8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(bool bAimming)>                K2Node_CreateDelegate_OutputDelegate_2;            // 0x00C0(0x0010)(ZeroConstructor, NoDestructor)
	class AHottaPlayerCharacter*                  K2Node_DynamicCast_AsHotta_Player_Character_1;     // 0x00D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x00D8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_59A5[0x7];                                     // 0x00D9(0x0007)(Fixing Size After Last Property [ Dumper-7 ])
	class AWeaponBase*                            K2Node_CustomEvent_CurrentWeapon;                  // 0x00E0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AWeaponBase*                            K2Node_CustomEvent_OldWeapon;                      // 0x00E8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TDelegate<void(class AWeaponBase* CurrentWeapon, class AWeaponBase* OldWeapon)> K2Node_CreateDelegate_OutputDelegate_3;            // 0x00F0(0x0010)(ZeroConstructor, NoDestructor)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_4;                   // 0x0100(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue_3;          // 0x0108(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base) == 0x000008, "Wrong alignment on WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base");
static_assert(sizeof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base) == 0x000110, "Wrong size on WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, EntryPoint) == 0x000000, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, ___struct_Variable) == 0x000008, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::___struct_Variable' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, ___delegate_Variable) == 0x000018, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, ___struct_Variable_1) == 0x000028, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, ___delegate_Variable_1) == 0x000038, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::___delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_CreateDelegate_OutputDelegate) == 0x000048, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_CreateDelegate_OutputDelegate' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_CreateDelegate_OutputDelegate_1) == 0x000058, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_CreateDelegate_OutputDelegate_1' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_Event_bStarted) == 0x000068, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_Event_bStarted' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_Event_bOnHand) == 0x000069, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_Event_bOnHand' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_GetOwner_ReturnValue) == 0x000070, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_GetOwner_ReturnValue_1) == 0x000078, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_IsLocalClientRole_ReturnValue) == 0x000080, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_IsLocalClientRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_PostEvent_ReturnValue) == 0x000084, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_IsLocalClientRole_ReturnValue_1) == 0x000088, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_IsLocalClientRole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_PostEvent_ReturnValue_1) == 0x00008C, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_GetOwner_ReturnValue_2) == 0x000090, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_GetOwner_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_CustomEvent_bAimming) == 0x000098, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_CustomEvent_bAimming' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_IsLocalClientRole_ReturnValue_2) == 0x000099, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_IsLocalClientRole_ReturnValue_2' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_EqualEqual_BoolBool_ReturnValue) == 0x00009A, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_EqualEqual_BoolBool_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_DynamicCast_AsHotta_Player_Character) == 0x0000A0, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_DynamicCast_AsHotta_Player_Character' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_DynamicCast_bSuccess) == 0x0000A8, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_DynamicCast_bSuccess' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_K2_GetHandleOperatorManager_ReturnValue) == 0x0000B0, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_K2_GetHandleOperatorManager_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_GetOwner_ReturnValue_3) == 0x0000B8, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_GetOwner_ReturnValue_3' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_CreateDelegate_OutputDelegate_2) == 0x0000C0, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_CreateDelegate_OutputDelegate_2' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_DynamicCast_AsHotta_Player_Character_1) == 0x0000D0, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_DynamicCast_AsHotta_Player_Character_1' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_DynamicCast_bSuccess_1) == 0x0000D8, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_DynamicCast_bSuccess_1' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_CustomEvent_CurrentWeapon) == 0x0000E0, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_CustomEvent_CurrentWeapon' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_CustomEvent_OldWeapon) == 0x0000E8, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_CustomEvent_OldWeapon' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, K2Node_CreateDelegate_OutputDelegate_3) == 0x0000F0, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::K2Node_CreateDelegate_OutputDelegate_3' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_GetOwner_ReturnValue_4) == 0x000100, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_GetOwner_ReturnValue_4' has a wrong offset!");
static_assert(offsetof(WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base, CallFunc_IsLocalClientRole_ReturnValue_3) == 0x000108, "Member 'WeaponBow_BP_Base_C_ExecuteUbergraph_WeaponBow_BP_Base::CallFunc_IsLocalClientRole_ReturnValue_3' has a wrong offset!");

}

