#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: WeaponMelee_SingleHandBP_Base

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "HottaFramework_structs.hpp"
#include "AkAudio_structs.hpp"


namespace SDK::Params
{

// Function WeaponMelee_SingleHandBP_Base.WeaponMelee_SingleHandBP_Base_C.ExecuteUbergraph_WeaponMelee_SingleHandBP_Base
// 0x0070 (0x0070 - 0x0000)
struct WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5661[0x4];                                     // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-7 ])
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable;                                // 0x0008(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable;                              // 0x0018(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	TArray<struct FAkExternalSourceInfo>          ___struct_Variable_1;                              // 0x0028(0x0010)(ConstParm, ReferenceParm)
	TDelegate<void(EAkCallbackType CallbackType, class UAkCallbackInfo* CallbackInfo)> ___delegate_Variable_1;                            // 0x0038(0x0010)(ConstParm, ZeroConstructor, NoDestructor)
	bool                                          K2Node_Event_bStarted;                             // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_Event_bOnHand;                              // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5662[0x6];                                     // 0x004A(0x0006)(Fixing Size After Last Property [ Dumper-7 ])
	class AActor*                                 CallFunc_GetOwner_ReturnValue;                     // 0x0050(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 CallFunc_GetOwner_ReturnValue_1;                   // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue;            // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5663[0x3];                                     // 0x0061(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue;                    // 0x0064(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsLocalClientRole_ReturnValue_1;          // 0x0068(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_5664[0x3];                                     // 0x0069(0x0003)(Fixing Size After Last Property [ Dumper-7 ])
	int32                                         CallFunc_PostEvent_ReturnValue_1;                  // 0x006C(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};
static_assert(alignof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base) == 0x000008, "Wrong alignment on WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base");
static_assert(sizeof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base) == 0x000070, "Wrong size on WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, EntryPoint) == 0x000000, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::EntryPoint' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, ___struct_Variable) == 0x000008, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::___struct_Variable' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, ___delegate_Variable) == 0x000018, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::___delegate_Variable' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, ___struct_Variable_1) == 0x000028, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::___struct_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, ___delegate_Variable_1) == 0x000038, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::___delegate_Variable_1' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, K2Node_Event_bStarted) == 0x000048, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::K2Node_Event_bStarted' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, K2Node_Event_bOnHand) == 0x000049, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::K2Node_Event_bOnHand' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, CallFunc_GetOwner_ReturnValue) == 0x000050, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::CallFunc_GetOwner_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, CallFunc_GetOwner_ReturnValue_1) == 0x000058, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::CallFunc_GetOwner_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, CallFunc_IsLocalClientRole_ReturnValue) == 0x000060, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::CallFunc_IsLocalClientRole_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, CallFunc_PostEvent_ReturnValue) == 0x000064, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::CallFunc_PostEvent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, CallFunc_IsLocalClientRole_ReturnValue_1) == 0x000068, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::CallFunc_IsLocalClientRole_ReturnValue_1' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base, CallFunc_PostEvent_ReturnValue_1) == 0x00006C, "Member 'WeaponMelee_SingleHandBP_Base_C_ExecuteUbergraph_WeaponMelee_SingleHandBP_Base::CallFunc_PostEvent_ReturnValue_1' has a wrong offset!");

// Function WeaponMelee_SingleHandBP_Base.WeaponMelee_SingleHandBP_Base_C.k2_TriggerHiddenEffect
// 0x0001 (0x0001 - 0x0000)
struct WeaponMelee_SingleHandBP_Base_C_K2_TriggerHiddenEffect final
{
public:
	bool                                          bOnHand;                                           // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponMelee_SingleHandBP_Base_C_K2_TriggerHiddenEffect) == 0x000001, "Wrong alignment on WeaponMelee_SingleHandBP_Base_C_K2_TriggerHiddenEffect");
static_assert(sizeof(WeaponMelee_SingleHandBP_Base_C_K2_TriggerHiddenEffect) == 0x000001, "Wrong size on WeaponMelee_SingleHandBP_Base_C_K2_TriggerHiddenEffect");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_K2_TriggerHiddenEffect, bOnHand) == 0x000000, "Member 'WeaponMelee_SingleHandBP_Base_C_K2_TriggerHiddenEffect::bOnHand' has a wrong offset!");

// Function WeaponMelee_SingleHandBP_Base.WeaponMelee_SingleHandBP_Base_C.k2_TriggerDissolveShowEffect
// 0x0001 (0x0001 - 0x0000)
struct WeaponMelee_SingleHandBP_Base_C_K2_TriggerDissolveShowEffect final
{
public:
	bool                                          bStarted;                                          // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponMelee_SingleHandBP_Base_C_K2_TriggerDissolveShowEffect) == 0x000001, "Wrong alignment on WeaponMelee_SingleHandBP_Base_C_K2_TriggerDissolveShowEffect");
static_assert(sizeof(WeaponMelee_SingleHandBP_Base_C_K2_TriggerDissolveShowEffect) == 0x000001, "Wrong size on WeaponMelee_SingleHandBP_Base_C_K2_TriggerDissolveShowEffect");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_K2_TriggerDissolveShowEffect, bStarted) == 0x000000, "Member 'WeaponMelee_SingleHandBP_Base_C_K2_TriggerDissolveShowEffect::bStarted' has a wrong offset!");

// Function WeaponMelee_SingleHandBP_Base.WeaponMelee_SingleHandBP_Base_C.CreatPointLight
// 0x0060 (0x0060 - 0x0000)
struct WeaponMelee_SingleHandBP_Base_C_CreatPointLight final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ColorIntensity;                                    // 0x0010(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_5665[0xC];                                     // 0x0014(0x000C)(Fixing Size After Last Property [ Dumper-7 ])
	struct FTransform                             ___struct_Variable;                                // 0x0020(0x0030)(ConstParm, IsPlainOldData, NoDestructor)
	class UPointLightComponent*                   CallFunc_AddComponent_ReturnValue;                 // 0x0050(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaRole                                    CallFunc_SwitchRole_OutRole;                       // 0x0058(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EHottaPlatformType                            CallFunc_SwitchPlatform_OutPlatformType;           // 0x0059(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x005A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_SwitchEnum_CmpSuccess_1;                    // 0x005B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsOnlyStandalone_ReturnValue;             // 0x005C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x005D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight) == 0x000010, "Wrong alignment on WeaponMelee_SingleHandBP_Base_C_CreatPointLight");
static_assert(sizeof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight) == 0x000060, "Wrong size on WeaponMelee_SingleHandBP_Base_C_CreatPointLight");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight, Color) == 0x000000, "Member 'WeaponMelee_SingleHandBP_Base_C_CreatPointLight::Color' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight, ColorIntensity) == 0x000010, "Member 'WeaponMelee_SingleHandBP_Base_C_CreatPointLight::ColorIntensity' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight, ___struct_Variable) == 0x000020, "Member 'WeaponMelee_SingleHandBP_Base_C_CreatPointLight::___struct_Variable' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight, CallFunc_AddComponent_ReturnValue) == 0x000050, "Member 'WeaponMelee_SingleHandBP_Base_C_CreatPointLight::CallFunc_AddComponent_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight, CallFunc_SwitchRole_OutRole) == 0x000058, "Member 'WeaponMelee_SingleHandBP_Base_C_CreatPointLight::CallFunc_SwitchRole_OutRole' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight, CallFunc_SwitchPlatform_OutPlatformType) == 0x000059, "Member 'WeaponMelee_SingleHandBP_Base_C_CreatPointLight::CallFunc_SwitchPlatform_OutPlatformType' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight, K2Node_SwitchEnum_CmpSuccess) == 0x00005A, "Member 'WeaponMelee_SingleHandBP_Base_C_CreatPointLight::K2Node_SwitchEnum_CmpSuccess' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight, K2Node_SwitchEnum_CmpSuccess_1) == 0x00005B, "Member 'WeaponMelee_SingleHandBP_Base_C_CreatPointLight::K2Node_SwitchEnum_CmpSuccess_1' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight, CallFunc_IsOnlyStandalone_ReturnValue) == 0x00005C, "Member 'WeaponMelee_SingleHandBP_Base_C_CreatPointLight::CallFunc_IsOnlyStandalone_ReturnValue' has a wrong offset!");
static_assert(offsetof(WeaponMelee_SingleHandBP_Base_C_CreatPointLight, CallFunc_IsValid_ReturnValue) == 0x00005D, "Member 'WeaponMelee_SingleHandBP_Base_C_CreatPointLight::CallFunc_IsValid_ReturnValue' has a wrong offset!");

}

