#pragma once

/*
* SDK generated by Dumper-7
*
* https://github.com/Encryqed/Dumper-7
*/

// Package: Weapon_ds01BP

#include "Basic.hpp"

#include "HottaFramework_structs.hpp"


namespace SDK::Params
{

// Function Weapon_ds01BP.Weapon_ds01BP_C.K2_ChargeEffectChange
// 0x0002 (0x0002 - 0x0000)
struct Weapon_ds01BP_C_K2_ChargeEffectChange final
{
public:
	EElementalType                                ChargeType;                                        // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Visible;                                           // 0x0001(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Weapon_ds01BP_C_K2_ChargeEffectChange) == 0x000001, "Wrong alignment on Weapon_ds01BP_C_K2_ChargeEffectChange");
static_assert(sizeof(Weapon_ds01BP_C_K2_ChargeEffectChange) == 0x000002, "Wrong size on Weapon_ds01BP_C_K2_ChargeEffectChange");
static_assert(offsetof(Weapon_ds01BP_C_K2_ChargeEffectChange, ChargeType) == 0x000000, "Member 'Weapon_ds01BP_C_K2_ChargeEffectChange::ChargeType' has a wrong offset!");
static_assert(offsetof(Weapon_ds01BP_C_K2_ChargeEffectChange, Visible) == 0x000001, "Member 'Weapon_ds01BP_C_K2_ChargeEffectChange::Visible' has a wrong offset!");

// Function Weapon_ds01BP.Weapon_ds01BP_C.ExecuteUbergraph_Weapon_ds01BP
// 0x0008 (0x0008 - 0x0000)
struct Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EElementalType                                K2Node_Event_ChargeType;                           // 0x0004(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_Event_Visible;                              // 0x0005(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};
static_assert(alignof(Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP) == 0x000004, "Wrong alignment on Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP");
static_assert(sizeof(Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP) == 0x000008, "Wrong size on Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP");
static_assert(offsetof(Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP, EntryPoint) == 0x000000, "Member 'Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP::EntryPoint' has a wrong offset!");
static_assert(offsetof(Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP, K2Node_Event_ChargeType) == 0x000004, "Member 'Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP::K2Node_Event_ChargeType' has a wrong offset!");
static_assert(offsetof(Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP, K2Node_Event_Visible) == 0x000005, "Member 'Weapon_ds01BP_C_ExecuteUbergraph_Weapon_ds01BP::K2Node_Event_Visible' has a wrong offset!");

}

